export const messages = {
  /*
  ##################################################################################
  #                                                                                #
  #  $$$$$$$$\                                                                     #
  #  \__$$  __|                                                                    #
  #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
  #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
  #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
  #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
  #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
  #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  #         Template for translating the tronscan.org website                      #
  #         Version: 1.6-13082018                                                  #
  #         Update Date: 13.08.2018                                                #
  #         Language: Arabic 阿拉伯语                                                      #
  #         Status: Approved Version                                               #
  #         Number of checks: 5                                                    #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  # description and structure of the template                                      #
  #                                                                                #
  # "<name of the variable>": "<corresponding translation>"                        #
  #                                                                                #
  # Note: please concentrate only on the value <corresponding translation>         #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  # global section                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "ok": "OK",
  "app_title": "إتفاقية ترون",
  "password": "كلمة المرور",
  "money_price": "السعر",
  "price": "السعر",
  "blocks": "الكتل",
  "block": "كتلة",
  "name": "الاسم",
  "website": "الموقع",
  "address": "العنوان",
  "sign_out": "خروج",
  "sign_in": "تسجيل الدخول",
  "register_login": "تسجيل \ تسجيل الدخول",
  "register": "تسجيل",
  "login": "تسجيل الدخول",
  "height": "إرتفاع",
  "age": "الوقت",
  "bytes": "البايت",
  "MByte": "ميغا بايت",
  "produced_by": "التي يتم انتاجها",
  "block_reward": "مكافأة الكتل",
  "contract": "العقد",
  "from": "من",
  "to": "الى",
  "value": "القيمة",
  "total_accounts": "العدد الإجمالي للحسابات",
  "submit": "تقديم",
  "send": "إرسال",
  "receive": "استقبال",
  "supply": "إمدادات",
  "view": "عرض",
  "view_all": "عرض الكل",
  "create": "أنشئ",
  "country": "الدولة",
  "amount": "كمية",
  "my_vote": "تصويتي",
  "submit_votes": "تأكيد التصويت",
  "accounts": "الحساب",
  "created": "وقت الانشاء",
  "exchange": "المنصة",
  "next": "التالي",
  "copied_to_clipboard": "تم نسخها إلى الحافظة",
  "cancel": "إلغاء",
  "reset": "إعادة تعيين",
  "error": "خطأ",
  "unlock_keyFile": "افتح ملف المفتاح",
  "enter_password_message": "يجب عليك إدخال كلمة المرور الخاصة بك",
  "password_incorrect": "كلمة مرور خاطئة",
  "try_again": "حاول مرة أخرى",
  "wallet_unlocked": "المحفظة غير مقفلة",
  "weak": "ضعيف",
  "okay": "لا بأس",
  "good": "جيد",
  "strong": "قوي",
  "secure": "حماية",
  "too_short": "قصيرة جدا",
  "status": "الحالة",
  "no_notifications": "لا يوجد إشعار",
  "enable_desktop_notifications": "تمكين إشعارات سطح المكتب",
  "desktop_notification_enabled": "تم تمكين إشعارات سطح المكتب!",
  "notifications_enabled": "تم تمكين الإشعارات",
  "contract_type": "نوع العقد",
  "filters": "الفلتر",
  "send_tokens": "إرسال الرموز",
  "desktop_explorer": "متصفح سطح المكتب",
  "message": "رسالة",
  "wallet_address": "عنوان المحفظة",
  "confirm": "تأكيد",
  "_percentage": "النسبة المئوية",
  "language_support": "حاليا لا يدعم سوى إدخال اللغة الإنجليزية",
  "note": "مذكرة",
  /*
  ##################################################################################
  #                                                                                #
  # navigation section                                                             #
  #                                                                                #
  ##################################################################################
  */
  "blockchain": "البلوكشين",
  "wallet": "المحفظة",
  "home": "الصفحة الرئيسية",
  "transfers": "تحويل",
  "live": "مباشر",
  "statistics": "البيانات",
  "markets": "معلومات السوق",
  "tools": "الأداة",
  "transaction_viewer": "عرض التداول",
  "node_tester": "عقدة الاختبار",
  "system": "النظام",
  "news": "الأخبار",
  "help": "المساعدة",
  "nodes": "العقد",
  "votes": "التصويت",
  "account": "الحساب",
  "tokens": "الرموز",
  "overview": "نظرة عامة",
  "participate": "شارك",
  /*
  ##################################################################################
  #                                                                                #
  # main dashboard                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "tron_main_message": "شبكة لا مركزية",
  "transactions_last_hour": "الساعة الأخيرة من حجم التداول",
  "block_height": "ارتفاع كتلة",
  "online_nodes": "العقد على الشبكة",
  "pice_per_1000trx": "السعر لكل 1000 ترون",
  "vote_for_super_representatives": "التصويت للممثلين الكبار",
  "view_super_representatives": "عرض الممثلين الكبار",
  "create_new_wallet": "قم بإنشاء محفظة جديدة",
  "view_tokens": "عرض الرمز",
  "transactions_last_day": "عدد المعاملات في اليوم الماضي",
  /*
  ##################################################################################
  #                                                                                #
  # tableinformations and statistics                                               #
  #                                                                                #
  ##################################################################################
  */
  "first_page": "الصفحة الاولى",
  "previous_page": "الصفحة السابقة",
  "next_page": "الصفحة التالية",
  "last_page": "الصفحة الأخيرة",
  "page": "صفحة",
  "of": "إجمالا",
  "page_size": "عدد السجلات لكل صفحة",
  "most_nodes": "معظم العقد",
  "loading_nodes": "تحميل العقدة",
  "Hostname": "اسم المضيف",
  "Last Update": "آخر تحديث",
  "first_node_sync_message": "انتظر المزامنة الأولى للعقدة ، يرجى المحاولة مرة أخرى بعد بضع دقائق.",
  "last_block": "الكتلة السابقة",
  "blocks_produced": "عدد الكتل",
  "blocks_missed": "عدد الكتل المفقودة",
  "productivity": "الكفاءة",
  "rewards": "مكافأة",
  "token_created": "تم إنشاء تصريح",
  "witness": "الممثل الأفضل",
  "asset_participation": "المشاركة في إصدار الشهادات",
  "loading_transaction": "تحميل المعاملات",
  "nodes_ranking": "ترتيب العقدة",
  "split_by_country": "حسب البلد / الإقليم",
  "total_accounts_last_day": "إجمالي عدد الحسابات في اليوم السابق",
  "chart_tip": "سحب وإفلات نافذة البيانات للتكبير أو التصغير",
  "link_test_server": "اختبار الشبكة",
  "highest": "الحد الأقصى",
  "lowest": "الحد الأقل",
  "increase": "زيادة",
  "number": "الرقم",
  "_of": "يكون",
  "was_recorded_on": "مسجل في ",
  "rank_real_time": "الترتيب (في الوقت الفعلي) ",
  "volume_24": "حجم التداول على مدار 24 ساعة",
  "billion_usd": "مليار دولار",
  "loading_transfers": "تحميل سجل الحويلات",
  "loading_transactions": "تحميل سجل التداول",
  "loading_block": "تحميل الكتلة",
  "current_power": "حقوق التصويت الحالية",
  "produce_distribution": "كتلة منتج الرسم البياني",
  "confirm_token_issue": "تأكيد مشكلة الرمز",
  "__to": "الى",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain - statistics                                                        #
  #                                                                                #
  ##################################################################################
  */
  "addresses": "العنوان",
  "trx_transferred_past_hour": "المبلغ المحول لعملة ترون في الساعة الماضية",
  "transactions_past_hour": "عدد المعاملات في الساعة الماضية",
  "average_blocksize": "متوسط حجم الكتلة",
  "rich_list": "قائمة الاغنياء",
  "tron_transaction_chart": "الرسم البياني اليومي للتداول في ترون",
  "transactions_per_day": "عدد المعاملات اليومية",
  "foundation": "عنوان المؤسسة",
  "foundation_address": "العدد الاجمالي من عملة ترون المجمدة",
  "unfreeze_time": "وقت التجميد",
  "addresses_number": "عدد العناوين",
  "Confirmed": "تم التأكيد",
  "Unconfirmed": "لم يتم التأكيد",
  /*
  ##################################################################################
  #                                                                                #
  # account section                                                                #
  #                                                                                #
  ##################################################################################
  */
  "set_name": "إعداد الاسم",
  "unique_account_message": "يمكنك فقط تعيين اسم حسابك مرة واحدة",
  "name_to_short": "الاسم قصير",
  "name_to_long": "الاسم طويل",
  "permitted_characters_message": "a-z A-Z 0-9 لا يمكن أن يحتوي الاسم إلا على",
  "change_name": "تغيير الاسم",
  "account_name": "اسم الحساب",
  "show_qr_code": "عرض رمز الاستجابة السريعة",
  "do_not_send_2": "لا تستخدم محفظتك أو تحويل الأموال إلى عنوان الشبكة الاختبارية أعلاه عبر عملية التبادل",
  "bandwidth": "عرض النطاق الترددي",
  "balance": "الرصيد",
  "tron_power": "حقوق التصويت",
  "transactions": "التداول",
  "no_transfers": "لا يوجد تحويل",
  "no_tokens": "لا يوجد رموز",
  "free_bandwidth": "عرض النطاق الترددي المجاني",
  "expires": "فشل",
  "have_been_added_to_your_account": "تمت الإضافة إلى الحساب！",
  "information_message_1": "لا يمكن للشبكة الرئيسية التقدم بطلب للحصول على عملات تجريبية ، يرجى الاتصال بموظفي ترون لتقديم طلب للحصول على عملات تجريبية.",
  "information_message_2": "يمكنك فقط الحصول على 10 ترون لكل حساب.",
  "request_trx_for_testing": "ترون التقدم لاختبار ",
  "token_balances": "أرصدة الرومز",
  "produced_blocks": "عدد الكتل",
  "voters": "التصويت",
  "progress": "التقدم",
  "transactions_count": "{المعاملات ، كليا ، واحد {المعاملة} آخر {المعاملات}}",
  "issuer": "المصدر",
  "network": "الشبكة",
  "current": "الحالي",
  "trx_received": "ترون تم استلام ",
  "test_trx_temporarily_unavailable_message": "يتعذر مؤقتًا استلام اختبار عملة ترون ، يرجى المحاولة مرة أخرى في وقت لاحق.",
  "not_enough_trx": "رصيد ترون لا يكفي",
  "information_message_3": "تم طلب ترون بنجاح. إذا لم تحصل على أي ترون ، فلا يوجد حاليا أي اختبار لترون ، يرجى المحاولة مرة أخرى في وقت لاحق.",
  "send_to_following_address": "نقل إلى العنوان التالي",
  "change_website": "URL تغيير عنوان ",
  "you_must_enter_url": "URL يجب عليك إدخال عنوان ",
  "specify_the_url": "  يرجى تحديد عنوان موقع الويب ",
  /*
  ##################################################################################
  #                                                                                #
  # account freeze                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "freeze": "تجميد",
  "unfreeze": "إلغاء التجميد",
  "freeze_trx_least": "مطلوب 1 ترون على الأقل ليتم التجميد بنجاح.",
  "unable_unfreeze_trx_message": "فشل في التجيمد وقد لا يصل إلى الحد الأدنى لفترة التجميد.",
  "freeze_trx_premessage_0": "TRON Power قم بتجميد ترون مرة أخرى للحصول على طاقة ترون واطلاق العنان للميزات الأخرى ، فعلى سبيل المثال يمكن استخدام ",
  "freeze_trx_premessage_link": "التصويت للممثل الممتاز",
  "freeze_trx_premessage_1": ` سوف يتم "تجميد" ترون لمدة ثلاثة أيام ، حيث لا يمكن استخدام ترون المجمد للتداول ، وبعد ثلاثة أيام يمكن إلغاء تجميد ترون واستخدامه للتداول.`,
  "freeze_trx_premessage_2": ` لا يستطيع كل تجميد الحصول إلا على نطاق ترددي أو طاقة ، ولا يمكنه الحصول على كلا الموارد في نفس الوقت. عندما يقوم مستخدم ما بإلغاء تجميد أحد الموارد ، تكون جميع الأصوات (التصويت) السابقة غير صالحة. لاستخدام أصوات TRON Power المتبقية ، سيحتاج المستخدم إلى إعادة النقر.`,
  "trx_amount": "ترون كمية ",
  "token_freeze_confirm_message_0": "تأكيد التجيمد",
  "token_freeze_confirm_message_1": "على الأقل 3 أيام",
  "frozen_supply": "عدد الأقفال",
  "tokens_unfrozen": "الغاء التجميد عن الرموز",
  "success_tokens_unfrozen_message": "تم الغاء التجيمد للرموز المميزة بنجاح",
  "unable_to_unfreeze": "غير قادر على الغاء التجيمد",
  "Unable_tokens_unfrozen_message": "غير قادر على الغاء تجميد الرموز",
  "tokens_frozen": "تجميد الرموز",
  "successfully_frozen": "تم بنجاح التجيمد",
  "name_changed": "تغيي الاسم",
  "successfully_changed_name_to_message": "تم تغيير الاسم بنجاح",
  "unable_to_rename_title": "غير قادر على إعادة تغيير الاسم",
  "unable_to_rename_message": "حدث خطأ في تحديث اسمك ، يرجى المحاولة مرة أخرى في وقت لاحق",
  "unfreeze_trx_confirm_message": "هل أنت متأكد من أنك تريد إلغاء تجميد ترون؟",
  "unfreeze_assets": "الغاء تجميد الاصول",
  "sure_to_unfreeze_unlocked_tokens_message": "هل انت متأكد من الغاء عملية تجميد الرموز؟",
  "After": "في وقت لاحق",

  /*
  ##################################################################################
  #                                                                                #
  # account superdelegates                                                         #
  #                                                                                #
  ##################################################################################
  */
  "apply_for_delegate": "تقدم بطلب لتصبح ممثل ممتاز",
  "apply_super_representative_candidate": "تقدم بطلب لتصبح مرشح ممثل ممتاز",
  "your_personal_website_address": "عنوان الويب الشخصي",
  "apply_for_delegate_predescription": "كل حامل رمزي لديه الفرصة ليصبح ممثل ممتاز في ترون ومع ذلك ، من أجل جعل الشبكة والعمل المجتمعي أكثر سلاسة وفعالية ، قمنا بتطوير مجموعة من المعايير والأنظمة لجعل المرشحين المؤهلين يصبحون ممثلين ممتازين ، لذلك ايضا سنقوم بزيادة فرصهم في أن يتم انتخابهم بشكل ممثلين ممتازين ، وسيتم تحديث ما يخص الممثل الممتاز الموصى به حديثًا ويتم إصداره مرة واحدة في الأسبوع.",
  "apply_for_delegate_description": "يمكن لكل حامل مميز للرمز أن يتقدم للحصول على مرشح تمثيلي ممتاز من خلال صفحة إدارة الحساب أو التصويت للمرشح في صفحة التصويت ، ويمكن لكل مستخدم التصويت لعدة مرشحين ، ويجب أن يكون الحد الأقصى لعدد الأصوات أقل من أو يساوي عدد ترون التي تم الاحتفاظ بها ، وتعتمد بذلك نتيجة التصويت على نتيجة التصويت النهائي لكل مستخدم ، وسيكون هنالك تحديث الأصوات في الساعة 02:00  و 08:00 و 14:00  و 20:00 بتوقيت امريكا ، يمكن للمستخدمين أيضا عرض عدد التذاكر في الوقت الفعلي ، ويمكن أن يصبح أفضل 27 مرشح من المالكين أكبر عدد من الأصوات بأن يكونوا ممثلين متميزين ، ويتحمل الممثل الممتاز مسؤولية تعبئة المعاملات ، ويكافئ بـ 32 ترون في كل مرة ، كما يمكن للممثلين الـ 27 الممتازين وأعضاء الممثلين المائة الكبار الحصول على مكافآت العقد استنادًا إلى عدد الأصوات ، فللتقدم بطلب للحصول على ترشيح ، يجب عليك اقتطاع رسوم قدرها 9,999 ترون في المرة الواحدة ، مع العلم بأنه لا يستهلك المستخدم الذي يصوت لمرشح الممثل الممتاز عملة ترون",
  "unknown_error": "لقد حدث خطأ غير معروف",
  "representative_understand": "أنا بالفعل أعرف كيف أصبح ممثل ممتاز في ترون",
  "generate_account": "انقر لإنشاء كلمة مرور الحساب والعنوان",
  "create_account_confirm_1": "أنا أعلم أنه إذا نسيت أو فقدت كلمة المرور الخاصة بي ، لن أتمكن من تسجيل الدخول لعرض الأصول خاصتي.",
  "create_account_confirm_2": "أنا أعلم أنه إذا نسيت أو فقدت كلمة المرور الخاصة بي ، فلا توجد طريقة لاستردادها.",
  "create_account_confirm_3": "بالفعل لقد حفظت كلمة المرور خاصتي",
  "vote_thanks": "شكرا لتصويتك!",
  "recent_transactions": "المعاملات الأخيرة",
  "newest_account": "أحدث الحسابات",
  "representatives": "الممثل الممتاز",
  "representativesAcandidates": "الممثل الممتاز وختيار المرشح",
  "most_votes": "أعلى تصويت",
  "start_end_time": "البدء / وقت الانتهاء",
  "scan_qr_code": "مسح رمز الاستجابة السريعة",
  "receive_trx": "ترون إستلام",
  "require_account_to_send": "ترون الرجاء تسجيل الدخول إلى الحساب أولاً ومن ثم أرسل ",
  "require_account_to_receive": "ترون الرجاء تسجيل الدخول إلى الحساب أولاً ومن ثم استقبل ",
  "successful_send": "تم الارسال بنجاح",
  "confirm_transaction": "تأكيد التداول",
  "last_confirmed": "التأكيد النهائي",
  "trx_produced": "المعاملات الناتجة",
  "do_not_send_1": "لا ترسل ترون من محفظتك الخاصة أو تبادل إلى عنوان إختبار الشبكة الخاص بك!",
  "go_to_votelist": "الذهاب إلى قائمة التصويت",
  "understand_tron_sr_message_0": " أنا أعلم كيف أكون ممثلاً ممتازًا في ترون ، أؤكد على الخصم لمرة واحدة",
  "understand_tron_sr_message_1": "للرسوم",
  "invalid_url": "عنوان URL غير صالح",
  "apply_representative_error_message_0": "حدث خطأ عند محاولة التقدم على طلب ممثل ممتاز",
  "apply_representative_error_message_1": "يرجى التأكد من أن حسابك لديه ما يكفي من ترون لدفع الرسوم أو المحاولة مرة أخرى في وقت لاحق.",
  "open_external_link": "أنت تقوم بالفتح عن طريق رابط خارجي",
  "private_key_untrusted_website_message_0": "يرجى عدم إدخال مفتاحك الخاص على موقع ويب غير موثوق به.",
  "no_official_tron_website": "ليس الموقع الرسمي لترون",
  "continue_to_external_website": "الاستمرار في الاستخدام بالموقع الخارجي",
  "visit_third_party_website":"The page you visit will be redirected to a third-party website. There may be security risks. Are you sure you want to continue?",
  "url_changed": "تم تغيير عنوان URL",
  "successfully_changed_website_message": "تم تبديل عنوان موقع الويب بنجاح",
  "unable_to_change_website_title": "غير قادر على تغيير موقع الويب",
  "unable_to_change_website_message": "حدثت مشكلة أثناء تحديث الموقع ، يرجى المحاولة مرة أخرى في وقت لاحق.",
  "successfully_linked_github": "تم الربط بنجاح إلى جيثب!",
  "github_linked": "تم الارتباط مع جيثب!",
  "unable_to_link_github_message": "يتعذر الاتصال بجيثيب ، يرجى التأكد من صحة اسم المستخدم الخاص بك!",
  "could_not_link_github": "يتعذر الاتصال بجيثيب",
  "enter_your_github_username": "أدخل اسم مستخدم جيثيب الخاص بك",
  "link_to_github": "تم الاتصال بجيثيب",
  "link_github": "جيثب متصل",
  "you_must_enter_a_url": "يجب عليك إدخال عنوان موقع الويب",
  "success": "عملية ناجحة",
  "successfully_appied_sr_canidate_message_0": "تم بنجاح تسجيل طلب الترشيح للمثل الممتاز",
  "successfully_appied_sr_canidate_message_1": "ستتم ترقية حسابك قريبًا",
  "landing_page": "الصفحة المقصودة",
  "show_more_information_publish_sr_page": "عرض المزيد من المعلومات حول كيفية نشر معلومات الصفحة",
  "create_sr_landing_page_message_0": "يمكن للممثلين المتميزين إنشاء صفحة مقصودة أيي صفحة خاصه بهم حيث يمكنهم مشاركة المزيد من المعلومات حول فريقهم وخطة عملهم",
  "set_github_url_message_0": "هل قمت بتكوين نموذج جيثب الخاص بك؟ اذا قمت بذلك يمكنك استخدام الزر أدناه لتعيين عنوان موقع الويب",
  "set_github_link": "قم بإعداد رابط جيثب",
  "could_not_claim_rewards": "لا يمكن التقدم بطلب للحصول على مكافأة",
  "claim_rewards_error_message": "حدثت مشكلة أثناء محاولة التقديم للحصول على مكافأة ، يرجى المحاولة مرة أخرى في وقت لاحق.",
  "rewards_claimed": "تم تأكيد المكافأة!",
  "successfully_claimed_rewards": "تم تأكيد المكافأة بنجاح",
  "claim_rewards": "احصل على مكافآت",
  "sr_receive_reward_message_0": "كممثل ممتاز ، سوف تتلقى مكافأة كتلة ، ويمكنك بالفعل المطالبة بهذه المكافآت مرة واحدة كل 24 ساعة.",
  "intro": "المقدمة",
  "budget_expenses": "تكاليف الميزانية",
  "server_configuration": "تكوين الخادم",
  "community_plan": "خطة المجتمع",
  "team": "الفريق",
  /*
  ##################################################################################
  #                                                                                #
  # token creation formular                                                        #
  #                                                                                #
  ##################################################################################
  */
  "name_of_the_token": "إسم الرمز",
  "token_message": "اسم الرمز ، تجنب الاختيار المزدوج",
  "token_abbr": "اختصار الرمز المميز",
  "abbr_message": "اختصار الرمز ، تجنب الاختيار المزدوج للرمز",
  "total_supply": "العرض الكلي",
  "issued_token": "الرموز الصادرة",
  "create_token": "إنشاء رمز",
  "description": "مقدمة",
  "description_url": "عنوان موقع الويب",
  "quote_token_amount": "اقتباس مبلغ الرمز ",
  "base_token_amount": "كمية الرموز الأساسية",
  "creating_a_token": "إنشاء رمز مميز",
  "available": "متاح",
  "testnet": "اختبار الشبكة",
  "days_to_freeze": "عدد الايام المجمده",
  "trx_token_fee_message": "مطلوب 1024 ترون لإصدار رمز مميز جديد",
  "trx_token_account_limit": "يمكنك إنشاء رمز TRC10 واحد فقط لكل حساب",
  "trx_token_wallet_requirement": "تحتاج إلى فتح المحفظة لتكون قادر على إنشاء رمز مميز",
  "invalid_address": "عنوان غير صالح",
  "insufficient_tokens": "الرموز غير كافية",
  "fill_a_valid_number": "يرجى ملىء رقم صحيح",
  "fill_a_valid_address": "يرجى ملىء عنوان صالح",
  "make_another_transaction": "قم بإجراء معاملة أخرى",
  "token_exchange_confirm": "لقد قمت بالتأكيد لدفع رسوم من {قيمة ترون} وعلى توزيع الرمز المميز وبالمقابل الحصول على إجمالي ناتج {قيمة الرمز} من الرموز المميزة",
  "An_unknown_error_occurred,_please_try_again_in_a_few_minutes": "حدث خطأ غير معروف ، يرجى المحاولة مرة أخرى بعد بضع دقائق",
  "An_error_occurred": "حدث خطأ",
  "create_a_token": "قم بإنشاء رمز مميز",
  "not_started_yet": "لم تبدأ بعد",
  "participated": "انضممت بنجاح!",
  "participated_error": "حدث خطأ",


  /*
  ##################################################################################
  #                                                                                #
  # token participate                                                              #
  #                                                                                #
  ##################################################################################
  */
  "buy_confirm_message_0": "هل أنت متأكد من الشراء؟",
  "how_much_buy_message": "ما عدد الرموز التي ترغب في شرائها؟",
  "buy_confirm_message_1": "هل أنت متأكد من أنك تريد الشراء",
  "for": "المجموع",
  "insufficient_trx": " غير كافية ترون ",
  "not_enough_trx_message": "ليس لديك ما يكفي من ترون لشراء ما يكفي من الرموز",
  "ends": "انتهاء",
  "starts": "إبدأ",
  "can_be_unlocked": "يمكن أن يتم فتحه",
  /*
  ##################################################################################
  #                                                                                #
  # global messages                                                                #
  #                                                                                #
  ##################################################################################
  */
  "address_warning": "قم فقط بإدخال عنوان ترون للمحفظة ، مع العلم بأنه اذا قمت بإدخال عنوان غير صحيح يمكن أن يؤدي إلى فقدان ترون",
  "search_address_or_url": "عنوان الاستعلام أو عنوان الويب",
  "the_lunch_test": "الغرض من شبكة الاختبار عبر الإنترنت هو اختبار جميع وظائف مستعرضات الحظر والمحفظة.",
  "please_keep_in_mind": "يرجى ملاحظة أن عنوان الحساب الذي قمت بالتسجيل به مخصص فقط للشبكة الاختبارية ، ولا تقم بتحويل الأموال إلى عنوان الشبكة الاختبارية من خلال محفظتك أو المنصة.",
  "tron_foundation": "مؤسسة ترون",
  "trx_for_testing": "بعد التطبيق الناجح على صفحة إدارة الحساب ، سيتم إرسال ترون إلى حسابك التجريبي.",
  "dear_users": "عزيزي المستخدم ،",
  "finished": "انتهاء",
  "token": "الرمز",
  "url": "url",
  "need_to_login": "يرجى تسجيل الدخول إلى الحساب قبل عرض صفحة الحساب.",
  "thanks_for_applying": "شكرا لك على تسجيل الطلب!",
  "to_much_votes": "عدد كبير جدا من الاصوات",
  "no_trx_remaining": "ترون لا يوجد رصيد من ",
  "show_more": "{countries Length} عرض المزيد من ",
  "vote_guide_message": `استخدم ترون للتصويت للممثل الممتاز
كل ترون  تملكه في حسابك لديه فرصة للتصويت
التصويت لا يخصم منك ترون ، يمكنك التصويت لعدة ممثلين ممتازين والتصويت لعدد غير محدود من المرات
سيتم تحديث عدد الأصوات في الساعة 2:00 و 8:00 و 14:00 و 20:00 كل يوم ، وسيتم تحديث الطلبات`,
  "search_address": "عنوان البحث",
  "token_transactions": "المعاملات الرمزية",
  "token_holders": "أصحاب الرمز المميز",
  "nr_of_Transfers": "عدد التحويلات",
  "not_signed_in": "سوف تحتاج إلى تسجيل الدخول للاستفادة من هذه الوظيفة",
  "loading_map": "تحميل الخريطة",
  "loading_accounts": "تحميل الحسابات",
  "quantity": "الكمية",
  "percentage": "النسبة المئوية",
  "loading_token": "تحميل الرمز",
  "voter_percentage": "نسبة الناخبين",
  "total_balance": "الرصيد الإجمالي",

  /*
  ##################################################################################
  #                                                                                #
  # transaction information                                                        #
  #                                                                                #
  ##################################################################################
  */
  "no_transactions_found": "لم يتم العثور على أي معاملات",
  "no_tokens_found": "لم يتم العثور على أي رموز",
  "no_blocks_found": "لم يتم العثور على كتل",
  "no_votes_found": "لم يتم العثور على الأصوات",
  "no_voters_found": "لم يتم العثور على ناخبين",
  "waiting_for_transactions": "في انتظار المعاملات",
  "loading_address": "تحميل العنوان",
  /*
  ##################################################################################
  #                                                                                #
  # token creation - default messages                                              #
  #                                                                                #
  ##################################################################################
  */
  "details": "التفاصيل",
  "issue_a_token": "إصدار رمز مميز",
  "issue_token": "إصدار رمز",
  "token_name": "إسم الرمز",
  "total_issued": "المجموع الصادر",
  "registered": "تاريخ التسجيل",
  "abbreviation": "الاختصارات",
  "exchange_rate": "اصدار سعر الصرف",
  "token_price": "سعر الرمز",
  "supply_message": "إجمالي إصدار الرمز المميز (بدون دقة)",
  "description_message": "وصف موجز لغرض الرمز",
  "url_message": "عنوان موقع ويب يعرض مزيدًا من المعلومات حول الرمز المميز",
  "exchange_rate_message_0": "حدد سعر رمز مميز واحد عن طريق تحديد عدد الرموز التي سيحصل عليها المشارك لكل ترون يتم انفاقه",
  "exchange_rate_message_1": "سيتلقى المشاركون",
  "exchange_rate_message_2": "لكل",
  "exchange_rate_message_3": "ترون",
  "participation_message_0": "حدد فترة المشاركة التي سيتم خلالها إصدار الرموز المميزة ، وخلال فترة المشاركة يمكن للمستخدمين تبادل ترون",
  "participation_message_1": " الرموز",
  "frozen_supply_message_0": `يمكن تجميد جزء من العرض  ويمكن تحديد كمية التوريد ويجب تجميدها لمدة لا تقل عن يوم واحد ، ولذلك يمكن تجميد العرض المجمد يدويًا بعد تاريخ البدء والوصول إلى أيام التجميد ، مع العلم بأن تجميد العرض غير مطلوب.`,
  "token_issued_successfully": "أصدر الرمز بنجاح",
  "participation": "وقت المشاركة",
  "start_date": "تاريخ البدء",
  "end_date": "تاريخ الانتهاء",
  "token_spend_confirm": "لقد أبلغت أن إصدار البطاقة يتطلب دفعة لمرة واحدة من 1024 ترون",
  "token_issue_guide_message_1": `يمكن أن يتم إصدار رمز مميز على بروتوكول ترون من قبل أي شخص لديه 1024 ترون على الأقل في حسابه.`,
  "token_issue_guide_message_2": `عند إصدار رمز مميز ، سيتم عرضه في الصفحة العامة للرمز المميز.。
   يمكن للمستخدمين بعد ذلك المشاركة في وقت الإصدار وتبادل ترون الخاصة بهم.`,
  "token_issue_guide_message_3": `بعد إصدار الرمز ، سيتلقى حسابك عدد الرموز التي تساوي إجمالي العرض.
    عندما يقوم المستخدمون الآخرون بتبادل ترون الخاص بهم للقطع المميزة ثم الرموز عند ذلك سيتم سحبها من حسابك وستحصل بالمقابل على ترون يساوي سعر الصرف المحدد.`,
  /*
  ##################################################################################
  #                                                                                #
  # token creation - error messages                                                #
  #                                                                                #
  ##################################################################################
  */
  "date_error": "تاريخ الانتهاء سابق أو نفس تاريخ البدء",
  "no_name_error": "الاسم مطلوب",
  "no_supply_error": "يجب أن يكون إجمالي العرض واحد على الأقل",
  "coin_value_error": "يجب أن يكون مقدار الرمز واحد على الأقل",
  "tron_value_error": "يجب أن يكون مقدار ترون لكل عملة واحد على الأقل",
  "invalid_starttime_error": "تاريخ البدء المقدم غير صالح",
  "invalid_endtime_error": "تاريخ الانتهاء المقدم غير صالح",
  "no_description_error": "يرجى ملىء الوصف",
  "no_url_error": "يرجى إدخال عنوان الويب الخاص بموقع الويب",
  "past_starttime_error": "تاريخ بدء أقدم من تاريخ اليوم",
  "no_transactions": "لا يوجد معاملات",
  "errors_in_form": "هناك أخطاء في النموذج",
  "token_link_message_0": "الرمز المميز سيكون متاحا على",
  "token_link_message_1": "صفحة الرموز",
  "token_link_message_2": "في بضع دقائق",
  "description_error_message_0": "يجب ألا يزيد الوصف عن 200 حرف",
  "token_creation_error": "حدث خطأ أثناء محاولة إنشاء الرمز المميز",
  "tokenname_error_message_0": "لا يجوز أن يزيد الاسم عن 32 حرفًا",
  "tokenname_error_message_1": "a-Z يحتوي الاسم فقط على أحرف ",
  "abbreviation_required": "تحتاج إلى تعيين اختصار",
  "abbreviation_error_message_0": "الاختصارات لا تحتاج لأكثر من 5 أحرف",
  "abbreviation_error_message_1": "لا يمكن أن يحتوي الاختصار إلا على أحرف a-Z",
  /*
  ##################################################################################
  #                                                                                #
  # representatives section                                                        #
  #                                                                                #
  ##################################################################################
  */
  "highest_productivity": "أعلى إنتاجية",
  "lowest_productivity": "أقل إنتاجية",
  "Super Representatives": "الممثل الممتاز",
  "Super Representative Candidates": "مرشحين الممثلين الممتازين",
  "loading_representatives": "تحميل الممثلين",
  "address_not_super_representative": "هذا العنوان ليس لممثل الممتاز",
  "unable_load_representatives_page_message": "يتعذر تحميل الصفحة ، قد يكون العنوان غير صالح ، والعنوان ليس لممثل الممتاز أو لم يقم الممثل بتهيئة هذه الصفحة بعد",
  "loading_representative": "تحميل الممثل الممتاز",
  /*
  ##################################################################################
  #                                                                                #
  # markets section                                                                #
  #                                                                                #
  ##################################################################################
  */
  "average_price_usd": "متوسط السعر بالدولار الأمريكي",
  "average_volume_usd": "متوسط الحجم بالدولار الأمريكي",
  "Trade Volume": "حجم التداول بالدولار الأمريكي",
  "rank": "المرتبة",
  "pair": "زوج التداول",
  "volume": "حجم التداول",
  "usd": "دولار",
  "average_price": "متوسط ​​سعر ترون ",
  "click_the_chart_title_to_find_more": "انقر على عنوان المخطط لرؤية المزيد من المعلومات",
  /*
  ##################################################################################
  #                                                                                #
  # votes section                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "next_round": "الجولة القادمة من التصويت",
  "total_votes": "مجموع الاصوات",
  "most_ranks": "في المرتبة الاكثر تقدماً",
  "view_live_ranking": "عرض الترتيب المباشر",
  "open_team_page": "افتح صفحة الفريق",
  "warning_votes": "مطلوب على الأقل واحد من طاقة ترون لبدء التصويت ، وسيتم اكتساب طاقة ترون بواسطة تجميد عملة ترون على",
  "account_page": "صفحة الحساب",
  "loading_votes": "تحميل الاصوات",
  "3_day_ranking": "ترتيب 3 أيام (أفضل 10)",
  "live_ranking": "الترتيب المباشر",
  "live_ranking_msg": "يتم التحديث كل 15 ثانية ، قد تستغرق ظهور الأصوات الجديدة ما يصل إلى دقيقة أو دقيقتين قبل أن يتم احتسابها",
  "candidate": "مرشح",
  "current_votes": "الأصوات الحالية",
  "click_to_start_voting": "انقر هنا لبدء التصويت",
  "votes_remaining_message": "الأصوات المتبقية",
  "open_wallet_start_voting_message": "فتح المحفظة لبدء التصويت",
  "thanks_submitting_vote_message": "شكرا لتقديم التصويت!",
  "need_min_trx_to_vote_message": "تحتاج على الأقل لواحد ترون لتكون قادر على التصويت",
  "to_much_votes_massage": "قد أنفقت الكثير من الأصوات!",
  "all_votes_are_used_message": "لقد استهلكت كل الأصوات!",
  "submissing_vote_message_title": "شكرا لك على التصويت!",
  "submissing_vote_message_0": "يتم إرسال الأصوات بنجاح ، وستدخل حيز التنفيذ عندما تبدأ دورة التصويت التالية.",
  "submissing_vote_message_1": "يمكنك إعادة توزيع الأصوات الخاصة بك في أي وقت تشاء",
  "submitting_vote_error_message": "حدث خطأ ما أثناء إرسال أصواتك ، الرجاء معاودة المحاولة في وقت لاحق.",
  "loading_super_representatives": "جاري تحميل الممثل الممتاز",
  /*
  ##################################################################################
  #                                                                                #
  # transaction Viewer                                                             #
  #                                                                                #
  ##################################################################################
  */
  "info_tx_viewer": "hex لعرض محتوى المعاملة ومن ثم بث المعاملة عبر الشبكة بالكامل ستحتاج الى لصق قيمة تجزئة المعاملة وهي",
  "load_tx": "تحميل المعاملات",
  "tx_qrcode": "رمز الاستجابة السريعة للمعاملة",
  "load_tx_qrcode": "مسح رمز الاستجابة السريعة لتحميل المعاملة",
  "transaction_load_error": "خطأ في تحميل المعاملة",
  "transaction_load_error_message": "حدث خطأ أثناء تحميل المعاملة ، الرجاء التأكد من أن قيمة تجزئة المعاملة في الشكل الصحيح.",
  "transaction_success_message": "نجاح بث المعاملات",
  "transaction_success": "نجاح عملية التداول",
  "transaction_error_message": "حدث خطأ ما أثناء محاولة بث العملية",
  "transaction_error": "خطأ في المعاملات",
  "confirm_transaction_message": "هل أنت متأكد من أنك تريد إرسال المعاملة؟",
  "broadcast_transaction_to_network": "بث المعاملات إلى الشبكة",
  /*
  ##################################################################################
  #                                                                                #
  # tools node tester                                                              #
  #                                                                                #
  ##################################################################################
  */
  "node_tester_msg": "GRPC أدخل العنوان الخاص بالعقدة لاختبار اتصال",
  "node_tester_stop": "يرجى توقيف الاختبار",
  "node_tester_test": "GRPC إختبار",
  "node_tester_rt": "وقت الاستجابة",
  "confirmed_block": "تم تأكيد الكتلة",
  "loading": "جاري التحميل",
  "connection_node": "الاتصال بالعقدة",
  /*
  ##################################################################################
  #                                                                                #
  # tools scanner                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "no_webcam_found": "لم يتم العثور على كاميرا ويب",
  "trying_enable_webcam_message_0": "حدث خطأ أثناء فتح كاميرا الويب",
  "trying_enable_webcam_message_1": "يرجى التأكد بأن الكاميرا قيد التشغيل",
  /*
  ##################################################################################
  #                                                                                #
  # help section                                                                   #
  #                                                                                #
  ##################################################################################
  */
  "what_is_tron": "TRON whitepaper V2.0",
  "tron_explorer_api": "TRONSCAN API",
  "tron_architechure": "TRON Architecture",
  "tron_protobuf_doc": "TRON Protobuf Doc",
  "report_an_error": "عرض الخطأ / تقديم اقتراح",
  "frequently_asked_questions": "الأسئلة المتداولة",
  "telegram_updates": "Telegram تحديث ",
  /*
  ##################################################################################
  #                                                                                #
  # wallet section                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "open_wallet": "تسجيل الدخول",
  "private_key": "مفتاح خاص",
  "keystore_file": "ملف تخزين المفاتيح",
  "select_file": "إختار الملف",
  "login_mobile": "تسجيل الدخول باستخدام جهازك المحمول",
  "create_wallet": "قم بإنشاء محفظة",
  "no_open_wallet": "المحفظة غير مفتوحة للعرض",
  "new_wallet": "محفظة جديدة",
  "password_encr_key_message_0": "يتم استخدام كلمة المرور هذه لتشفير المفتاح الخاص ولا يتم استخدامه لإنشاء المفتاح الخاص.",
  "password_encr_key_message_1": "تحتاج إلى استخدام كلمة المرور هذه والمفتاح الخاص لإلغاء قفل محفظتك.",
  "strong_password_info": "يرجى استخدام كلمة مرور قوية",
  "save_keystore_file": "احفظ ملف تخزين المفاتيح الخاص",
  "download_keystore_file": "تحميل المفتاح",
  "do_not_lose_it": " كن على حذر من فقدان المفتاح الخاص!",
  "do_not_lose_it_message_0": "لا يمكن لمؤسسة ترون مساعدتك في استرداد المفتاح المفقود",
  "do_not_share_it": "لا تشاركه أو تظهره لأحد!",
  "do_not_share_it_message_0": "قد يتم سرقة أموالك إذا كنت تستخدم هذا الملف في موقعًا ضارًا",
  "make_a_backup": "قم بعمل نسخة احتياطية!",
  "make_a_backup_message_0": "فقط في حالة حدوث خلل لجهاز الكمبيوتر المحمول ",
  "save_private_key": "قم بحفظ مفتاحك الخاص",
  "print_paper_wallet": "إطبع ورقة للمحفظة",
  "new_wallet_ready_message": "المحفظة الجديدة أصبحت جاهزة",
  "go_to_account_page": "أدخل صفحة الحساب",
  "login_first": "يرجى أولاً تسجيل الدخول إلى المحفظة ",
  "contract_name": "إسم التعاقد",
  "compiler": "إصدار مترجم",
  "tx_count": "عدد المعاملات",
  "setting": "الإعدادات",
  "date_verified": "تاريخ التحقق",
  "compiler_version": "إصدار مترجم",
  "creator": "عقد المطور ",
  "verify_contract_code": "رمز عقد التحقق",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain block                                                               #
  #                                                                                #
  ##################################################################################
  */
  "hash": "هش",
  "time": "الوقت",
  "parenthash": "Parent Hash",
  "size": "الحجم",
  "blockchain_size": "حجم البلوكشين",
  /*
  ##################################################################################
  #                                                                                #
  # ledger help page                                                               #
  #                                                                                #
  ##################################################################################
  */
  "ledger_guide": "ledger دليل",
  "requirements": "المتطلبات",
  "using_ledger_steps_message_0": "يتطلب استخدام ليدجر باستخدام ترون سكان مع الخطوات التالية:",
  "a": "A",
  "install_the": "تثبيت",
  "app": "APP",
  "install_latest_version_message_0": "قم بتثبيت أحدث إصدار",
  "opening_your_wallet": "المحفظة مفتوحه",
  "open_the_tronscan_desktop_client": "افتح مستكشف بلوكشين::",
  "click_open_wallet_top_right": `"تسجيل الدخول" في الجزء العلوي الأيسر`,
  "choose_ledger": "Ledger إختر",
  "connect_unlock_ledger_with_pin": "قم بتوصيل جهازك وإلغاء قفله باستخدام رمز بي اي ان الخاص بك",
  "open_tron_app_on_ledger": "افتح تطبيق ترون على ليدجر الخاص بك",
  "ledger_connected_tronscan_message_0": `إذا كان ليدجر الخاص بك متصلاً بشكل صحيح ، فستعرض ترون سكان كلمة "متصل"`,
  "click_on_open_wallet": `انقر على "فتح المحفظة"`,
  "redirect_to_your_wallet_message": "ستتم إعادة توجيهك إلى محفظتك ويمكنك عرض عنوان ترون الخاص بك",
  "using_ledger_to_sign_transactions": "استخدام ليدجر لتوقيع المعاملات",
  "using_ledger_to_sign_transactions_message_0": "تأكد من إبقاء ليدجر متصلاً وفتح تطبيق ترون لتوقيع المعاملات باستخدام ليدجر أثناء استخدام ترون سكان",
  "using_ledger_to_sign_transactions_message_1": "ستظهر ترون سكان نافذة منبثقة تحتوي على تفاصيل المعاملة عندما يكون توقيع الصفقة مطلوبًا ، والتوقيعات أيضا مطلوبة عند التصويت وعند وإرسال ترون وتغيير اسم الحساب وما إلى ذلك.",
  "ledger_note": "انتبه",
  "ledger_note_message_1": "Ledger Nano S,Ledger Nano X,Ledger Blue الآن فقط يوجد دعم لـ ",
  "ledger_note_message_2": "Google Chrome استخدم متصفح ",
  "ledger_note_message_3": "وظائف الدعم: نقل TRX ، نقل TRC 10 ، نقل TRC 20 ، تجميد TRX ، تجميد TRX ، التصويت ، تعيين اسم الحساب",
  "ledger_note_message_4": "الميزات غير متوفرة حاليًا:  إلغاء الرموز المميزة لتي ار سي 10 ، إنشاء الرمز المميز ، ترون ماركت ، تطبيق الممثل الممتاز ، تطبيق مكافآت الممثل الممتاز ، تحديث جيثيب ، إنشاء زوج التداول ، ضخ رأس المال وسحب رأس المال.",
  /*
  ##################################################################################
  #                                                                                #
  # userinfo - popup notification                                                  #
  #                                                                                #
  ##################################################################################
  */
  "record_not_found": "السجل غير موجود!",
  "warning": "تحذير",
  "login_success": "تم تسجيل الدخول بنجاح",
  "logout_success": "تم تسجيل الخروج بنجاح",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain - Live                                                              #
  #                                                                                #
  ##################################################################################
  */
  "applied_for_super_representative": "تقديم طلب للحصول على ممثل ممتاز",
  "sr_candidature": "مرشح الممثل الممتاز",
  "created_token": "تم إنشاء الرمز المميز",
  "token_creation": "إنشاء الرمز المميز",
  "bought": "شراء",
  "voter": "المصوتون",
  "voting": "تصويت",
  "asset": "الأصول",
  "token_transfer": "نقل الرمز المميز",
  /*
  ##################################################################################
  #                                                                                #
  # buy Tron                                                                       #
  #                                                                                #
  ##################################################################################
  */
  "buy_trx": "ترون شراء",
  "buy_trx_message_0": "Changelly.com  يمكن شراء ترون مباشرة مع فیات أو غيرها من العملات بدون منصة وهي الطريقة الأسهل والأسرع لشراء ترون ، ويمكن العثور على قائمة بالعملات المدعومة والأسئلة الشائعة باستخدام هذه الخدمة لشراء العملة فی موقع ：",
  "buy_trx_using_changelly": "Changelly شراء ترون باستخدام",
  "cant_load_widget": "لا يمكن تحميل الاداه",
  /*
  ##################################################################################
  #                                                                                #
  # new variables                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "date": "التاريخ",
  "total_transactions": "مجموع المعاملات",
  "avg_blockTime": "متوسط وقت الكتلة",
  "avg_blockSize": "متوسط حجم الكتلة",
  "total_BlockCount": "مجموع عدد الكتل",
  "new_address_seen": "العنوان الجديد",
  "transfer_contract": "عقد التحويل",
  "TRX_transfer_between_addresses": "نقل ترون بين العناوين",
  "transfer_asset_contract": "تحويل عقد الأصول",
  "token_transfer_between_addresses": "نقل الرمز بين العناوين",
  "participate_asset_issue_contract": "مشاركة عقد إصدار الأصول",
  "participate_token_between_addresses": "شارك رمزًا مميزًا بين العناوين",
  "witness_update_contract": "عقد تحديث الممثل الممتاز",
  "updates_a_witness": "تحديث الممثل الممتاز",
  "witness_create_contract": "إنشاء عقد الممثل الممتاز",
  "create_a_witness": "إنشاء ممثل ممتاز",
  "account_update_contract": "تحديث عقد الحساب",
  "update_account_name": "تحديث اسم الحساب",
  "withdraw_balance_contract": "عقد السحب النقدي",
  "withdraw_balance": "سحب",
  "freeze_balance_contract": "عقد التجميد",
  "freeze_TRX": "ترون تجميد",
  "unfreeze_balance_contract": "الغاء تجميع عقد الرصيد",
  "unfreeze_TRX": "ترون إلغاء تجميد",
  "vote_witness_contract": "عقد تصويت الممثل الممتاز",
  "vote_for_a_witness": "صوت للممثل الممتاز",
  "asset_issue_contract": "عقد إصدار الأصول",
  "issue_a_new_asset": "اصدار الاصول",
  "owner_address": "عنوان المالك",
  "frozen_balance": "الأرصدة المجمدة",
  "frozen_days": "الأيام المجمدة",
  "counts": "عدد الاصوات",
  "TRX_exchange_rate": "ترون سعر صرف",
  "start_time": "وقت البدء",
  "end_time": "وقت الانتهاء",
  "contracts": "العقد",
  "search_description": "عنوان البحث ، ارتفاع الكتلة ، تجزئة المعاملة ، اسم الرمز المميز",
  "search_description1": "عنوان البحث ، الحظر ، المعاملة ، الرمز المميز",
  "transaction": "التداول",
  "total_addresses": "مجموع العناوين",
  "daily_increment": "الزيادة اليومية",
  "address_growth_chart": "الرسم البياني لعنوان مخطط النمو",
  "addresses_amount": "عدد العناوين",
  "past_14_days_of_transactions": "عدد المعاملات في الـ 14 يومًا الماضية",
  "address_growth": "نمو العنوان",
  "power": "حقوق التصويت",
  "token_transfers": "تحويل الرموز",
  "search": "بحث",
  "inter_tnxl": "عقد المعاملات الداخلية",
  "inter_a_total": "مجموعه من",
  "inter_transactions_found": "المعاملات الداخلية",
  "website_url": "الموقع الرسمي",
  "language_support": "حاليا لا يدعم سوى إدخال اللغة الإنجليزية",
  "note": "إنتبه",
  "_percentage": "نسبة مئوية",
  "foundation": "عنوان المؤسسة",
  "foundation_address": "العدد الإجمالي لأقفال ترون في المؤسسة",
  "unfreeze_time": "وقت الغاء التجميد",
  "addresses_number": "عدد العناوين",
  "copyright": "حقوق النشر",
  /*
    ##################################################################################
    #                                                                                #
    # new variables    20180822 17:11:52                                                              #
    #                                                                                #
    ##################################################################################
  */
  "tron_convert_tool": "أداة تحويل الشفرة",
  "breakdown_supply_types": "ترون توزيع",
  "genesis": "الافراج عن كتلة التكوين",
  "TRX_distribution_overview": "ترون نظرة عامة على توزيع",
  "block_produce_rewards": "إنتاج مكافآت الكتل",
  "node_rewards": "مكافأة العقد",
  "independence_day_burned": "الحرق بيوم الاستقلال",
  "fee_burned": "الرسوم المحروقة",
  "current_total_supply": "السيولة النقدية الحالية",
  "foundation_freeze": "تجميد المؤسسة",
  "price_per_1000_trx": "سعر ترون 'لكل 1000 ترون' ",
  "in_USD": "بالدولار الأمريكي",
  "in_BTC": "في بيتكوين",
  "total_TRX_supply": "إجمالي السيولة في ترون",
  "market_capitalization": "القيمة السوقية",
  "circulating_supply": "العرض المتداول",
  "list_trx": "قائمة ترون",
  "burned_trx": "ترون حرق",
  "supply_notes": "التمويل الجماعي ومبيعات ما قبل البيع في جميع أنحاء العالم ، باستثناء الولايات المتحدة والصين واليابان",
  "14_day_transaction_history": " عدد المعاملات في الـ 14 يومًا الماضية",
  "14_day_address_growth": " حالة النمو خلال الـ 14 يومًا الماضية",

  /*
  ##################################################################################
  #                                                                                #
  # ICO--rating page                                                              #
  #                                                                                #
  ##################################################################################
  */
  "TRONRating": "الرمز المميز لترون",
  "rating_title": "Tronscan Token نظام تقييم",
  "modify_on": "تاريخ التعديل",
  "rating_description": "يهدف نظام تقييم ترون سكان إلى مساعدة المستخدمين على فهم وتمييز وتقييم الرموز المختلفة ، فعند زيارة صفحة الرمز المميز ، يتم تصنيف التقييم إلى 5 فئات:",
  "rating_status_1": "في انتظار المراجعة",
  "rating_status_1_desc_a": "لم تتم مراجعتها بعد",
  "rating_status_2": "OK",
  "rating_status_2_desc": `التصنيف الائتماني للإختيار "لا بأس" ليس بمصادقة أو توصية ، بل يتضمن مجموعة من المعايير التالية:`,
  "rating_status_2_desc_a": "توفير معلومات دقيقة كافية",
  "rating_status_2_desc_b": "توضيح أهداف المشروع وقنوات الاتصال",
  "rating_status_2_desc_c": "معلومات مرئية عن راعي المشروع / المستثمرين / الاستشاريين",
  "rating_status_2_desc_d": "AML / KYC يتم تداول الرمز / مدرج في تبادل العملة مع الفحص لـ ",
  "rating_status_2_desc_e": "تم اكتمال التمويل الجماعي أو يمكن تنشط التمويل الجماعي لمدة لا تقل عن 3 أشهر",
  "rating_status_2_desc_f": "حقق مراحل مهمة",
  "rating_status_3": "محايد",
  "rating_status_3_desc": "'يعني التصنيف الائتماني للمحايدة أن الطرف المشروع لديه إفصاح كافٍ نسبياً عن المعلومات:",
  "rating_status_3_desc_a": "تقديم المعلومات الضرورية والكافية (الموقع الرسمي ، الشعار ، البريد الإلكتروني الرسمي للاتصال ، الورقة البيضاء)",
  "rating_status_3_desc_b": "LinkedIn راعي المشروع / المستثمر / معلومات مرئية موثقة من الاستشاريين ، ومع العلم بأن هذا البند مدرج أيضا في ملف تعريف",
  "rating_status_3_desc_c": "تقديم الدعم للمواد الإعلامية الاجتماعية",
  "rating_status_4": "معلومات غير كافية",
  "rating_status_4_desc_a": "عدم تقديم المعلومات الضرورية والكافية (الموقع الرسمي ، الشعار ، البريد الإلكتروني الرسمي للاتصال ، الورقة البيضاء)",
  "rating_status_4_desc_b": "لا توجد بيانات تبين أن المشروع قد استمر في التقدم المستمر",
  "rating_status_5": "المعلومات خاطئة",
  "rating_status_5_desc_a": "استخدام هوية مزيفة لإصدار رمز مميز",
  "rating_status_5_desc_b": "هناك معلومات تشير إلى أن سلوك الاحتيال / التصيد أو حتى البريد الالكتروني غير المرغوب فيه أو التحريفات المتعلقة بهذا الرمز لم يتم التعامل معها ، أو أن الرمز المميز له علامات 'خطيرة' أخرى",
  "rating_disclaimer": "شروط",
  "disclaimer_desc_1": "لا يدعم متصفح ترون بلوكشين أية خدمات أو عناصر تتعلق بالعقود الرمزية المعروضة على متصفح ترون بلوكشين ولا يوافق عليها ويخلي مسؤوليته ، لذلك يجب على المستخدمين إجراء أبحاثهم وتحقيقاتهم الخاصة قبل اتخاذ أي إجراء يتعلق بالرمز خاصةً عندما يتعلق الأمر بالاستثمار الكبير",
  "disclaimer_desc_2": "قد تكون التقييمات المرتبطة بهذه الخدمة دقيقة أو غير دقيقة لأنها تستند إلى تقييمات ذاتية وتقارير من المجتمع ، ونحن لا نتحمل أي مسؤولية عن المحتوى أو الدقة أو الموثوقية ، ولا يشكل تصنيفنا الائتماني أية نصائح سلوكية ، خاصةً المشورة في مجال الاستثمار",
  "disclaimer_desc_3": "نحن نحتفظ بالحق في تفسير التقييم الرمزي بالرفض او القبول في هذه الصفحة ، ونحن لسنا ملزمين بتقديم أي ملاحظات حول أسباب الرفض ، نحن نحتفظ بالحق في حذف أو تحديث المعلومات (بما في ذلك التقييمات) في حالة وجود معلومات خاطئة أو تناقضات",

  /*
    ##################################################################################
    #                                                                                #
    # ICO--myToken page                                                              #
    #                                                                                #
    ##################################################################################
   */
  "my_created_token": "الرمز الخاص بي",
  "my_token_desc_1": "سيتم عرض المعلومات المتعلقة بالرمز على صفحة الرمز المميز ، وكل رمز على أساس شمولية وصحة المعلومات سيحصل على",
  "tron_rating": "تقييم الرمز",
  "my_token_desc_2": " token@tronscan.org إذا كنت بحاجة إلى تحديث معلوماتك ، فيرجى إرسال التحديثات باستخدام نموذج ملف إكسل عبر البريد الإلكتروني للشركة أو البريد الإلكتروني المعتمد باستخدام بيانات الاعتماد اللازمة",
  "brief_info": "مقدمة",
  "website_official": "الموقع الرسمي",
  "white_paper": "الورقة البيضاء",
  "GitHub": "GitHub",
  "country": "الدولة",
  "social_link": "رابط وسائل الاعلام الاجتماعية",
  "download_excel": "تحميل النموذج",
  "no_message": "لا ، الرجاء إرسال بريد إلكتروني لإضافة معلومات",
  "insufficient_message": "معلومات غير كافية",
  "neutral": "محايد",
  "pending": "قيد المراجعة",
  "fake": "زائف",
  "token_detail": "تفاصيل الرمز",
  "contact_us": "تواصل معنا",
  "my_token": "الرمز الخاص بي",
  "try_later": "يرجى المحاولة مرة أخرى في وقت لاحق",
  "contract_address": "عنوان العقد",
  /*
  ##################################################################################
  #                                                                                #
  # ICO--create token page                                                         #
  #                                                                                #
  ##################################################################################
  */
  "basic_info": "المعلومات الأساسية",
  "basic_info_desc": "معلومات أساسية عن الرمز",
  "exchange_setting": "إعدادات الإصدار",
  "exchange_setting_desc": "حدد السعر والوقت لكل رمز",
  "freeze_setting": "ضبط وضع القفل",
  "freeze_setting_desc": "جزء قابل للقفل من تمرير الوقت المحدد",
  "confirm_setting": "تأكيد الإعدادات",
  "confirm_setting_desc": "تأكيد جميع المعلومات",
  "token_logo": "شعار الرمز ",
  "image_restraint_desc": "jpg / png النمط 1: 1 للشكل المقترح",
  "prev_step": "الخطوة السابقة",
  "freeze_on": "تفعيل",
  "freeze_off": "توقيف",
  "freeze_not_valid": "لا تقم بتفعيل إعدادات التأمين",
  "no_logo_error": "لم يتم تحميل الشعار",
  "confirm_issue_info": "يرجى التأكد من صحة المعلومات التالية ، لن يكون العقد قابلاً للتعديل بعد كتابته إلى البلوكشين",
  "tick_checkbox": "تحتاج إلى التحقق للتأكيد",
  "change_info": "معلومات غير دقيقة؟ تحقق من معلومات تحديث الهوية من فضلك",
  "total": "مجموع",
  "a_totle": "المجموع",
  "transaction_info": "معلومات المعاملة",
  "hold_addr": "أصحاب الرمز المميز",
  "transactions_unit": "معاملة",
  "transfers_unit": "التحويل",
  "block_unit": "كتلة",
  "record_unit": "السجل",
  "token_unit": "الرموز",
  "voter_unit": "المرشحين",
  "vote_unit": "المصوتون",
  "account_unit": "حساب",
  "address_unit": "عنوان",
  "contract_unit": "تم التحقق من العقد",
  "inter_contract_unit": "عقد تداول داخلي",

  /*
  ##################################################################################
  #                                                                                #
  # ICO--participate page                                                         #
  #                                                                                #
  ##################################################################################
  */

  "issue_progress": "إحراز تقدم",
  "fund_raised": "رفع التمويل",
  "issuing_price": "سعر الإصدار",
  "buy_token_info": "كم عدد الرموز التي ترغب في شرائها؟",
  "reputation": "تصنيف الائتمان",
  "issue_time": "وقت الإصدار",
  "success_receive": "تم الإستلام بنجاح",
  "circulating_supply": "السيولة",
  "issue_info": "إصدار المعلومات",
  "transferring": "جاري التحويل",
  "in_progress": "جاري المعالجة",
  "fail_transaction": "فشل في عملية التداول",
  "records": "السجلات",
  "part_total": "المجموع الحالي",
  "part_pass": "تم العثور على الرموز المميزة",
  "view_total": "المجموع الحالي",
  "view_pass": "يمكن للرموز المميزة المشاركة في الإصدار",
  "token_overview_tron": "نظرة عامة على سوق الرمز المميز لترون",
  "token_participate_tron": "المشاركة في إصدار الرمز لترون",
  "not_started": "لم تبدأ بعد",
  "no_token_to_buy": "عذرًا ، لقد تم إصدار جميع المعلومات المتداولة ، يرجى الانتظار حتى يتم إلغاء الرموز",

  /*
   ##################################################################################
   #                                                                                #
   # contract page                                                                  #
   #                                                                                #
   ##################################################################################
   */

  "Code": "الكود",
  "contract_overview": "نظرة عامة على العقد",
  "trx_value": "ترون قيمة",
  "token_tracker": "الرمز",
  "contract_creator": "مبتكر العقد",
  "at_txn": "للتداول",
  "token_txns": "تداول الرموز",
  "Events": "الأحداث",
  "TxHash": "TxHash",
  "Internal_Txns": "عقد التداول الداخلي",
  "ParentTxHash": "ParentTxHash",
  "TxFee": "رسوم",
  "contract_code_verified": "التحقق من رمز المصدر التعاقدي ’المطابقة التامة‘ ",
  "Contract_Source_Code": "مصدر العقد",
  "Contract_ABI": "ABI عقد",
  "Byte_code": "Byte code",
  "Constructor_Arguments": "ABI-Encoded لحجة المنشئ وهو يعد آخر وحدات بايت من كود إنشاء العقد أعلاه ",
  "Library_Used": "المكتبة المستخدمة",
  "Copy": "نسخ",
  "TxHash_Block_Age": "TxHash | Block | Age",
  "Method": "أسلوب",
  "Event_Logs": "سجلات الأحداث",
  "With_Verified_Source_Codes_Only": "فقط قم بتضمين العقود مع شفرة المصدر التي تم التحقق منها",
  "verified_contract_source_codes_found": "تم التحقق من العقد",
  "contract_source_codes_found": "تم العثور على العقد",
  "ContractName": "إسم العقد",
  "TxCount": "عدد المعاملات",
  "Settings": "الإعدادات",
  "DateVerified": "تاريخ التحقق",
  "Compiler": "مترجم",
  "Compiler_Text": "إصدار مترجم",
  "Contract_Internal_Transactions": "عقد المعاملات الداخلية",
  "Internal_Transactions_found": "عقد التداول من الداخل",
  "Misc": "متنوع",
  "Optimization_Enabled": "التحسين ممكن",
  "Normal_Transactions": "الصفقة العادية",
  "Verified_contracts": "تم التحقق من العقد",
  "Constructor_Arguments_tip": "وسيط منشئ",

  /*
  ##################################################################################
  #                                                                                #
  # new variables    2018-09-11 12:51:31                                           #
  #                                                                                #
  ##################################################################################
  */
  "pice_per_1trx": "السعر",
  "tron_power_freezing": "يمكن الحصول على طاقة ترون بتجميد ترون واحد  ، ويمكن الحصول على طاقة ترون واحدة لكل ترون مجمدة",
  "HighChart_tip": "انقر واسحب في منطقة الرسم للتكبير",
  "general_information": "معلومات عامة",
  "blockchain_information": "معلومات البلوكشين",
  "sr_information": "معلومات الممثل الممتاز",
  "currency_information": "توزيع المعلومات",
  "your_vote": "عدد الاصوات",
  "total_number_frozenTRX": "إجمالي عدد ترون المجمدة",
  "tronics_support_planTRX": "Tronics عملة ترون المجمدة بواسطة خطة دعم من",
  "frozen_by_the_foundationTRX": "عدد ترون المجمدة من قبل المؤسسة",
  "tronics_support_plan": "Tronics خطة دعم",
  "tronics_support_plan_recipient_address": "Tronics عنوان مستلم خطة دعم",
  "update_token": "تحديث الرمز المميز",
  "total_frozen": "احتياطي المؤسسة",
  "account_create_contract": "حساب انشاء العقد",
  "account_create": "انشاء حساب",
  "create_from_address": "إطلاق عنوان العقد",
  "create_to_address": "عنوان الحساب الذي تم إنشاؤه",
  "proposal_create_contract": "إنشاء عقد مقترح",
  "proposal_create": "إنشاء اقتراح",
  "available_balance": "الرصيد المتاح",
  "block_not_found": " عذرا ، لا يمكن العثور على الكتلة",
  "transaction_not_found": "عذرا ، لا يمكن العثور على معاملة التداول",
  "search_not_found": "عذرًا ، لم يتم العثور على موضوع البحث الذي أدخلته",
  /*
   ##################################################################################
   #                                                                                #
   # verify-contract-code                                          #
   #                                                                                #
   ##################################################################################
   */
  "contract_source_code": "مصدر العقد",
  "bytecode_and_ABI": "ByteCode و ABI",
  "verify_and_publish_your_solidity_source_code": "تحقق من نشر كود مصدر الخاص بك",
  "step": "خطوة",
  "step_1": "أدخل مصدر العقد الخاص بك أدناه",
  "step_2": "إذا كان رمز بايت الذي تم إنشاؤه يتطابق مع رمز بايت في العنوان الذي تم إنشاؤه ، فسيتم التحقق من العقد",
  "step_3": "يتم نشر كود مصدر العقد على الانترنت ويمكن التحقق منه بشكل علني من قبل أي شخص",
  "contract_notes": "ملاحظات",
  "contract_notes_1": "ABI للتحقق من صحة العقد الذي يقبل وسيطة منشئ ، يرجى إدخال وسيطة الدالة المشفرة في المربع أدناه وهو",
  "contract_notes_2_1": "لأغراض التصحيح إذا كان ترجمة بشكل صحيح في",
  "contract_notes_2_2": " استوديو ترون",
  "contract_notes_2_3": "فيجب أن يتم تجميعها بشكل صحيح هنا",
  "contract_notes_3": `نحن لا ندعم التحقق من العقود التي تستخدم "الواردات" حتى الآن`,
  "contract_notes_4": "نحن لا ندعم التحقق من العقود التي تم إنشاؤها بواسطة عقد آخر",
  "contract_notes_5": "يتم تجميع كل عقد بوقت انتظار يصل إلى 45 ثانية ، وإذا استغرق عقدك مدة أطول ، فلن نتمكن من التحقق من ذلك",
  "contract_notes_6": "سوف تنعكس المزيد من الميزات في الإصدار التالي",
  "contract_optimization": "الأمثل",
  "enter_contract_code": "solidity يرجى إدخال رمز عقد",
  "following_optional_parameters": "فيما يلي المعلمات الاختيارية",
  "constructor_arguments_ABIencoded": "ABI-encoded للعقود التي تقبل وسيط منشئ‘ منشئ معاملات’",
  "contract_library_address": "’عنوان مكتبة العقود ’بالنسبة للعقود التي تستخدم المكتبات ، فإنه يدعم ما يصل إلى 5 مكتبات :",
  "library_1_name": "مكتبة _ 1 اسم",
  "library_2_name": "مكتبة _ 2 اسم",
  "library_3_name": "مكتبة _ 3 اسم",
  "library_4_name": "مكتبة _ 4 اسم",
  "library_5_name": "مكتبة _ 5 اسم",
  "library_contract_address": "عنوان عقد المكتبة",
  "verify_and_publish": "تحقق ونشر",
  "txn": "txn",
  "contract_name_tip": "يجب أن يطابق اسم العقد في شفرة المصدر ، إذا كان عقدًا متعدد الأجزاء فيجب أن يتطابق مع اسم العقد الذي نشرته",
  "constructor_arguments_ABIencoded_tip": "لا ينطبق هذا الخيار إلا على العقود التي تحتوي على وسيطات منشئ ، وإذا لم تكن متأكدًا مما إذا كنت تملكها فلا تحتاج إلى ملىء ذلك",
  "library_1_name_tip": "لا ينطبق هذا الخيار إلا على العقود التي تستخدم المكتبة",
  "library_contract_address_tip": "عنوان مكتبة العقد المقابلة",
  "contract_source_code_for": "رمز مصدر العقد لـ",
  "has_already_been_verified": "تم بالفعل التحقق منها",
  "click_here_to_view": "اضغط هنا للعرض",
  "contract_was_creating_during": "تم إنشاء العقد خلال",
  "constructor_arguements": " (ABI-encoded) منشئات المقارنة المستخدمة ",
  "ContractBytecode": "bytecode عقد",
  "ContractABI": "ABI عقد",
  "start_over": "إعادة التحقق",
  "sorry_unable_contract_address": "عذرا! غير قادر على تحديد موقع رمز العقد في",
  "this_a_valid_contract_address": "هذا عنوان العقد الصحيح؟",
  "successfully_generated_byteCode": "ByteCode و ABI لعنوان العقد: قد تم بنجاح إنشاء",
  "error_construct_ABI_encoded": "منشئ الوسائط المفقودة / المكتبة تستخدم للوظيفة",
  "error_construct_bytecode_for": "عذرا! هنالك خطأ في بناء عقد بايت كود لذلك",
  "the_contract_creation_code_for": "لا تتطابق مع رمز إنشاء العقد لـ ",
  "error_contract_ABI_for": "ABI عذرا! لقد تم جمع العقد",
  "unableto_verify_contract_source_code": "غير قادر على التحقق من شفرة مصدر عقد",
  "contractname_found": "contractname تم العثور على",
  /*
   ##################################################################################
   #                                                                                #
   # contract-type                                          #
   #                                                                                #
   ##################################################################################
  */
  "trigger_smart_contract": "دعوة العقد الذكية",
  "normal_address_trigger_smart_contract": "عقد الاتصال بالعنوان العادي",
  "approve_trigger_smart_contract": "Deposit authorization",
  "approve_normal_trigger_smart_contract": "Token transfer between the main chain and the sidechain are allowed",
  "pledge_trigger_smart_contract": "Token deposit",
  "pledge_normal_trigger_smart_contract": "Transfer from main chain to sidechain",
  "mapping_trigger_smart_contract": "Token mapping",
  "mapping_normal_trigger_smart_contract": "Main chain and sidechain mapping",
  "sign_trigger_smart_contract": "Token withdraw",
  "sign_normal_trigger_smart_contract": "Transfer from sidechain to main chain",
  "trigger": "دعوة العقد",
  "contract_triggers_total": "دعوة عقد ثانوي",
  "contract_triggers_owner": "المالك",
  "contract_triggers_owner_address": "عنوان المالك",
  "no_tnx": "لا توجد عملية تداول",
  "no_event": "لا يوجد حدث",
  "link_test_fauct": "إختبار تدفق الشبكة",
  "gain_bandwith": "تجميد ترون للحصول على عرض النطاق الترددي",
  "gain_energy": "تجميد ترون لكسب الطاقة",
  "energy": "الطاقة",
  "freeze_trx_gain_bandwith_energy": "في الوقت نفسه ، يمكنك أيضًا الحصول على النطاق الترددي أو الطاقة.",
  "freeze_type": "نوع التجميد",
  "success_unfrozen_trx": "تم إلغاء تجميد ترون بنجاح",
  "please_select_the_type_of_unfreeze": "يرجى تحديد نوع إلغاء التجميد",
  "unfreeze_bandwidth": "ترون إلغاء تجميد حساب النطاق الترددي للحصول على",
  "unfreeze_energy": "ترون إلغاء تجميد حساب الطاقة للحصول على",
  "hide_small_currency": "إخفاء الأرصدة الصغيرة",
  "tokens_less_than_10": "الرموز المميزة بكمية أقل من 10",
  "only_TRX_transfers": "هنالك فقط ترون للتحويل",
  "no_transfers_found": "لم يتم العثور على عمليات التحويل",
  "current_MaxTPS": "Current / Max TPS",

  /*
   ##################################################################################
   #                                                                                #
   # exchange                                         #
   #                                                                                #
   ##################################################################################
  */

  "apply_for_the_currency": "التقدم بطلب للحصول على العملة",
  "apply_for_process": "التقدم بطلب للحصول على عملية العملة",
  "apply_content": "إذا كنت ترغب في إضافة عملات ، يرجى ملىء نموذج الطلب لتقديم معلومات حول العملة ، وبعد تقديم المعلومات سنقوم بمراجعة البيانات في أقرب وقت ممكن ، يرجى الانتظار بصبر قبل الرد على نتائج التدقيق",
  "operate_txn_pair_message": "يرجى إدخال عدد صحيح",
  "withdraw_all": "لايمكن الجرد بالكامل",
  "creat_valid": "لا يمكن أن يتجاوز رصيد الحساب",
  "my_trading_pairs": "أزواج التداول الخاصة بي",
  "create_trading_pairs": "إنشاء أزواج التداول",
  "pairs": "أزواج تداول",
  "no_pairs": "لا يوجد أزواج تداول",
  "capital_injection": "حقن رأس المال",
  "capital_withdrawal": "سحب رأس المال",
  "pair_has_been_created": "تم إنشاء زوج تداول",
  "successfully_created_pair": "نجحت في إنشاء زوج تداول",
  "pair_creation_failed": "فشل في إنشاء زوج التداول",
  "successful_injection": "إدخال ناجح",
  "sorry_injection_failed": "عذرا ، فشل التمويل",
  "successful_withdrawal": "تم السحب بناجح",
  "sorry_withdrawal_failed": "عذرا ، فشل السحب",
  "select_the_name_of_the_Token": "يرجى تحديد اسم الرمز المميز",
  "enter_the_amount": "أدخل الكمية",
  "choose_a_Token_for_capital_injection": "اختر الرمز المميز لحقن رأس المال:",
  "choose_a_Token_for_capital_withdrawal": "اختر رمزًا مميزًا لسحب رأس المال:",
  "injection_amount": "مقدار الحقن:",
  "withdrawal_amount": "مقدار مبلغ السحب:",
  "marks": "السوق",
  "last_price": "أحدث الأسعار",
  "pairs_change": "زيادة",
  "H": "مرتفع",
  "L": "منخفض",
  "O": "فتح",
  "C": "قبول",
  "24H_VOL": "24H VOL",
  "token_application_instructions_title": "قائمة الرمز",
  "token_application_instructions_1": "للتقديم على دي اي اكس ، تحتاج إلى ملىء النموذج ، وسوف يعرض الرمز الذي اجتاز المراجعة قائمة دي اي اكس ، ولا يمكن تداول الرمز غير المصرح به إلا بعد البحث",
  "click_here_to_apply": "انقر هنا للتقديم",
  "TxTime": "وقت التداول",
  "TxAmount": "رصيد التداول",
  "TxRecord": "سجل التداول",
  "TxBuy": "شراء",
  "TxSell": "بيع",
  "my_transaction": "تداولاتي",
  "enter_the_trading_amount": "يرجى إدخال عدد المعاملات",
  "TxAvailable": "متاح",
  "BUY": "شراء",
  "SELL": "بيع",
  "estimated_cost": "التكلفة التقديرية",
  "estimated_revenue": "الدخل المقدر",
  "slightly_cost": "زيادة بسيطة في التكلفة المقدرة ، وسيكون معدل الدوران أعلى",
  "slightly_revenue": "خفض الأرباح المقدّرة قليلاً ، وسيكون معدل الدوران أعلى",
  "participation_message_2": "tronscan لم يتم تمكين وقت الإصدار ، مما يعني أنه لا يمكن للمستخدمين المشاركة في الرمز المميز على",
  "created_token_time": "وقت الانشاء",
  "overview_TRC20": "TRC20 نظرة عامة على",
  "overview_TRC10": "TRC10 نظرة عامة على",
  "pice_per_onetrx": "سعر ترون",
  "total_tokens": "مجموع الرموز",
  "application_entry": "إدخال التطبيق",
  /*
   ##################################################################################
   #                                                                                #
   # commottee                                         #
   #                                                                                #
   ##################################################################################
  */
  "committee": "لجنة ترون ",
  "committee_dec_1": "تستخدم اللجنة لتعديل المعلمات الديناميكية لشبكة ترون ، مثل مكافآت توليد الكتلة ، ورسوم المعاملات ، إلخ",
  "committee_dec_2": "تتكون اللجنة من الممثلين الـ {total} الحاليين",
  "committee_dec_3": "كل ممثل ممتاز لديه الحق في الاقتراح والتصويت",
  "committee_dec_4": "عندما يحصل الاقتراح على {total} صوتًا أو أكثر من الممثلين الممتازين ضمن الإطار الزمني الصالح ، سيتم الموافقة على الاقتراح وسيتم تعديل مواصفات الشبكة في فترة الصيانة التالية",
  "get_committee_proposal": "تحقق من اقتراحات اللجنة",
  "TRON_network_parameters": "مواصفات شبكة ترون",
  "commission_proposed": "مقترحات اللجنة",
  "TRONSR": "TRON SR",
  "learn_more": "المزيد",
  "propose_number": "الرقم التسلسلي",
  "propose_parameters": "المواصفات",
  "propose_current_value": "القيمة الحالية",
  "propose_hour": "ساعة",
  "propose_1": "اقتراح لتعديل الفاصل الزمني لصيانة الممثل الممتاز",
  "propose_2": "اقتراح لتعديل تكلفة التقدم بطلب للحصول على حساب الممثل الممتاز",
  "propose_3": "اقتراح لتعديل رسوم إنشاء الحساب",
  "propose_4": "اقتراح لتعديل كمية عملة ترون المستخدمة للحصول على عرض نطاق ترددي إضافي",
  "propose_5": "اقتراح لتعديل رسوم إصدار الأصول",
  "propose_6": "اقتراح لتعديل مكافأة كتل الممثل الممتاز",
  "propose_7": "اقتراح تعديل المكافآت الممنوحة لأفضل 27 ممثل ممتاز والمرشحين الـ 100 التاليين",
  "propose_8": "اقتراح لتعديل تكلفة إنشاء الحساب",
  "propose_9": "اقتراح لتعديل استهلاك النطاق الترددي",
  "propose_10": "اقتراح لتفعيل الجهاز الظاهري",
  "propose_11": "GR Genesis اقتراح لإزالة الأصوات",
  "propose_12": "اقتراح لتعديل رسوم بمقدار واحد للطاقة",
  "propose_13": "اقتراح لتعديل تكلفة تداول الأزواج",
  "propose_14": "اقتراح لتعديل وقت التنفيذ الأقصى لمعاملة واحدة",
  "propose_15": "اقتراح للسماح لتغيير اسم الحساب",
  "propose_16": "اقتراح للسماح لنفس اسم الرمز المميز",
  "propose_17": "اقتراح للسماح بتفويض الموارد",
  "propose_18": "اقتراح لتعديل الحد الكلي للطاقة",
  "propose_18_1": "اقتراح لتعديل الحد الكلي للطاقة",
  "propose_19": "TRC-10 اقتراح السماح في العقود الذكية بنقل ",
  "propose_20": "الحد الحالي للطاقة ",
  "propose_21": "اقتراح للسماح بتمكين وظيفة التوقيع المتعدد",
  "propose_22": "مقترح للسماح بضبط الطاقة التكييفية بشكل كلي",
  "propose_23": "الحد الأعلى لاستخدام الطاقة المستهدفة",
  "propose_24": "الحد الأعلى لمتوسط الطاقة",
  "propose_25": "رسوم ضبط تحديث إمتيازات الحساب",
  "propose_26": "يوصى بتعديل تكلفة التوقيعات المتعددة",
  "propose_27": "Propose to enable protocol optimization",
  "propose_28": "Propose to support the new features of TRON Virtual Machine 0.5.4",
  "propose_minute": "دقيقة",
  "propose_unactivate": "غير مفتوح",
  "propose_not_allowed": "غير مسموح",
  "propose_allowed": " مسموح",
  "propose_activate": "فتح",
  "propose_finished": "تم الانتهاء",
  "proposal_content_info": "محتوى مقترح",
  "proposer": "تقديم الإقتراح",
  "proposal_time_of_creation": "(UTC) وقت الإنشاء ",
  "proposal_time_of_expire": "(UTC) وقت انتهاء الصلاحية ",
  "proposal_status": "حالة الاقتراح",
  "proposal_to": "من اجل ",
  "no_commission_proposed_found": "لا توجد لجنة مقترحة",
  "proposal_effective": "فعال",
  "proposal_voting": "تصويت",
  "proposal_ineffective": "غير فعال",
  "proposal_cancelled": "تم الإلغاء",
  "proposal": "اقتراح",
  "approvers_of_the_proposal": "الموافقون على اقتراح",
  "total_approving_votes": "مجموع الأصوات المعتمدة",
  "to_provide_a_better_experience": "لتوفير تجربة أفضل ، يتم تحديث هذه الإحصائية في كل دقيقة",
  "TRC10_token": "TRC10 الرمز",
  "TRC20_token": "TRC20 الرمز",
  "TRC20_decimals": "الدقه",
  "nav_more": "المزيد",
  "no_holders_found": "لم يتم العثور على رمز مميز",
  "search_TRC20": "عنوان البحث",
  "beginners_guide": "دليل",
  "Submit_a_bug": "الإبلاغ عن مشكلة",
  "TRONdice": "!ترون عقد عملة النرد والحصول على أرباح",
  "Join_TRONdice": "!TRONdice انضم إلى",
  "search_TRC20_error": "يرجى إدخال العنوان الصحيح",
  "dex_announcement": "إشعار:",
  "regulations_on_trading_pairs": "لوائح بشأن أزواج التداول",
  "How_to_trade_on_DEX": "DEX كيفية التداول على",
  /*
   ##################################################################################
   #                                                                                #
   # about 关于我们                                         #
   #                                                                                #
   ##################################################################################
  */
  "about_us": "من نحن",
  "what_we_do": "ماذا نفعل؟",
  "Transcan_desc": "ترون سكان هو أول متصفح كتلة مبني على أساس ترون فهو لا يشمل فقط بعض الوظائف الأساسية لمتصفح الكتلة يشمل مثل معاملات البحث ، والحسابات ، والكتل ، والعقد ، والعقود الذكية ، وإحصائيات البيانات والاستعلامات على السلسلة ، ويدعم أيضًا بشكل مباشر إنشاء الرمز المميز وفي الوقت نفسه ، تمتلك ترون سكان أيضًا محفظة ويب مدمجة و دي اي اكس مبني على بانكور ، مما يثري مصفوفة تطبيق ترون سكان",
  "Our_team": "مساهم المجتمع",
  "Team_desc": "فريقنا هو مؤسسة الرعاية للبلوكشين في مالطا وقد شارك بنشاط في البناء الإيكولوجي لترون ، ويتكون الفريق من أكثر من 30 شخصًا في جميع أنحاء العالم ، معظمهم من المطورين والمشغلين ، في المستقبل ، سنلتزم بالتطوير البيئي لشركة ترون لمدة طويلة ، ولتحقيق التطور الأمثل في ترون سكان ، سنقوم أيضًا بتطوير داب القائم على ترون",
  "User_many": "مستخدمي ترون سكان في جميع أنحاء العالم",
  "User_many_desc": "كل يوم ، يستخدم مؤيدو ترون من جميع أنحاء العالم متصفح البلوكشين ترون سكان ، حيث يمكنهم التحقق من تفاصيل المعاملة وتجربة أحدث ميزات ترون.",
  "HarryXu": "توفير العديد من الدعم الفني للواجهه الأمامية",
  "Skye": "اجمع تعليقات المجتمع وساعد في حلها",
  "Ariml": "تقديم المزيد من الأفكار لتصميم الصفحة",
  "Lee": "القيام بالكثير من أعمال الترجمة للنسخة اليابانية",
  "YanZheng": "تقديم الدعم الفني الخلفي",
  "Zach": "توفير العديد من الخلفيات الفنية مع اختبار الدعم",
  "Adolph": "tronscan التحقيق في أحدث التطورات في صناعة بلوكشين ، مما يجعل الكثير من المساهمات في تصميم وتطوير مواقع",
  "Vincent Lau": "توفير العديد من الدعم التقني للبلوكشين",
  /*
  ##################################################################################
  #                                                                                #
  # new variables    2018-12-06                                    #
  #                                                                                #
  ##################################################################################
  */
  "newly_issued_token_by_tronscan": "ستتم إضافة الرموز المزيفة إلى القائمة السوداء ولن يتم عرضها",
  "Favorites": "المفضلة",
  "dex_search_dec": "أدخل اختصار الرمز المميز",
  "TRC20_exchange_online": "TRC20 exchange غير متواجد حالياً ",
  "Trade_on_TRXMarket": "TRXMarket تداول على",
  "issued_token_of_tronscan": "tronscan سيتم عرض الرمز المميز الصادر فقط كنظرة عامة على الرمز تي ار سي 10 بعد اجتياز عملية التدقيق",


  /*
   ##################################################################################
   #                                                                                #
   # notice  2018-12-10                                     #
   #                                                                                #
   ##################################################################################
  */
  "OthersArticle": "مقالات في هذه المجموعة",
  "donateAddress": "التبرع",
  /*
   ##################################################################################
   #                                                                                #
   # trc20  2018-12-18                                     #
   #                                                                                #
   ##################################################################################
  */
  "trc20_nav_state": "تم تسجيل الدخول",
  "trc20_nav_dex": "DEX",
  "trc20_nav_trc10": "TRC10 تبادل",
  "trc20_nav_trc20": "TRC20 تبادل",
  "trc20_nav_tokenList": "قائمة الرمز",
  "trc20_nav_aboutUs": "من نحن",
  "trc20_footer_explain": "معدل قياسي",
  "trc20_footer_qa": "سؤال وجواب",
  "trc20_footer_standard_1": "رسوم خدمة سوق ترون كالتالي:",
  "trc20_footer_standard_2": "• إعادة الشحن: لا حاجة لإعادة الشحن",
  "trc20_footer_standard_3": "• السحب: لا يوجد سحب",
  "trc20_footer_standard_4": "• المعاملة: رسوم التداول 0.1٪",
  "trc20_footer_standard_5": "ملاحظة: هنالك الحق في تفسير معيار الرسوم مملوك لشركة سوق ترون ، وتحتفظ سوق ترون بالحق في تعديل السعر.",
  'trc20_apply_for_the_currency': "التقدم بطلب للحصول على العملة",
  "trc20_apply_for_process": "التقدم بطلب للحصول على عملية العملة",
  "trc20_apply_content": "إذا كنت ترغب في إضافة عملات ، يرجى ملىء نموذج الطلب لتقديم معلومات حول العملة ، وبعد تقديم المعلومات سنراجع البيانات في أقرب وقت ممكن ، ويرجى الانتظار بصبر قبل الرد على نتائج التدقيق.",
  "trc20_operate_txn_pair_message": "يرجى إدخال عدد صحيح",
  "trc20_withdraw_all": "لا يسمح بعملية الجرد بالكامل",
  "trc20_creat_valid": "لا يمكن أن يتجاوز رصيد الحساب",
  "trc20_my_trading_pairs": "أزواج التداول الخاصة بي",
  "trc20_create_trading_pairs": "إنشاء أزواج التداول",
  "trc20_pairs": "أزواج التداول",
  "trc20_no_pairs": "لا يوجد أزواج تداول",
  "trc20_capital_injection": "حقن رأس المال",
  "trc20_capital_withdrawal": "سحب رأس المال",
  "trc20_pair_has_been_created": "تم إنشاء زوج التداول",
  "trc20_successfully_created_pair": "نجحت في إنشاء زوج التداول",
  "trc20_pair_creation_failed": "فشل إنشاء زوج التداول",
  "trc20_successful_injection": "تم حقن رأس المال بنجاح",
  "trc20_sorry_injection_failed": "عذرا ، فشل في عملية الحقن",
  "trc20_successful_withdrawal": "تمت عملية السحب بنجاح",
  "trc20_sorry_withdrawal_failed": "عذرا ، لا يمكن اجراء عملية السحب",
  "trc20_select_the_name_of_the_Token": "يرجى تحديد اسم الرمز المميز",
  "trc20_enter_the_amount": "أدخل كمية المبلغ",
  "trc20_choose_a_Token_for_capital_injection": "اختر الرمز المميز لحقن رأس المال:",
  "trc20_choose_a_Token_for_capital_withdrawal": "اختر الرمز المميز لسحب رأس المال:",
  "trc20_injection_amount": "مقدار حقن رأس المال:",
  "trc20_withdrawal_amount": "كمية السحب",
  "trc20_marks": "السوق",
  "trc20_guide": "دليل المستخدم",
  "trc20_last_price": "قائمة الاسعار",
  "trc20_pairs_change": "تغيير",
  "trc20_H": "مرتفع",
  "trc20_L": "منخفض",
  "trc20_O": "فتح",
  "trc20_C": "قبول",
  "trc20_24H_VOL": "24h VOL",
  "trc20_24H_Total": "24h Total",
  "trc20_price": "السعر",
  "trc20_amount": "الكمية",
  "trc20_enter_the_trading_amount": "يرجى إدخال عدد المعاملات",
  "trc20_enter_10": "الإجمالي ≥ 10 ترون",
  "trc20_enter_1": "Total ≥ 1 USDT",
  "trc20_enter_the_trading_price": "يرجى إدخال سعر عملية التداول",
  "trc20_TxAvailable": "متاح",
  "trc20_BUY": "شراء",
  "trc20_SELL": "بيع",
  "trc20_token_application_instructions_title": "تعليمات تطبيق الرمز المميز",
  "trc20_token_application_instructions_1": "للحصول على تجربة أفضل للمستخدم ، يرجى ملىء الطلب بمعلومات مفصلة حول الرمز الذي ترغب في إصداره ، وسنقوم باستكمال مراجعة البيانات خلال 3 إلى 5 أيام عمل ، وسيتم إخفاء الرموز المميزة الغير مراجعة.",
  "trc20_click_here_to_apply": "انقر هنا للتقديم",
  "trc20_TxTime": "وقت التداول",
  "trc20_TxAmount": "رصيد التداول",
  "trc20_TxRecord": "سجل التداول",
  "trc20_CurOrder": "الطلبات الحالية",
  "trc20_TxBuy": "شراء",
  "trc20_TxSell": "بيع",
  "trc20_my_transaction": "معاملاتي",
  "trc20_estimated_cost": "التكلفة التقديرية",
  "trc20_estimated_revenue": "الدخل المقدر",
  "trc20_slightly_cost": "زيادة طفيفة في التكلفة المقدرة لزيادة احتمال الإغلاق",
  "trc20_slightly_revenue": "انخفاض طفيف في الدخل المقدر يمكن أن يزيد من احتمال الإغلاق.",
  "trc20_accumulative": "التراكمي",
  "trc20_buy": "شراء",
  "trc20_sell": "بيع",
  "trc20_balance_tip": "الرصيد لا يكفي",
  "trc20_available_balance": "الرصيد المتاح",
  "trc20_volume": "رصيد التداول",
  "trc20_cancel_order_confirm": "هل أنت متأكد من أنك تريد إلغاء هذا الطلب؟",
  "trc20_cancel": "إالغاء",
  "trc20_confirm": "تأكيد",
  "trc20_prompt": "تحذير",
  "trc20_cancel_order_fail": "فشل إلغاء الطلب",
  "trc20_order_success": "تم التقديم",
  "trc20_order_fail": "فشل الإرسال",
  "trc20_downLoad_wallet1": "يرجى التحميل",
  "trc20_downLoad_wallet2": "ابدأ التداول",
  "trc20_login_wallet": "الرجاء تسجيل الدخول إلى الحساب للخطوة التالية",
  "trc20_cur_order_header_order_time": "الوقت",
  "trc20_cur_order_header_order_type": "النوع",
  "trc20_cur_order_header_price": "السعر",
  "trc20_cur_order_header_amount": "الكمية",
  "trc20_cur_order_header_volume": "قيمة التداول",
  "trc20_cur_order_header_progress": "نسبة التقدم",
  "trc20_cur_order_header_action": "التشغيل",
  "trc20_cur_order_cancel": "إالغاء",
  "trc20_trans_record_header_block": "الكتل",
  "trc20_trans_record_header_buyAdr": "عنوان المشتري",
  "trc20_trans_record_header_sellAdr": "عنوان البائع",
  "trc20_trans_record_header_amount": "الكمية",
  "trc20_trans_record_header_time": "الوقت",
  "trc20_trans_record_header_price": "السعر",
  "trc20_my_trans_header_time": "الوقت",
  "trc20_my_trans_header_type": "النوع",
  "trc20_my_trans_header_pair": 'أزواج التداول',
  "trc20_my_trans_header_price": "السعر",
  "trc20_my_trans_header_amount": "الكمية",
  "trc20_my_trans_header_volume": "قيمة التداول",
  "trc20_my_trans_header_status": "الحالة",
  "trc20_my_trans_header_detail": "التفاصيل",
  "trc20_my_trans_finish": "تمت عملية التداول",
  "trc20_my_trans_part": "تداول جزئي",
  "trc20_my_trans_cancle": "إلغاء المعاملات",
  "trc20_my_trans_check": "تحقق",
  "trc20_no_data": "لا توجد بيانات حتى الآن",
  "trc20_token_info_Token_Info": "مقدمة",
  "trc20_token_info_Total_Name": "الإسم",
  "trc20_token_info_Token_Symbol": "الاختصار",
  "trc20_token_info_Total_Supply": "إمدادات",
  "trc20_token_info_Circulating_Supply": "السيولة",
  "trc20_token_info_Contract_Address": "عنوان العقد",
  "trc20_token_info_Website": "الموقع الرسمي",
  "trc20_token_info_ths_1": "زوج التداول",
  "trc20_token_info_ths_2": "أحدث الأسعار",
  "trc20_token_info_ths_3": "التغيير خلال 24 ساعة",
  "trc20_token_info_ths_4": "أعلى سعر خلال 24 ساعة ",
  "trc20_token_info_ths_5": "أقل سعر خلال 24 ساعة ",
  "trc20_token_info_ths_6": "حجم التداول خلال 24 ساعة",
  "trc20_token_info_ths_7": "حجم التداول خلال 24 ساعة",
  "trc20_new_price": "أحدث الأسعار",
  "trc20_exchange_status": "حالة التداول",
  "trc20_examine": "تمت المراجعه",
  "trc20_unexamine": "لم تتم المراجعه",
  "trc20_id": "ID",
  "trc20_first_token": "الاسم",
  "trc20_balance": "الرصيد",
  "trc20_second_token": "الاسم",
  "trc20_kchart": "K Line",
  "trc20_depth": "DEPTH",
  "trc20_trade_win_content": "Current network is unstable , please check later",
  "trc20_trade_win_confirm": "Confirm",
  "trc20_hot": "شعبي",
  "trc20_top_Volume": "قائمة التداول",
  "trc20_top_Rising": "قائمة ارتفاع",
  "trc20_history": "صفقات السوق",
  "trc20_register": "سجل الطلبيات",
  "trc20_24h_h": "24h متوسط",
  "trc20_24h_l": "24h منخفض",
  "trc20_fire_token": "50 lucky draws to win 100,000 VENA!",
  "trc20_vena_tip": "Due to the particularity of VENA contract, extra 0.1 VENA will be authorized but not deducted.",
  "trc20_status_-1":'جاري تأكيد الطلب',
  "trc20_status_0":'في انتظار المعاملة',
  "trc20_status_1":'في انتظار المعاملة',
  "trc20_status_2":'تم الانتهاء',
  "trc20_status_3":'',
  "trc20_status_4":'',
  "trc20_status_5":'تم الانتهاء',
  "trc20_status_6":"جاري الإلغاء",
  "trc20_status_7":"تم الالغاء",
  "trc20_status_8":"فشل الإرسال",
  "trc20_status_9":"",
  "trc20_status_100":"إلغاء جزئي",
  "trc20_failed_order": "لم يتم تأكيد الطلب من قبل البلوكشين",
  "trc20_ignore": 'تجاهل',
  "trc20_see_currentParis": 'فقط يمكنك الإتطلاع على أزواج التداول الحالية',



  /*
   *  2018-12-18
   * */
  "create_deal_pair": "إنشاء معاملة",
  "add_deal_pair_desc": "يتوفر الان زوج التداول",
  "click_create": "انقر هنا لإنشاء",
  "deal_pair_tip": "يجب على الأقل يوجد 100،000 ترون في رصيدك",
  "create_deal_pair_input_tip": "يجب أن يكون وعاء ترون أكبر من 100000",
  "create_deal_pair_input_tip2": "بعد إنشاء زوج المعاملة بنجاح ، لا يمكن تغيير سعر الإصدار عبر شبكة الإنترنت ، وسيتم خصم 1024 ترون لكل عملية إنشاء.",
  "publish_price": "سعر الإصدار الخاص بك هو",
  "pool_revert": "لا يمكن أن يكون رصيد ترون أقل من 100000",
  "sign_in_with_TRONlink": "TRONLINK تسجيل الدخول الى",
  "import_a_wallet": "تسجيل الدخول لحساب الواردات",
  "sign_in_TRONlink_warning": "الرجاء تثبيت محفظة ترون لينك وتحديث الصفحة والمحاولة مرة أخرى",
  "sign_in_TRONlink": "TRONlink تسجيل الدخول إلى",
  "uninstall_TRONlink": "لم تقم بتثبيت محفظة ترون لينك حتى الآن؟ انقر هنا",
  "change_login_method": "TRONlink الرجاء تحديث الصفحة وتثبيت",
  "Create_token_link_message_0": "تمت مراجعة الرمز المميز بواسطة ترون سكان وتمت المراجعة بنجاح في قائمة الرموز المميزة.",
  "sign_in_TRONlink_warning_0": "!TRONlink يرجى تسجيل الدخول إلى محفظة ",
  "account_ad": "تعد TRONdice لعبة مع عملات النرد ، وتحصل عملات النرد المرهونة على أرباح من ترون كل يوم",
  "bandwidth_tip": "في ترون ، سيتم استهلاك عرض النطاق الترددي مع أي معاملة ولكن سيتم تقديم 5000 عرض من النطاق الترددي لكل حساب نشط كل يوم من قبل النظام ، ويمكن للمستخدمين كسب عرض النطاق الترددي عن طريق تجميد ترون.",
  "energy_tip": "على ترون إنشاء وإطلاق العقود الذكية تستهلك الطاقة ، لذلك يمكن للمستخدمين الحصول على الطاقة من خلال تجميد ترون.",
  "power_tip": "يتم استخدام طاقة ترون للتصويت لصالح الممثل الممتاز ويمكن للمستخدمين الحصول على طاقة ترون من خلال تجميد ترون",
  "token_precision": "الرمز الدقيق",
  "token_precision_message_0": "قم بتعيين دقة الرمز المميز كما هو مطلوب ، والنطاق هو 0-6",
  "check_my_token": "تحقق من الرمز الخاص بك",
  "totle_transactions_per_day": "مجموع المعاملات",
  "tron_total_transactions_chart": "إجمالي معاملات الرسم البياني لترون",
  "sign_in_with_ledger": "LEDGER تسجيل الدخول الى",
  "can_be_unlocked_now": "يمكن فتح الرمز",
  "TRC20_under_maintenance": "TRC20 تحت الصيانة",
  "transaction_fewer_than_100000": "1. عندما تكون بيانات المعاملة ≤ 100000 ، يتم عرض جميع البيانات.",
  "transaction_more_than_100000": "2. عند تداول البيانات التي تكون > 100،000 يتم عرض آخر سبعة أيام من البيانات",
  "the_token_wait_few_minutes": "سيظهر الرمز المميز الذي تم إنشاؤه حديثًا في صفحة المحفظة في بضع دقائق.",
  "not_login": "لم تقم بتسجيل الدخول",
  "Audit_failed": "فشل التدقيق",
  "Auditing": "قيد المراجعة",
  "Passed_audit": "تمت الموافقه على المراجعة",
  "Have_questions": "هل لديك أسئلة حول حالة الرمز المميز؟",
  "Please_contact_us": "يرجى التواصل معنا",
  "ok_confirm": "تأكيد",
  "high_risk": "عالية المخاطر",
  "contract_method": "طريقة العقد",
  "contract_parameters": "موصفات الطريقة",
  "energy_fee": " TRXاستهلاك طاقة",
  "energy_usage": "استخدام الطاقة من الطاقة المجمدة للمستخدم",
  "energy_usage_total": "مجموع الطاقة المستهلكة",
  "origin_energy_usage": "استخدام الطاقة من العقد المقدمة",
  "net_fee": "حرق عدد ترون للحصول على عرض النطاق الترددي",
  "net_usage": "استخدام النطاق الترددي من عرض النطاق الترددي المجمدة للمستخدم",
  "TRC20_transfers": "TRC20 تحويلات",
  "Basic_info": "معلومات أساسية",
  "Internal_txns": "المعاملة الداخلية",
  "Fee_Consumption": "تكلفة الاستهلاك",
  "Method_calling": "طريقة الاتصال",
  "SELF_DESTRUCT Contract": "عقد التدمير الذاتي",
  "CONTRACT_CREATION": "إنشاء العقد",
  "open_ledger": "فتح Ledger",
  "price_per_1000_btt": "BTT سعر عملة بيت تورينت لكل 1000",
  "BTT_distribution_overview": "BTT نظرة عامة على توزيع ",
  "total_BTT_supply": "BTT مجموع سيولة",
  "BTT_supply": "BTT سيولة",
  "BTT_Token_Release_Schedule": "BTT رمز فتح قفل",
  "source_btt_team": "BTT المصدر: فريق إدارة ",
  "contract_total": "المجموع الحالي للعقد التي تم العثور عليها هو",
  "total_energy_used_chart": " الرسم البياني اليومي لاستهلاك الطاقة",
  "total_used_energy": " إجمالي الطاقة المستخدمة",
  "energy_used_by_freezing_TRX": " TRX الطاقة المستخدمة عن طريق تجميد ",
  "energy_used_by_burning_TRX": " TRX الطاقة تستخرج عن طريق حرق ",
  "total_energy_used": " إجمالي استهلاك الطاقة ",
  "freezing_energy": " trx تجميد الطاقة من ",
  "burning_energy": " TRX الطاقة المحروقة من ",
  "energy_scale": " نسبة استهلاك الطاقة ",
  "range": " النطاق ",
  "call": " استدعاء ",
  "caller": " المستدعي ",
  "call_time": " عدد مرات الاستدعاء ",
  "call_scale": " نسبة عدد مرات الاستدعاء ",
  "call_address_time": " عدد عناوين الاستدعاء ",
  "call_address_scale": " كمية نسبة الاستدعاء إلى عنوان ",
  "contract_call_chart": " جدول عقد ترون لحالة دعوة العقد ",
  "call_address_number": " عدد العناوين ",
  "contract_call_per_day": " دعوة العقد في اليوم الواحد ",
  "contract_call_chart_day": ' الرسم البياني اليومي لدعوة العقد ',
  "Tron_energy_chart": " الرسم البياني اليومي في ترون لكمية استهلاك الطاقة ",
  "tron_contract_call_chart": " دعوة العقد اليومية في ترون باستخدام الرسم البياني ",
  "day_contract_energy_distribution": " توزيع استهلاك الطاقة اليومي للعقد ",
  "day_contract_call_distribution": " توزيع دعوات العقود اليومية ",
  "a_total": "المجموع",
  "with_the_proportion_of": " مع نسبة",
  "uesd_by_the": " المستخدمة من قبل",
  "contracts_from_the_total_used_of": " مجموع العقود المستخدمة من",
  "Contract_times_calls": " عدد الدعوات للعقد (مرتبة حسب قيمة أوقات العقد بترتيب تنازلي)",
  "EnergyConsume_title": "تاريخ استخدام الطاقة اليومي من ترون",
  "EnergyConsume_subtitle": "انقر واسحب في المنطقة ومن ثم قم بالتأشير للتكبير",
  "EnergyConsume_yaxis": "الطاقة",
  "20_transfers": "TRC-20 transfers",
  "internal_transactions": "المعاملات الداخلية",

  /*
      ##################################################################################
      #                                                                                #
      # new variables    2019-03-04                                    #
      #                                                                                #
      ##################################################################################
  */
  "table_info_big1": " بيانات فقط",
  "table_info_big2": "عرض أول ",
  "table_info_big_tip1": "تم اختيار ما مجموعه",
  "table_info_big_tip2": "من البيانات خلال الوقت المحدد ، ",
  "table_info_big_tip3": "ولم يتم عرض سوى 10000",
  "table_info_big_tip4": " وإذا كنت تريد الاستعلام عن بيانات أخرى ، فمن المستحسن ضبط نطاق الوقت.",
  "table_info_account_tip1": "تمتلك السلسلة الرئيسية لشركة ترون ما مجموعه ",
  "table_info_account_tip2": " حساب ، وتعرض حاليًا أعلى 10000 حساب (وهذا وفقًا لرصيد TRX من الكبير إلى الصغير)",
  "table_info_holders_tip1": "هناك عناوين",
  "table_info_holders_tip2": " في المسار الحالي ، ويتم حاليًا عرض أول 10000 فقط (الترتيب من الكبير إلى الصغير وفقًا لعدد مرات المرور)",
  "Singapore": "Singapore",
  "table_info_new_tip": "حاليا يتم عرض أول 10000 من البيانات فقط ، وإذا كنت تريد الاستعلام عن بيانات أخرى ، فمن المستحسن ضبط نطاق الوقت.",
  "select_start_time": "يرجى تحديد وقت البدء",
  "select_end_time": "يرجى اختيار وقت الانتهاء",
  "binance": "binance",
  "social_link": "رابط وسائل التواصل الاجتماعي",
  "TRON_ecosystem": "بيئة ترون",
  "accunt_ad_tip": "TRXMarket LaunchBase عرض مشروع ACE تسجيل الدخول متاح الى",
  "token_fliter": 'مرشح الرمز',
  "gain": "التغيير (٪)",
  "volume_24_trx": '(24H) حجم',
  'all': 'الكل',
  "market_capitalization_trx": "القيمة السوقية (TRX)",
  "token_txs_info": "Token",
  "result": "النتيجة",


  /*
     ##################################################################################
     #                                                                                #
     # new variables    ledger 2019-04-24                                    #
     #                                                                                #
     ##################################################################################
  */
  "ledger_user_guide": "دليل المستخدم لليدجر",
  "latest_version_chrome": "ننصحك باستخدام أحدث نسخة من الكروم",
  "ledger_support_version": "نسخة ليدجر المدعومة: 0.1.1 ، دعم كروم لنسخة الإصدار 73.0",
  "ledger_you_can": "يمكنك الذهاب ",
  "ledger_website": "يقوم موقع Ledger",
  "ledger_website_download": "قم بتنزيل وتحديث نسخة دفتر الأستاذ",
  "ledger_click_help": "انقر هنا للحصول على مزيد من المساعدة",

  /*
      ##################################################################################
      #                                                                                #
      # new variables    address 2019-05-13                                    #
      #                                                                                #
      ##################################################################################
  */

  "address_balance_token_type": "فئة التوكن",
  "address_balance_token_price_TRX": "قيمة",
  "address_transactions_tip": "عدد المعاملات يشمل عدد التحويلات",
  "address_tron_power_tip": "قم بتجميد TRX للحصول على حقوق التصويت",
  "address_total_balance_tip": "يتضمن الرصيد الكلي كل قيمة للتكون",
  "address_tron_power_used": "تم استخدامه",
  "address_tron_power_remaining": "الفائض",
  "address_total_balance_info_sources": "مصادر المعلومات",
  "address_info_transfers": "تحويل",
  "address_info_transactions": "التداول",
  "address_netLimit": "إجمالي النطاق الترددي",
  "address_netRemaining": "النطاق الترددي المتاح",
  "address_netUsed": "عرض النطاق الترددي مستخدم",
  "address_energyLimit": "مجموع الطاقة",
  "address_energyRemaining": "الطاقة المتاحة",
  "address_energyUsed": "الطاقة المستخدمة",
  "address_percentage": "النسبة",
  "address_net_fee": "تكلفة النطاق الترددي",
  "address_energy_fee": "تكلفة الطاقة",
  "address_transfer_all": "الكل",
  "address_transfer_in": "الدخل",
  "address_transfer_out": "الانفاق",
  "address_transfer_unrecorded_token": "Unrecorded Token",


  /*
    ##################################################################################
    #                                                                                #
    # footer  2019-05-20                                    #
    #                                                                                #
    ##################################################################################
*/

  "footer_fellow_us": "Follow Us",
  "footer_developer_resources": "Developer Resources",
  "footer_support_center": "Support Center",
  "footer_tron_network": "TRON",
  "login_privatekey_warn": "للحفاظ على أمان حسابك يرجى الاحتفاظ بمفتاحك الخاص في حالة فقد الأصول الخاصة بك ، ويوصى باستخدام ",
  "login_privatekey_warn_safe": "  لتسجيل الدخول الآمن.",
  "updata_token_info": "تحديث بيانات الرموز",
  "input_transcan": "أدخل TRONSCAN",
  "pass_time": "بحلول الوقت",
  "black_time": "حجب الوقت",
  "appeal_time": "وقت الاستئناف",
  "check_token_detail": "عرض تفاصيل الرموز",
  "check_market_detail": "عرض تفاصيل السوق",
  "check_abcc_detail": "عرض تفاصيل abcc",
  "check_cmc_detail": "عرض تفاصيل CMC",
  "type_black": "تم الحجب",
  "type_pass": "تمت الموافقة",
  "type_appeal": "معالجة الاستئناف",
  "Appeal": "استئناف",
  "input_market": "أدخل تبادل TRXMARKET",
  "input_abcc": "أدخل تبادل abcc (فقط املأ 12 من المعلومات الإضافية)",
  "input_cmc": "أدخل CMC (فقط املأ 10 معلومات إضافية)",
  "holder_amount": "كمية الحاملين",
  "day_trade": "حجم التداول اليومي",
  "total_value": "إجمالي القيمة السوقية",
  "black_reason": "سبب الحظر",
  "appeal_reason": "سبب الاستئناف",
  "handle_time": "متوسط ​​وقت المعالجة: 48 ساعة",
  "i_know_black": "لقد تعاملت مع وضع الحظر ، تقديم طلب استرداد",
  "appeal_format": "يجب ملىء أسباب الاستئناف",
  "token_input": "إدخال الرمز",
  "input": "إدخال",
  "select_type": "يرجى اختيار نوع الرمز",
  "select_trx_tip1": "يوصى بإصدار 20 رمز",
  "select_trx_tip2": "اضغط هنا",
  "select_trx_tip3": "تعرف على المزيد حول الفرق بين الرمز TRC20 و TRC10",
  "select_tip1": "لا يتطلب رمز TRC10 عقودًا ذكية ، يستهلك 1024 TRX",
  "select_tip2": "يتم إصدار الرمز TRC20 بموجب عقد ذكي ولا يستهلك TRX",
  "name_v_required": "يجب ملىء اسم الرمز",
  "name_v_format": "يجب أن يتكون اسم الرمز من حروف وأرقام ومسافات",
  "name_v_length": "اسم الرمز يصل إلى 30 حرفًا",
  "abbr_v_required": "يجب ملىء الرمز المختصر",
  "abbr_v_format": "يجب أن يتكون الاسم المختصر للرمز من حروف وأرقام",
  "abbr_v_length": "إختصار الرمز الحد الأقصى له هو 10 أحرف",
  "token_description": "مقدمة حول الرمز",
  "description_v_required": "يجب أن تملأ مقدمة الرمز",
  "description_v_length": "مقدمة عامة حول الرمز بحد أقصاه 500 حرف",
  "supply_v_required": "يجب أن تملأ الكمية الاجمالية للإصدار ",
  "logo_v_required": "يجب وضع الشعار",
  "logo_v_format": "شكل الشعار لا يلبي المتطلبات",
  "contract_info": "معلومات العقد",
  "contract_address_placeholder": "إنشاء عنوان العقد للرمز",
  "contract_address_required": "يجب ملىء عنوان العقد",
  "contract_address_format": "مؤلف من حروف وأرقام ؛ يبدأ بحرف T",
  "contract_created_date": "تاريخ إنشاء العقد",
  "contract_code": "كود العقد",
  "contract_code_placeholder": "إنشاء كود العقد للرمز",
  "social_info": "المعلومات الاجتماعية",
  "email": "صندوق البريد",
  "email_v_required": "يجب كتابة البريد الإلكتروني",
  "email_v_format": "لا يتوافق صندوق البريد مع المتطلبات",
  "email_placeholder": "التواصل عبر البريد الإلكتروني",
  "whitepaper_address": "عنوان الورقة البيضاء",
  "price_info": "معلومات الأسعار",
  "select_socoal_link": "حدد رابط إضافة وسائل التواصل الاجتماعي",
  "so_add": "متابعة الإضافة",
  "socoal_v_format": "يمكن إضافة ما يصل إلى 20 من روابط وسائل الاعلام",
  "trc20_token_return": "العودة",
  "token_input_success": "تم إدخال الرمز بنجاح",
  "token_input_failure": "فشل إدخال الرمز",
  "token_update_success": "Token updated successfully",
  "token_update_failure": "fail to update Token",
  "token_input_failure_reason": "سبب الفشل",
  "token_input_failure_no_submit": "لم ترفع بعد السبب",
  "token_input_failure_submit": "التقديم مرة أخرى",
  "leave_tip": "لديك حاليًا نموذج غير مسجل ، هل تريد التخلي عن الإدخال؟",
  "already_add_social_link_": "إضافة رابط وسائل التواصل الاجتماعي",
  "token_input_success_you_can": "يمكنك العثور عليه في",
  "token_input_success_wallet": "المحفظة",
  "token_input_success_myaccount": "رمز (رموز) صادرة عني",
  "token_input_success_find_it": " ",
  "token_input_success_trx_market": "قم بإضافة 10 أُخرى من البيانات لضم  trx.market",
  "token_input_success_tip": "يمكن العثور على إدخال الرموز الناجحة في قائمة المحفظة وسيتم تضمين tronlink تلقائيًا ويمكن البحث فيه",
  "token_logo_input_placeholder": "يرجى تقديم رابط الصورة ، مدعوم من jpg / jpeg / png ، بنسبة حجم 1: 1",
  "project_website": "الموقع الرسمي للمشروع",
  "token_input_trc10_tip": "يرجى إدخال الشعار و GitHub وروابط الوسائط الاجتماعية عند تحديث الرمز",
  "token_input_trc20_tip": "يرجى إدخال الشعار عند تحديث الكود",
  "token_spend_confirm_new": "لقد إطلعت على أنه لإصدار رمز مميز يتطلب دفع رسوم لمرة واحدة ما مقدارة 1024 TRX",
  "token_create_auther_different": "حساب تسجيل الدخول غير متوافق مع الناشر ولا يمكن تحديثه",
  "contract_created_address": "عنوان منشئ العقد",
  "ico_infomation": "معلومات ICO",
  "black_1": "يشتبه في اختلاس أسماء رمزية أخرى",
  "black_2": "قد ارتكبت عملية احتيال والهروب مع الصندوق",
  "black_3": "يشتبه في انتهاك ومخالفة القانون ويمكن أن تواجه تطبيق القانون الرئيسي",
  "black_4": "التقدم في المشروع يتعارض بشدة مع الخطة",
  "black_5": "زيادة حالة الضرر في الإصدار",
  "black_6": "تم رفض المشروع ؛ لقد مر المجتمع ووسائل الإعلام الاجتماعية والموقع الرسمي بأكثر من 30 يومًا دون صيانة",
  "black_7": "الفريق يتخذ بصورة طوعيه المشروع بسبب التقدم الحالي وتعديل الاستراتيجية",
  "black_8": "الورقة البيضاء تحتوي على معلومات وبيانات كاذبة ويشتبه في الانتحال",
  "black_9": "يقوم المشروع بإجراء تغييرات غير مصرح بها على الورقة البيضاء أو غيرها من المعلومات الرئيسية ويؤدي إلى عواقب وخيمة",
  "black_10": "تستمر العقود الذكية في مخاطر أمنية وقد تؤدي بالفعل إلى خسارة مالية للمستخدمين",
  "black_11": "تحتوي الأسماء أو الاختصارات الرمزية على كلمات حساسة xxxxx، في انتظار المراجعة.",
  "str_1": "تحتوي الأسماء أو الاختصارات الرمزية على كلمات حساسة.",
  "str_2": "أسماء الرموز أو الاختصارات مختلفة عن تلك الموجودة في العقد.",
  "str_3": "حجم إجمالي الإصدار يختلف عن إجمالي العرض في العقد.",
  "str_4": "فشل ، رمز العقد يحتوي على تأكيد",
  "str_5": "لا تتوافق دقة الرمز مع التي توجد في العقد",
  "str_6": "غير قادر على التحقق من التوقيع",
  "str_7": "انتهت صلاحية البيانات",
  "str_8": "تم إدخال العقد",
  "str_9": "غير قادر على التحقق من المعلمات",
  "type": "نوع",
  "token_login_no_updated": "حساب تسجيل الدخول غير متوافق مع الناشر ولا يمكن تحديثه",
  "information_is_being_confirmed": "Information is being confirmed, this process may take 10 minutes, please try again later",
  "my_account": "حسابي",
  "delegate_other": "تجميد بواسطة الآخرين",
  "freeze_self": "تجميد نفسي",
  "total_amount": "المبلغ الإجمالي",
  "receive_address": "تلقي عنوان (العنوان الافتراضي هو الخاص بك)",
  "unfreeze_time": "  وقت الغاء التجميد ",
  "interTrx_tip": "المعاملات الداخلية هي عملية يطلق عليها عنوان عام العقد الذكي transfers وينقل العقد الذكي الرمز المميز إلى عنوان آخر.",
  "event_tip": "الأحداث هي السماح للمبرمج أو موفر الواجهة الخارجية باستخدامه للانتباه إلى عمليات التعاقد والتدقيق.",
  "Expected_acquisition": "الربح المقدر",
  "energy_more": "عرض النطاق الترددي الذي تم الحصول عليه = TRX المجمدة لكسب عرض النطاق الترددي / إجمالي TRX المجمدة في الشبكة للحصول على عرض النطاق الترددي",
  "bandwidth_more": "الطاقة التي تم الحصول عليها = TRX امجمدة للحصول على الطاقة / إجمالي TRX المجمدة للحصول على الطاقة في الشبكة بالكامل * الحد الإجمالي للطاقة.",
  "table_info_big": "عرض أول 10000 بيانات فقط",
  "Download": "تحميل",
  "trc20_free_orders": "0 trading fee for all orders",

  /*
  ##################################################################################
  #                                                                                #
  # contract Compiler                                      #
  #                                                                                #
  ##################################################################################
 */
  "please_enter_address": 'الرجاء إدخال عنوان العقد',
  "please_enter_name": 'الرجاء إدخال اسم العقد',
  "please_enter_code": 'الرجاء إدخال رمز العقد',
  /*
  ##################################################################################
  #                                                                                #
  # read contract info   2019-07-02                                    #
  #                                                                                #
  ##################################################################################
  */
  "contract_title": "العقد",
  "contract_code_choice": "الشفرة",
  "contract_read": "قراءة العقد",
  "contract_write": "اكتب العقد",
  "contract_tip": "المطلوب",
  "contract_version": "إصدار المترجم",
  "contract_optimize": "الأمثل",
  "contract_optimizer": "لا",
  "contract_optimizered": "نعم فعلا",
  "contract_verify_status": "لم يتم التحقق من العقد بعد ، انقر هنا",
  "contract_verify_btn": "للتحقق",
  "write_payable": "قم بتشغيل هذه الوظائف باستخدام TRX أو الرمز المميز",
  "write_nonePayable": "تشغيل هذه الوظائف سوف تستهلك TRX أو الطاقة",
  "verify_code1": "التحقق من العقود هو مطابقة لرمز العقد الذكي الذي تكتبه مع رمز العقد الذكي المنشور على شبكة البلوكشين للتحقق من صحة وشفافية العقد الذكي ، ويمكنك التحقق من عقدك الذكي على TRONSCAN عن طريق تحميل ملف العقد الذكي ومراجعته.",
  "verify_code2": " ",
  /*
   ##################################################################################
   #                                                                                #
   # deploy contract   2019-07-10                                    #
   #                                                                                #
   ##################################################################################
  */
  "select_contract_file":"تحميل ملف العقد",
  "selected_contract_file_left":" ",
  "selected_contract_file_right":"تم تحميل الملف (الملفات)",
  "selected_file_max_size": "Single file size must not exceed 5MB",
  "selected_file_max_num": "The number of selected files must not exceed 10",
  "contract_deployment":"نشر العقد",
  "contract_verification":"التحقق من العقد",
  "contract_deploy_info1":"نشر العقد يعني نشر رمز العقد الذكي الخاص بك على شبكة البلوكشين ، بذلك يمكنك ترجمة ونشر العقود الذكية على TRONSCAN عن طريق تحميل ملفات العقود الذكية ، ولاحظ أن نشر العقد يستهلك كمية معينة من TRX ، يرجى التأكد من أن رصيد حسابك يكفي لهذه العملية.",
  "contract_deploy_info2":" ",
  "contract_deployment_btn_compile":"المترجم",
  "contract_deployment_btn_deploy":"نشر",
  "contract_compile_params":"ترجمة Params",
  "compile_params_version":"إصدار صلب",
  "compile_params_optimization":"الأمثل",
  "compile_params_runs":"Runs",
  "compile_first":"يرجى أولا ترجمة العقد الخاص بك",
  "contract_deploy_params":"نشر Params",
  "contract_deploy_modal_info":"سوف يكلف نشر العقد كمية معينة من TRX أو الطاقة",
  "deploy_params_fee_limit":"حد الرسوم",
  "deploy_params_user_fee_percentage":"نسبة رسوم المستخدم",
  "deploy_params_energy_limit":"الحد من الطاقة الأصلية",
  "deploy_params_send_token":"حدد TRX أو الرمز المميز للإرسال",
  "deploy_params_constructor":"حجة المنشئ",
  "compile_close":"أغلق",
  "token_logo_upload_tip":"يدعم فقط التنسيقات الثلاثة png و jpg و jpeg ، ولا يجب أن يتجاوز الحجم 200 كيلو بايت ، والبيكسل يجب ان يكون بقياس 100 * 100",
  
  // Backbone - account - mapping
  "main_account_mapping_title":"الخريطة إلى DAppChain",
  "main_account_mapping_text":"DAppChain هي عبارة عن شبكة سلسلة جانبية تم تطويرها استنادًا إلى سلسلة ترون الرئيسية ، وهي حل للتحجيم لشبكة TRON MainNet.",
  "main_account_mapping_text_1":"1.مقدار أعلى من tps بالمقابل الحصول على استهلاك أقل للطاقة",
  "main_account_mapping_text_2":"2.Mapping operation consumes 1000TRX",
  "main_account_mapping_btn":"جاري التعيين",
  "main_account_mapping_success_btn":"تم استكمال التعيين",
  "main_account_mapping_desc1": "عند تعيين الرمز المميز على السلسلة الجانبية ، سيتم إنشاء رمز مميز يحمل نفس الاسم في السلسلة الجانبية",
  "main_account_mapping_desc2": "بعد اكتمال التعيين ، يمكن للمستخدمين إيداع الرمز المميز في السلسلة الجانبية.",
  
  // sidechain - contract - mapping
  "sidechain_contract_left":"التعيين من عقد MainNet",
  "sidechain_contract_right":" ",

  // Sidechain - account - pledge
  "sidechain_account_pledge_btn":"الوديعة",
  "sidechain_account_sign_btn":"السحب",
  "pledge_currency":"الرمز",
  "pledge_sidechain":"Sidechain",
  "pledge_num":"الكمية",
  'pledge_num_error':"لا يمكن أن يتجاوز العدد الحد الأقصى للرصيد المتاح",
  'pledge_num_min_error':"The quantity cannot be less than",
  "pledge_text":"سوف تستهلك الودائع كمية معينة من الطاقة",
  "sign_text":"Withdraw operation will consume",
  "pledge_mapping_text":"لم يتم تعيين الأصول الخاصة بك إلى DAppChain ، وبالتالي لا يمكن إيداعها.",
  "lack_of_balance":"TRX has insufficient balance",
  "mapping_text":"Mapping operations consume:",
  // success
  "pledge_success": "Deposit Success",
  "sign_success": "Withdraw Success",
  "mapping_success": "Mapping Success",
  // error
  "pledge_error": "Deposit Error",
  "sign_error": "Withdraw Error",
  "mapping_error": "Mapping Error",
  "price_per_1000_WIN": "PRICE PER 1000 WIN",
  "WIN_distribution_overview": "WIN DISTRIBUTION OVERVIEW",
  "total_WIN_supply": "Total WIN Supply",
  "WIN_supply": "WIN Supply",
  "WIN_Token_Release_Schedule": "WIN Token Release Schedule",
  "source_WIN_team": "Source: WIN Management Team",
  "Side_Chain":"DAppChain",
  "Main_Chain":"MainChain",


  "7day": "one week",
  "14day": "two weeks",
  "30day": "one month",
  "select_tip": "To view data other than 2000 You can manually adjust the time window",
  "date_number_tip": "{total} records in the current time range",
  "date_list_tip": "Only the first 2000 data are displayed",
  "sun_propose_1": "تبديل رسوم المعاملة: سيتم فرض رسوم المعاملة بشكل طبيعي عندما يتم تعيين الاقتراح على 1.",
  "sun_propose_2": "قم بتعيين عنوان العقد الخاص بالبوابة على السلسلة الجانبية",
  "sun_propose_3": "حدد وقت انتهاء الصلاحية للمقترح",
  "sun_propose_4": "بَدأ التصويت لصالح Witness",
  "sun_propose_5": "عنوان تجمع حوافز السلسلة الجانبية هو العنوان (0) افتراضيًا ",
  "sun_propose_6": "إدارة إذا كان مفتاح الحوافز لـ witness على السلسلة الجانبية هو فعال / مغلق",
  "sun_propose_7": "مقاييس التوزيع لمجموعة حوافز السلسلة الجانبية",
  "sun_propose_8": "نسبة إيرادات witness على السلسلة الجانبية",
  "day":"يوم",


  "developers_username": "username",
  "developers_current_year":"year's points",
  "developers_current_quarter": "quarter's points",
  "developers_current_month":"month's points",
  "developers_view_points":"View Points Details",
  "developers_points_details": "Points details",
  "developers_contribution_link":"Contribution content corresponding link",
  "developers_earn_points":"Earn points",
  "developers_search":" Search username",
  "developers_scored_users":"Scored Users",
  "DAppChain_holders":"DAppChain Holders",
  "notrx_noenergy":"Please make sure your TRX is not less than 10 and a certain amount of energy",
  "inactive_MainChain_account":"Submission Failed.This address has not been activated on TRON.Please activate first and try again",
  "mapping_warning":"This operation must be done by the token contract creator",
  "freeze_balance_limit":"عدم كفاية الرصيد ، يرجى إعادة الدخول",

  "total_tron_ecosystem_tokens":"Total TRON-ecosystem tokens:",
  "number_of_lists":"Number of lists:",
  "total_in_tronscan":"Total in tronscan:",
  "develpopers_reward_tip":"Thank you for considering to help out with the java-tron! TRON Foundation welcome contributions from anyone on the internet, and are grateful for your contributions.",

};