export const messages = {
/*
##################################################################################
#                                                                                #
#  $$$$$$$$\                                                                     #
#  \__$$  __|                                                                    #
#     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
#     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
#     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
#     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
#     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
#     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
#                                                                                #
##################################################################################
#                                                                                #
#         Template for translating the tronscan.org website                      #
#         Version: 1.6-13082018                                                  #
#         Update Date: 13.08.2018                                                #
#         Language: English                                                      #
#         Status: Approved Version                                               #
#         Number of checks: 4                                                    #
#         Participants: Rovak,PMD3VSolution,DrKaradenizli                        #
#                                                                                #
##################################################################################
#                                                                                #
# description and structure of the template                                      #
#                                                                                #
# "<name of the variable>": "<corresponding translation>"                        #
#                                                                                #
# Note: please concentrate only on the value <corresponding translation>         #
#                                                                                #
##################################################################################
#                                                                                #
# global section                                                                 #
#                                                                                #
##################################################################################
*/
    "ok": "OK",
    "app_title": "پروتکل ترون",
    "password": "پسوورد",
    "money_price": "قیمت",
    "price": "قیمت",
    "blocks": "بلوک ها",
    "block": "بلوک",
    "name": "نام",
    "website": "وبسایت",
    "address": "آدرس",
    "sign_out": "خروج",
    "sign_in": "ورود",
    "register_login": "ثبت نام / ورود",
    "register": "ثبت نام",
    "login": "ورود",
    "height": "ارتفاع",
    "age": "سن",
    "bytes": "بایت ها",
    "MByte": "مگا بایت",
    "produced_by": "تولید شده توسط",
    "block_reward": "پاداش",
    "contract": "قرارداد",
    "from": "از طرف",
    "to": "به",
    "value": "ارزش",
    "total_accounts": "مجموع حساب",
    "submit": "ارسال",
    "send": "ارسال",
    "receive": "دریافت",
    "supply": " عرضه تی آرایکس ",
    "view": "بازدید",
    "view_all": "مشاهده همه",
    "create": "ساختن",
    "country": "منطقه",
    "amount": "مقدار",
    "my_vote": "رای های من",
    "submit_votes": "ارسال رای",
    "accounts": "حساب ها",
    "created": "ایجاد شده",
    "exchange": "مبادله",
    "next": "بعدی",
    "copied_to_clipboard": "Copied to clipboard",
    "cancel": "لغو",
    "reset": "تنظیم مجدد",
    "error": "اخطار",
    "unlock_keyFile": "بازکردن فایل کلید",
    "enter_password_message": "شما باید پسوورد خود را وارد نمایید",
    "password_incorrect": "پسوورد صحیح نمیباشد",
    "try_again": "دوباره سعی کنید",
    "wallet_unlocked": "بازکردن کیف پول",
    "weak": "ضعیف",
    "okay": "okay",
    "good": "خوب",
    "strong": "قوی",
    "secure": "امن",
    "too_short": "بسیار کوتاه",
    "status": "وضعیت",
    "no_notifications": "هیچ اطلاعیه ای وجود ندارد",
    "enable_desktop_notifications": "فعال کردن نوتیفیکیشن های دسکتاپ",
    "desktop_notification_enabled": "فعال کردن نوتیفیکیشن های دسکتاپ",
    "notifications_enabled": "فعال کردن نوتیفیکیشن",
    "contract_type": "نوع قرارداد",
    "filters": "فیلترها",
    "send_tokens": "ارسال توکن",
    "desktop_explorer": "دسکتاب اکسپلورر",
    "message": "پیام",
    "wallet_address": "آدرس کیف پول",
    "confirm": "تایید",
    "_percentage": "درصد",
    "language_support": "در حال حاضر فقط انگلیسی پشتیبانی میشود",
    "note": "توجه",
/*
##################################################################################
#                                                                                #
# navigation section                                                             #
#                                                                                #
##################################################################################
*/
    "blockchain": "بلاکچین",
    "wallet": "کیف پول",
    "home": "صفحه اصلی",
    "transfers": "انتقال",
    "live": "زنده-آنلاین",
    "statistics": "آمار",
    "markets": "بازار",
    "tools": "ابزار",
    "transaction_viewer": "نمایشگر معاملات",
    "node_tester": "تستر نود",
    "system": "سیستم",
    "news": "اخبار",
    "help": "راهنمایی",
    "nodes": "نودها",
    "votes": "آرا",
    "account": "حساب کاربری",
    "tokens": "توکن ها",
    "overview": "بررسی",
    "participate": "مشارکت",
/*
##################################################################################
#                                                                                #
# home dashboard                                                                 #
#                                                                                #
##################################################################################
*/
    "tron_main_message": "عدم تمرکز وب",
    "transactions_last_hour": "معاملات در ساعت گذشته",
    "block_height": "ارتفاع بلوک",
    "online_nodes": "نودهای آنلاین",
    "pice_per_1000trx": " ( 1000TRXهر)قیمت ",
    "vote_for_super_representatives": "رای به سوپر نماینده ها",
    "view_super_representatives": "مشاهده سوپرنماینده ها",
    "create_new_wallet": "ساخت کیف پول جدید",
    "view_tokens": "مشاهده توکن ها",
    "transactions_last_day": "معاملات روز گذشته",
/*
##################################################################################
#                                                                                #
# tableinformations and statistics                                               #
#                                                                                #
##################################################################################
*/
    "first_page": "صفحه اول",
    "previous_page": "صفحه قبلی",
    "next_page": "صفحه بعد",
    "last_page": "صفحه قبل",
    "page": "صفحه",
    "of": "از",
    "page_size": "اندازه صفحه ",
    "most_nodes": "بیشترین گره ها",
    "loading_nodes": "بارگذاری گره",
    "Hostname": "نام  هاست ",
    "Last Update": "آخرین آپدیت",
    "first_node_sync_message": "در حال اولین همگام سازی گره، لطفا چند دقیقه دیگر دوباره امتحان کنید",
    "last_block": "آخرین بلوک",
    "blocks_produced": "محصولات بلوک ها",
    "blocks_missed": "بلوک های از دست رفته",
    "productivity": "بهره وری",
    "rewards": "پاداش",
    "token_created": "ایجاد توکن",
    "witness": "شاهد",
    "asset_participation": "مشارکت در دارایی",
    "loading_transaction": "بارگذاری تراکنش",
    "nodes_ranking": "رتبه بندی گره ها",
    "split_by_country": "رتبه براساس کشور و منطقه",
    "total_accounts_last_day": "جمع کل تا روز آخر",
    "chart_tip": "برای بزرگ یا کوچک شدن روی صفحه بکشید",
    "link_test_server": "Testnet",
    "highest": "بالاترین",
    "lowest": "کمترین",
    "increase": "افزایش",
    "number": "شماره",
    "_of": "از",
    "was_recorded_on": "ثبت شد",
    "rank_real_time": "رتبه (زمان واقعی)",
    "volume_24": "حجم معاملات ۲۴ ساعته",
    "billion_usd": "میلیارد دلار",
    "loading_transfers": "در حال انتقال",
    "loading_transactions": "بارگذاری معاملات",
    "loading_block": "بارگذاری بلوک",
    "current_power": "قدرت کنونی",
    "produce_distribution": "نمودار سازنده بلوک",
    "confirm_token_issue": "تایید توکن",
    "_to": "به",
/*
##################################################################################
#                                                                                #
# blockchain - statistics                                                        #
#                                                                                #
##################################################################################
*/
    "addresses": "آدرس",
    "trx_transferred_past_hour": " منتقل شده در ساعات گذشتهTRX",
    "transactions_past_hour": "معاملات انجام شده در ساعات گذشته",
    "average_blocksize": "میانگین حجم بلوک",
    "rich_list": "فهرست غنی",
    "tron_transaction_chart": "نمودار تراکنش ترون",
    "transactions_per_day": "معاملات در هر روز",
    "foundation": "آدرس موسس",
    "foundation_address": " فریزشده توسط بنیانگذار TRX مجموع ",
    "unfreeze_time": "زمان آزاد کردن",
    "addresses_number": "تعداد آدرس ها",
    "Confirmed": "تایید شده",
    "Unconfirmed": "تایید نشده",
/*
##################################################################################
#                                                                                #
# account section                                                                #
#                                                                                #
##################################################################################
*/
    "set_name": "تنظیم نام",
    "unique_account_message": "شما فقط می توانید نام حساب خود را یک بار تنظیم کنید",
    "name_to_short": "نام کوتاه است",
    "name_to_long": "نام طولانی است",
    "permitted_characters_message": " باشد a-z A-Z 0-9 نام تنها می تواند شامل ",
    "change_name": "تغییر نام",
    "account_name": "نام حساب",
    "show_qr_code": "  نمایش کیو آرکد  ",
    "do_not_send_2": "تی آر ایکس را از کیف پول خود و یا مبادله خود ارسال نکنید به آدرس حساب کاربری بالابرای تست شبکه",
    "bandwidth": "پهنای باند",
    "balance": "تعادل",
    "tron_power": "انرژی",
    "transactions": "معاملات",
    "no_transfers": "بدون نقل وانتقال",
    "no_tokens": "بدون موجودی توکن",
    "free_bandwidth": "پهنای باند رایگان",
    "expires": "منقضی",
    "have_been_added_to_your_account": "به حساب شما اضافه شده است",
    "information_message_1": "ماینت نمی تواند تی آر ایکس را درخواست کند، لطفا با ترون تماس بگیرید برا امتحان تی آر ایکس.",
    "information_message_2": "شما فقط می توانید تی آر ایکس را ۱۰ بار در هر حساب درخواست کنید.",
    "request_trx_for_testing": "درخواست تی آر ایکس برای آزمایش",
    "token_balances": "بالانس توکن ها",
    "produced_blocks": "تولید بلوک ",
    "voters": "آرا",
    "progress": "پیشرفت",
    "transactions_count": "{معاملات، جمع، یک {معامله} {دیگر معاملات}}",
    "issuer": "صادر کننده",
    "network": "شبکه",
    "current": "درحال حاضر",
    "trx_received": "دریافت کننده تی آر ایکس",
    "test_trx_temporarily_unavailable_message": "	تست تی آر ایکس به طور موقت در دسترس نیست. لطفا بعدا دوباره امتحان کنید.",
    "not_enough_trx": "تی آر ایکس کافی نیست",
    "information_message_3": "درخواست تی آر ایکس با موفقیت ارسال شد. اگر چیزی دریافت نکردید، در حال حاضر هیچ تست تی آر ایکس موجود نیست و بعدا باید دوباره امتحان کنید.",
    "send_to_following_address": "ارسال به آدرس زیر",
    "change_website": "تغییر وبسایت",
    "you_must_enter_url": "باید یک آدرس  وارد کنید",
    "specify_the_url": "لطفا آدرس مشخص کنید ",
/*
##################################################################################
#                                                                                #
# account freeze                                                                 #
#                                                                                #
##################################################################################
*/
    "freeze": "فریز کردن",
    "unfreeze": "آزاد کردن",
    "freeze_trx_least": "شما به حداقل یک تی آر ایکس برای فریز نیاز دارید",
    "unable_unfreeze_trx_message": "نمیتوانید تی آرایکس را آزاد کنید.ممکن است زمان فریز کامل نشده باشد ",
    "freeze_trx_premessage_0": `با فریز کردن تی آر ایکس انرژی به دست می آورید همچنین قابلیت های دیگر نیز فعال میشود . برای مثال با انرژی میتوانید `,
    "freeze_trx_premessage_link": "به سوپرنماینده ها رای بدهید",
    "freeze_trx_premessage_1": `نشانه های فریز شده به مدت یک دوره 3 روزه قفل می شوند. در این دوره تی آر ایکس فریز نمی تواند مورد استفاده قرار گیرد.عد از گذشت زمان فریز میتوانید تی آر ایکس خود را آزاد کنید و معامله کنید`,
    "freeze_trx_premessage_2": "هر یک از پهنای باند یا انرژی را می توان با فریز بدست آورد. شما نمیتوانید هر دو منابع را در همان زمان بدست آورید.هنگامی که یک کاربر یک منبع خاص را غیرفعال کند، رای قبلی خود به طور کامل لغو خواهد شد. اگر یک کاربر مایل به رای دادن با استفاده از انرژی ترون باقیمانده باشد، او مجبور خواهد بود تا عملیات رای گیری خود را دوباره انجام دهد.",
    "trx_amount": "مقدار تی آر ایکس",
    "token_freeze_confirm_message_0": "تایید فریز",
    "token_freeze_confirm_message_1": "به مدت حداقل سه روز",
    "frozen_supply": "تعداد فریزها",
    "tokens_unfrozen": "آزاد کردن توکن ها",
    "success_tokens_unfrozen_message": "توکن ها با موفقیت آزاد شد",
    "unable_to_unfreeze": "نمیتوانید آزاد کنید",
    "Unable_tokens_unfrozen_message": "نمیتوانید توکن را آزاد کنید",
    "tokens_frozen": "توکن ها فریز شدند",
    "successfully_frozen": "عملیات فریز با موفقیت انجام شد",
    "name_changed": "تغییر نام",
    "successfully_changed_name_to_message": "تغییر نام با موفقیت انجام شد",
    "unable_to_rename_title": "نمیتوانید تغییر دهید ",
    "unable_to_rename_message": "هنگام بروزرسانی نام حساب شما، خطا رخ داد، لطفا دوباره امتحان کنید",
    "unfreeze_trx_confirm_message": "آیا مطمئن هستید که می خواهید تی آر ایکس را آزاد کنید؟ ",
    "unfreeze_assets": "آزاد ساختن ",
    "sure_to_unfreeze_unlocked_tokens_message": "آیا مطمئن هستید که میخواهید توکن های فریز شده را آزاد کنید؟",
    "After": "بعدا",
/*
##################################################################################
#                                                                                #
# account superdelegates                                                         #
#                                                                                #
##################################################################################
*/
    "apply_for_delegate": "درخواست برای نمایندگی",
    "apply_super_representative_candidate": "درخواست برای نامزد سوپر نماینده",
    "your_personal_website_address": "آدرس وب سایت شخصی شما",
    "apply_for_delegate_predescription": "هر صاحب نشانه، فرصتی برای تبدیل شدن به یک نماینده برتر ترون است. با این وجود، برای شبکه و جامعه برای هماهنگی و موثرتربودن، ما مجموعه ای از استانداردها و مقررات را برای کاندید های واجد شرایط برای تبدیل شدن به نمایندگان توصیه شده آماده کرده ایم. SR ها شانس خود را انتخاب می کنند.سوپر نمایندگان جدید  توصیه شده به روز شده و یک بار در هفته ارسال می شوند. ",
    "apply_for_delegate_description": "همه صاحبان نشانه ها می توانند درخواست کاندیداتوری سوپر نماینده (SR) را با کلیک کردن بر روی صفحه حساب کاربری اعمال کنند؛ همچنین می توانند برای کاندیداها با کلیک کردن بر روی صفحه رایانه رای دهند. هر کاربر می تواند برای چندین نامزد رای دهد، برابر با مقدار تی آر ایکس که دارند. نتایج رای گیری بر اساس آخرین دور رای گیری توسط هر کاربر است. تعداد آرا هر روز در 02:00 (GMT + 8)، 08:00 (GMT + 8) 14:00 (GMT + 8)، 20:00 (GMT + 8) بروز میشود؛ کاربران همچنین می توانند شماره رأی گیری در زمان واقعی را مشاهده کنند. 27 نامزد اکثر رای داده شده به عنوان نماینده مجلس سنا انتخاب خواهند شد و مسئولیت بسته بندی معامله و بلوک تولید را با پاداش 32 تی آر ایکس در هر بلوك تولید خواهند كرد.، 27 SR و  100 نامزد SR برتر همچنین می توانند پاداش گره ها را بر اساس آراء دریافت کنند. یک بار هزینه معامله 9999 TRX برای درخواست برای تبدیل شدن به یک نامزد کسر می شود. برای هر کاربر هزینه ای برای رای دادن به نامزدهای SR وجود ندارد. ",
    "unknown_error": "یک خطای ناشناخته رخ داده است",
    "representative_understand": "من درک می کنم که چگونه یک نماینده  ترون باشم",
    "generate_account": "برای ایجاد آدرس حساب کاربری و رمز عبور خود کلیک کنید",
    "create_account_confirm_1": "من میدانم که اگر رمز عبور خود را فراموش کنم / از دست بدهم، هرگز نمی توانم به دارایی هایم دسترسی پیدا کنم",
    "create_account_confirm_2": "من میدانم که اگر رمز عبور خود را فراموش کرده و از دست بدهم، هیچ کس نمی تواند به من کمک کند تا آن را بازیابی کند",
    "create_account_confirm_3": "من رمز عبور خود را روی کاغذ نوشته ام",
    "vote_thanks": "با تشکر از رای شما",
    "recent_transactions": "معاملات اخیر",
    "newest_account": "جدیدترین حساب ها",
    "representatives": "نمایندگان",
    "representativesAcandidates": "سوپر نمایندگان و نامزدها",
    "most_votes": "بیشترین آرا",
    "start_end_time": "زمان شروع/پایان",
    "scan_qr_code": "اسکن کیو آر کد با اسکنر کیو آر",
    "receive_trx": "دریافت تی آر ایکس",
    "require_account_to_send": "برای ارسال سکه باید وارد سیستم شوید",
    "require_account_to_receive": "برای دریافت سکه باید وارد سیستم شوید",
    "successful_send": "با موفقیت ارسال شد",
    "confirm_transaction": "تایید معامله",
    "last_confirmed": "آخرین معامله",
    "trx_produced": "معاملات انجام شده",
    "do_not_send_1": "برای تست تی آر ایکس را از کیف پول یا صرافی به آدرس خود ارسال نکنید ",
    "go_to_votelist": "رفتن به لیست رای گیری",
    "understand_tron_sr_message_0": "من درک می کنم که چگونه یک نماینده TRON باشم و من تأیید می کنم که صرف کنم",
    "understand_tron_sr_message_1": "هزینه",
    "invalid_url": "آدرس معتبر نیست",
    "apply_representative_error_message_0": "در هنگام تلاش برای نماینده شدن  درخواستی را اشتباهی ارسال کردید.",
    "apply_representative_error_message_1": "اطمینان حاصل کنید که تی آر ایکس به اندازه کافی برای هزینه دارید یا بعدا دوباره امتحان کنید",
    "open_external_link": "شما در حال باز کردن یک لینک خارجی هستید",
    "private_key_untrusted_website_message_0": "هرگز کلید خصوصی خود را بر روی وب سایت های غیر قابل اطمینان وارد نکنید",
    "no_official_tron_website": "این سایت رسمی ترون نیست",
    "continue_to_external_website": "به سمت سایت خارجی",
    "url_changed": "آدرس تغییر کرده",
    "successfully_changed_website_message": "وب سایت به صورت موفقیت آمیز تغییر کرده است",
    "unable_to_change_website_title": "امکان تغییر نشانی اینترنتی وجود ندارد",
    "unable_to_change_website_message": "هنگام به روزرسانی وبسایت اشتباه کردید، لطفا بعدا دوباره امتحان کنید",
    "successfully_linked_github": "با موفقیت به گیتهاب پیوستید",
    "github_linked": "لینک گیتهاب",
    "unable_to_link_github_message": "نمیتوان به گیتهاب متصل شد، مطمئن شوید که نام کاربری شما درست است",
    "could_not_link_github": "نمیتوان به گیتهاب متصل شد",
    "enter_your_github_username": "نام کاربری گیتهاب خود را وارد کنید",
    "link_to_github": "لینک به گیتهاب",
    "link_github": "لینک گیتهاب",
    "you_must_enter_a_url": "شما باید لینک وارد کنید ",
    "success": "با موفقیت انجام شد",
    "successfully_appied_sr_canidate_message_0": " به عنوان کاندیدای سوپر نماینده با موفقیت انجام شد  .",
    "successfully_appied_sr_canidate_message_1": "حساب شما به زودی به روزرسانی خواهد شد",
    "landing_page": "صفحه فرود",
    "show_more_information_publish_sr_page": "نشان دادن اطلاعات بیشتر در مورد چگونگی انتشار یک صفحه",
    "create_sr_landing_page_message_0": "سوپرنمایندگان می توانند یک صفحه فرود ایجاد کنند که اطلاعات بیشتری در مورد تیم و برنامه هایشان به اشتراک بگذارند",
    "set_github_url_message_0": "آیا قبلا قالب گیتهاب خود را پیکربندی کردید؟ سپس با استفاده از دکمه زیر، لینک را تنظیم کنید",
    "set_github_link": "تنظیم لینک گیتهاب",
    "could_not_claim_rewards": "نمیتوان مطالبه پاداش کرد",
    "claim_rewards_error_message": "در هنگام تلاش برای مطالبه پاداش، چیزی اشتباه است، لطفا بعدا دوباره امتحان کنید.",
    "rewards_claimed": "درخواست ارسال شد",
    "successfully_claimed_rewards": "پاداش های موفقیت آمیز",
    "claim_rewards": "مطالبه پاداش",
    "sr_receive_reward_message_0": "به عنوان یک نماینده، پاداش برای تولید بلوک دریافت می کنید. این پاداش ها می تواند هر 24 ساعت مطالبه شود",
    "intro": "معرفی",
    "budget_expenses": "هزینه های بودجه ",
    "server_configuration": "پیکربندی سرور",
    "community_plan": "طرح جامعه ",
    "team": "تیم",
/*
##################################################################################
#                                                                                #
# token creation formular                                                        #
#                                                                                #
##################################################################################
*/
    "name_of_the_token": "نام توکن",
    "token_message": "نام توکن . دقت کنید تکراری نباشد ",
    "token_abbr": "مخفف نام توکن",
    "abbr_message": "مخفف نام توکن . دقت کنید تکراری نباشد",
    "total_supply": "مجموع موجودی",
    "issued_token": "توکن صادر شده",
    "create_token": "ساخت توکن",
    "description": "مقدمه کوتاه",
    "description_url": "توضیح درباره لینک",
    "quote_token_amount": "مقدار توکن",
    "base_token_amount": "موجودی پایه توکن",
    "creating_a_token": "ایجاد یک توکن",
    "available": "در دسترس",
    "testnet": "تست سریع شبکه",
    "days_to_freeze": "روزهای فریز شده",
    "trx_token_fee_message": " ۱۰۲۴تی آر ایکس برای صدور یک توکن جدید لازم است",
    "trx_token_account_limit": "شما می توانید تنها یک توکن را در هر حساب ایجاد کنید",
    "trx_token_wallet_requirement": "شما باید یک کیف پول داشته باشید تا بتوانید یک توکن ایجاد کنید",
    "invalid_address": "آدرس معتبر نیست",
    "insufficient_tokens": "توکن کافی نیست",
    "fill_a_valid_number": "لطفا یک شماره معتبر وارد کنید",
    "fill_a_valid_address": "لطفا یک آدرس معتبر وارد کنید",
    "make_another_transaction": "تراکنش دیگر انجام دهید",
    "token_exchange_confirm": "من تأیید کرده ام که {مقداری تی آر ایکس} را در توزیع نشانه ای صرف کنم و مجموع  { مقداری توکن} را دریافت کنم. ",
    "An_unknown_error_occurred,_please_try_again_in_a_few_minutes": "یک خطای ناشناخته رخ داده است، لطفا چند دقیقه دیگر دوباره امتحان کنید",
    "An_error_occurred": "خطایی رخ داده است",
    "create_a_token": "ایجاد یک توکن",
    "not_started_yet": "هنوز آغاز نشده است",
    "participated": "شما با موفقیت شرکت کردید",
    "participated_error": "یک خطا رخ داده است",
/*
##################################################################################
#                                                                                #
# token participate                                                              #
#                                                                                #
##################################################################################
*/
    "buy_confirm_message_0": "آیا مطمئن هستید؟",
    "how_much_buy_message": "چقدرتوکن شما تمایل دارید که خرید کنید؟",
    "buy_confirm_message_1": "از خرید خود مطمئن هستید",
    "for": "برای",
    "insufficient_trx": "تی آر ایکس کافی نیست",
    "not_enough_trx_message": "شما به اندازه کافی تی آر ایکس برای خرید بسیاری از توکن ها ندارید",
    "ends": "پایان",
    "starts": "شروع",
    "can_be_unlocked": "میتوانید باز کنید",
/*
##################################################################################
#                                                                                #
# global messages                                                                #
#                                                                                #
##################################################################################
*/
    "address_warning": "فقط آدرس کیف پول ترون را وارد کنید. آدرس های اشتباه ممکن است باعث از دست رفتن تی آر ایکس شود.",
    "search_address_or_url": "جستجو برای آدرس یا لینک",
    "the_lunch_test": "هدف ازراه اندازی شبکه تست این است که تمام ویژگی های بلاکچین مرورگر و کیف پول را آزمایش کند.",
    "please_keep_in_mind": "لطفا در نظر داشته باشید که از آنجا که آدرس حساب کاربری ثبت شده شما فقط برای تست نت استفاده می شود، تی آر ایکس را از کیف پول خودبه تست نت ارسال نکنید.",
    "tron_foundation": "بنیاد ترون ",
    "trx_for_testing": "تی آر ایکس برای تست، هنگامی که از طریق مدیریت حساب موفقیت آمیز اعمال می شود، به حساب تست خود ارسال می شود. ",
    "dear_users": "کاربر عزیز",
    "finished": "تمام شد",
    "token": "توکن",
    "url": "لینک ",
    "need_to_login": "برای دسترسی به صفحه حساب کاربری باید وارد سیستم شوید",
    "thanks_for_applying": "با تشکر برای درخواست!",
    "to_much_votes": "برای بسیاری از آرا",
    "no_trx_remaining": "هیچ تی آر ایکس باقی نمانده",
    "show_more": "نمایش بیشتر",
    "vote_guide_message": `استفاده از تی آر ایکس برای رای دادن به سوپر نماینده ها استفاده میشود .برای هر تی آر ایکس که در حسابتان نگهداری می کنید، یک رای میتوانید بدهید.تی آر ایکس خرج نخواهد شد. شما می توانید چندین بار به نماینده هایی که دوست دارید رای دهید . تعداد آرا روزانه طبق ساعات 02:00,08:00,14:00,20:00 (GMT + 8) به روز می شود و همچنین  لیست نمایندگان به روز می شود. `,
    "search_address": "جستجو برای آدرس",
    "token_transactions": "معاملات توکن",
    "token_holders": "دارندگان توکن",
    "nr_of_Transfers": "تعداد نقل و انتقالات",
    "not_signed_in": "برای استفاده از این قابلیت باید وارد سیستم شوید",
    "loading_map": "نقشه در حال بارگذاری میباشد",
    "loading_accounts": "در حال بارگذاری حساب",
    "quantity": "مقدار",
    "percentage": "درصد",
    "loading_token": "بارگذاری توکن",
    "voter_percentage": "درصد رای دهندگان",
    "total_balance": "مجموع تعادل",
/*
##################################################################################
#                                                                                #
# transaction information                                                        #
#                                                                                #
##################################################################################
*/
    "no_transactions_found": "هیچ معامله ای یافت نشد",
    "no_tokens_found": "هیچ توکنی یافت نشد",
    "no_blocks_found": "هیچ بلوکی یافت نشد",
    "no_votes_found": "هیچ رای پیدا نشد",
    "no_voters_found": "هیچ رای دهنده ای پیدا نشد ",
    "waiting_for_transactions": "در انتظار معامله",
    "loading_address": "بارگذاری آدرس",
/*
##################################################################################
#                                                                                #
# token creation - default messages                                              #
#                                                                                #
##################################################################################
*/
    "details": "جزئیات",
    "issue_a_token": "صدور توکن",
    "issue_token": "صدور توکن",
    "token_name": "نام توکن",
    "total_issued": "مجموع صادر شده",
    "registered": "ثبت نام",
    "abbreviation": "مخفف",
    "exchange_rate": "صدور نرخ ارز",
    "token_price": "قیمت توکن",
    "supply_message": "مجموع توکن صادر شده، به عنوان مثال، مجموع بیتکوین صادر شده 21 میلیون",
    "description_message": "شرح مختصری از هدف این توکن",
    "url_message": "یک آدرس وب سایت که اطلاعات بیشتری در مورد توکن نشان می دهد",
    "exchange_rate_message_0": "با تعیین قیمت توکن مشخص کنید که در ازای چه مقدار توکن میتوان یک تی آر ایکس بدست آورد. ",
    "exchange_rate_message_1": "شرکت کنندگان دریافت خواهند کرد",
    "exchange_rate_message_2": "برای هر",
    "exchange_rate_message_3": "TRX",
    "participation_message_0": "مشخص دوره مشارکت است که در آن نشانه های صادر خواهد شد. در طول دوره مشارکت کاربران می توانند تی آر ایکس را تبادل کنند",
    "participation_message_1": "توکن ها",
    "frozen_supply_message_0": "بخشی از عرضه می تواندفریز باشد. مقدار عرضه می تواند مشخص شود و باید حداقل 1 روز آن را منجمد کرد. عرضه یخ زده می تواند به صورت دستی پس از شروع آزاد شود. فریز کردن ضروری نیست .",
    "token_issued_successfully": "توکن با موفقیت صادر شد",
    "participation": "زمان صدور",
    "start_date": "تاریخ شروع",
    "end_date": "تاریخ پایان",
    "token_spend_confirm": "من تأیید می کنم که برای ایجاد کل هزینه های توکن یک بار کل هزینه۱۰۲۴ تی آرایکس است.",
    "token_issue_guide_message_1": "صدور مجوز پروتکل ترون می تواند توسط هر کسی که حداقل ۱۰۲۴ تی آر ایکس در حساب خود داشته باشد انجام شود.",
    "token_issue_guide_message_2": "هنگامی که یک توکن صادر می شود، در صفحه مرورگر نشانگر نشان داده می شود. پس از آن کاربران می توانند در زمان صدور شرکت کنند و تی آر ایکس را برای نشانه ها مبادله کنند.",
    "token_issue_guide_message_3": "بعد از صدور گواهینامه، حساب شما مقدار علامت هایی برابر با کل عرضه را دریافت می کند. هنگامی که دیگر کاربران تی آر ایکس را برای نشانه ها مبادله می کنند، پس از آن نشانه ها از حساب شما خارج خواهند شد و شما تی آر ایکس برابر با نرخ ارز مشخصی را دریافت خواهید کرد.",
/*
##################################################################################
#                                                                                #
# token creation - error messages                                                #
#                                                                                #
##################################################################################
*/
    "date_error": "تاریخ پایان زودتر یا همان تاریخ شروع است.",
    "no_name_error": "نام ضروری است",
    "no_supply_error": "مجموع عرضه شده باید حداقل 1 باشد",
    "coin_value_error": "مقدار توکن باید حداقل 1 باشد",
    "tron_value_error": "مقدار تی آر ایکس در هر سکه باید حداقل 1 باشد",
    "invalid_starttime_error": "تاریخ شروع ارائه شده معتبر نیست",
    "invalid_endtime_error": "تاریخ پایان ارائه شده نامعتبر است",
    "no_description_error": "شرح ضروری است",
    "no_url_error": "آدرس وب مورد نیاز است",
    "past_starttime_error": "تاریخ شروع  گذشته است",
    "no_transactions": "هیچ معاملات وجود ندارد",
    "errors_in_form": "اشتباهات در فرم وجود دارد",
    "token_link_message_0": "توکن در دسترس خواهد بود",
    "token_link_message_1": "صفحه توکن",
    "token_link_message_2": "چند دقیقه",
    "description_error_message_0": "توضیحات بیش از 200 کلمه  نباشد",
    "token_creation_error": "هنگام تلاش برای ایجاد توکن خطایی رخ داد",
    "tokenname_error_message_0": "نام بیش از 32 حرف نباشد",
    "tokenname_error_message_1": "  استفاده شود A تا Z نام فقط از حروف",
    "abbreviation_required": "مخفف مورد نیاز است",
    "abbreviation_error_message_0": "اختصار بیش از 5 کاراکتر نباشد",
    "abbreviation_error_message_1": "  استفاده شود A تا Z مخفف فقط از حروف",
/*
##################################################################################
#                                                                                #
# representatives section                                                        #
#                                                                                #
##################################################################################
*/
    "highest_productivity": "بالاترین بهره وری",
    "lowest_productivity": "کمترین بهره وری",
    "Super Representatives": "سوپر نمایندگان",
    "Super Representative Candidates": "نامزدهای سوپر نماینده",
    "loading_representatives": "در حال بارگذاری نمایندگان",
    "address_not_super_representative": "این آدرس یک سوپرنماینده نیست",
    "unable_load_representatives_page_message": "صفحه قابل بارگیری نیست،  اگر آدرس نامعتبر باشد، آدرس نماینده نباشد یا نماینده این صفحه را پیکربندی نکرده باشد ممکن است این اتفاق بیافتد ",
    "loading_representative": "در حال بارگذاری سوپر نماینده ",
/*
##################################################################################
#                                                                                #
# markets section                                                                #
#                                                                                #
##################################################################################
*/
    "average_price_usd": " میانگین قیمت با دلار ",
    "average_volume_usd": " میانگین حجم با دلار",
    "Trade Volume": "حجم معامله با دلار ",
    "rank": "رتبه",
    "pair": "جفت",
    "volume": "حجم",
    "usd": "USD",
    "average_price": "میانگین قیمت",
    "click_the_chart_title_to_find_more": "برای پیدا کردن اطلاعات بیشترروی عنوان نمودار کلیک کنید ",
/*
##################################################################################
#                                                                                #
# votes section                                                                  #
#                                                                                #
##################################################################################
*/
    "next_round": "دور بعدی",
    "total_votes": "مجموع آراء",
    "most_ranks": "بیشترین رتبه بدست آمده در این دور ",
    "view_live_ranking": "نمایش زنده رتبه بندی",
    "open_team_page": "باز کردن صفحه گروه",
    "warning_votes": "حداقل ۱ انرژی برای رای دهی مورد نیاز است . انرژی توسط فریز کردن تی آرایکس بدست می آید",
    "account_page": "صفحه کاربری",
    "loading_votes": "بارگذاری آرا",
    "3_day_ranking": "نتیجه رتبه بندی ۳ روز",
    "live_ranking": "رتبه بندی زنده",
    "live_ranking_msg": "هر ۱۵ ثانیه تجدید می شود. رأی های جدید ممکن است قبل از شمارش، ۱-۲ دقیقه طول بکشد",
    "candidate": "کاندید",
    "current_votes": "رای های جاری",
    "click_to_start_voting": "برای شروع رأی گیری اینجا کلیک کنید",
    "votes_remaining_message": "رأی باقیمانده ",
    "open_wallet_start_voting_message": " برای شروع رای گیری کیف پول را باز کنید",
    "thanks_submitting_vote_message": "از شما برای رای دادن سپاسگزارم",
    "need_min_trx_to_vote_message": "شما باید حداقل  ۱ تی آر ایکس داشته باشید تا بتوانید رای دهید",
    "to_much_votes_massage": "شما به تعداد زیادی رای داده اید",
    "all_votes_are_used_message": "همه آرا استفاده شد",
    "submissing_vote_message_title": "از شما برای رای دادن سپاسگزارم",
    "submissing_vote_message_0": "رأی شما با موفقیت ارسال می شود، زمانی که دوره رأی گیری بعدی شروع می شود اثر می گذارد.",
    "submissing_vote_message_1": "شما می توانید رای خود را در هر زمان که دوست دارید منتشر کنید",
    "submitting_vote_error_message": "هنگام رأی دادن شما اشتباهی رخ داد. لطفا بعدا دوباره امتحان کنید",
    "loading_super_representatives": "بارگذاری سوپر نماینده ها",
/*
##################################################################################
#                                                                                #
# transaction Viewer                                                             #
#                                                                                #
##################################################################################
*/
    "info_tx_viewer": "در اینجا می توانید یک تراکنش را برای بررسی محتویات تراکنش وارد کنید. سپس معامله می تواند به شبکه ارسال شود",
    "load_tx": "بارگذاری عملیات",
    "tx_qrcode": "کیو آر کد تراکنش ",
    "load_tx_qrcode": "بارگذاری تراکنش با کیوآرکد",
    "transaction_load_error": "خطا در بارگذاری تراکنش",
    "transaction_load_error_message": "در حالی که تلاش برای بارگذاری معامله اشتباهی رخ داد، مطمئن شوید که HEX در فرمت صحیح است ",
    "transaction_success_message": "معامله با موفقیت به شبکه ارسال شد",
    "transaction_success": "تراکنش با موفقیت انجام شد",
    "transaction_error_message": "هنگام انجام تراکنش اشتباهی رخ داد",
    "transaction_error": "خطا در تراکنش",
    "confirm_transaction_message": "آیا مطمئن هستید که میخواهید معامله را ارسال کنید؟",
    "broadcast_transaction_to_network":  "Broadcast Transaction to Network",
/*
##################################################################################
#                                                                                #
# tools node tester                                                              #
#                                                                                #
##################################################################################
*/
    "node_tester_msg": "آی پی را از گره خود وارد کنید تا اتصال جی آر پی سی  بررسی شود",
    "node_tester_stop": "توقف تست",
    "node_tester_test": " GRPCتست ",
    "node_tester_rt": "زمان پاسخ",
    "confirmed_block": "تایید بلوک",
    "loading": "در حال بارگذاری ..",
    "connection_node": "اتصال به گره",
/*
##################################################################################
#                                                                                #
# tools scanner                                                                  #
#                                                                                #
##################################################################################
*/
    "no_webcam_found": "هیچ وب کمی یافت نشد",
    "trying_enable_webcam_message_0": "خطا هنگام تلاش برای فعال کردن وب کم",
    "trying_enable_webcam_message_1": "اطمینان حاصل کنید که مجوزهای دوربین فعال هستند.",
/*
##################################################################################
#                                                                                #
# help section                                                                   #
#                                                                                #
##################################################################################
*/
    "what_is_tron": "وایت پیپر ترون V2.0",
    "tron_explorer_api":  "TRONSCAN API",
    "tron_architechure": "معماری ترون",
    "tron_protobuf_doc": "توضیحات پروتوف ترون",
    "report_an_error": "ارسال باگ / پیشنهاد",
    "frequently_asked_questions": "سوالات متداول",
    "telegram": "تلگرام",
/*
##################################################################################
#                                                                                #
# wallet section                                                                 #
#                                                                                #
##################################################################################
*/
    "open_wallet": "ورود به سیستم",
    "private_key": "کلید خصوصی",
    "keystore_file":  "Keystore File",
    "select_file": "انتخاب فایل",
    "login_mobile": "با یک دستگاه تلفن همراه وارد شوید",
    "create_wallet": "ساخت کیف پول",
    "no_open_wallet": "هیچ کیف بازی برای مشاهده وجود ندارد",
    "new_wallet": "کیف پول جدید",
    "password_encr_key_message_0": "این رمز عبور کلید خصوصی شما را رمزگذاری می کند. این به عنوان بذر برای تولید کلید های خود عمل نمی کند.",
    "password_encr_key_message_1": "برای باز کردن قفل کیف پول، به این رمز عبور و کلید خصوصی خود نیاز خواهید داشت.",
    "strong_password_info": "رمز عبور قوی مورد نیاز است",
    "save_keystore_file": "فایل کلید را ذخیره کنید",
    "download_keystore_file": "کلید رمز را دانلود کنید",
    "do_not_lose_it": "این را گم نکنید . ",
    "do_not_lose_it_message_0": "بنیاد ترون نمی تواند به شما در بازیابی کلید از دست رفته کمک کند.",
    "do_not_share_it": "آن را به اشتراک نگذارید",
    "do_not_share_it_message_0": "اگر از این فایل در یک سایت غیر معتبر استفاده کنید، ممکن است سرمایه شما از دست برود.",
    "make_a_backup": "یک نسخه پشتیبان تهیه کنید",
    "make_a_backup_message_0": "فقط در صورتی که لپ تاپ شما روی آتش باشد.",
    "save_private_key": "کلید خصوصی خود را ذخیره کنید",
    "print_paper_wallet": "پرینت بگیرید",
    "new_wallet_ready_message": "کیف پول جدید شما آماده است",
    "go_to_account_page": "برو به صفحه حساب کاربری",
    "login_first": "ابتدا وارد کیف پول شوید",
    "contract_name": "نام قرارداد",
    "compiler": "گرد اورنده",
    "tx_count": "تعداد معاملات",
    "setting": "تنظیمات",
    "date_verified": "تاریخ تایید شده",
    "compiler_version": "نسخه کامپایلر",
    "creator": "موسس",
    "verify_contract_code": "کد قرارداد را تأیید کنید",
    "buy_tokens": "خرید توکن",
    "fill_a_valid_private_key": "لطفا یک کلید خصوصی معتبر وارد کنید",
    "confirm_private_key": "تایید کلید خصوصی",
    "transfer_confirm_info": "آیا ممطمئن هستید که میخواهید انتقال دهید",
/*
##################################################################################
#                                                                                #
# blockchain block                                                                #
#                                                                                #
##################################################################################
*/
    "hash": "هش",
    "time": "زمان",
    "parenthash":  "Parent Hash",
    "size": "اندازه",
    "blockchain_size": "اندازه بلاکچین",
/*
##################################################################################
#                                                                                #
# ledger help page                                                               #
#                                                                                #
##################################################################################
*/
    "ledger_guide": "راهنمای لجر",
    "requirements": "نیازمندیها",
    "using_ledger_steps_message_0": "با استفاده از لجربا ترون اسکننیاز به مراحل زیر است:",
    "a":  "A",
    "install_the": "نصب",
    "app": "برنامه",
    "install_latest_version_message_0": "نصب آخرین نسخه از",
    "opening_your_wallet": "باز کردن کیف پول",
    "open_the_tronscan_desktop_client": "باز کردن مرورگر بلاکچین",
    "click_open_wallet_top_right": "روی دکمه ورود به سیستم در بالا سمت راست کلیک کنید",
    "choose_ledger": "انتخاب لجر",
    "connect_unlock_ledger_with_pin": "با پین کد به دستگاه خود متصل شوید و باز کنید",
    "open_tron_app_on_ledger": "برنامه ترون را در لجرخود باز کنید",
    "ledger_connected_tronscan_message_0": "اگر لجر شما درست وصل شده باشد، اتصال به ترون اسکن را نشان می دهد",
    "click_on_open_wallet": `بر روی" باز کردن کیف پول "کلیک کنید`,
    "redirect_to_your_wallet_message": "شما به کیف پول خود هدایت می شوید و می توانید آدرس ترون خود را مشاهده کنید",
    "using_ledger_to_sign_transactions": " از لجربرای امضای معاملات استفاده کنید",
    "using_ledger_to_sign_transactions_message_0": "اطمینان حاصل کنید که لجررا متصل کرده و برنامه ترون را باز کنید تا با استفاده از لجر،در ترون اسکن معاملات را امضا کنید",
    "using_ledger_to_sign_transactions_message_1": "ترون اسکن هنگامی که یک امضا معامله مورد نیاز است، یک پنجره با جزئیات معامله نشان می دهد. هر زمان که شما رای دهید، ارسال تی آرایکس انجام دهید، تغییر نام حساب، و غیره  امضاها مورد نیاز است .",
    "ledger_note": "توجه",
    "ledger_note_message_1": "فقط Ledger Nano S را پشتیبانی می کند.",
    "ledger_note_message_2": "از مرورگر گوگل کروم استفاده کنید",
    "ledger_note_message_3": "ما از TRX و TRC10 پشتیبانی می کنیم، فریز و آزاد کردن تی آرایکس، رای دادن، تنظیم نام.",
    "ledger_note_message_4": "در حال حاضر ویژگی های در دسترس نیست: معامله TRC20، آنفریز کردن TRC10، ایجاد توکن ، trxmarket، برنامه SR، برنامه پاداش SR، به روز رسانی Github، ایجاد جفت ارز، تزریق سرمایه و خروج سرمایه.",

/*
##################################################################################
#                                                                                #
# userinfo - popup notification                                                  #
#                                                                                #
##################################################################################
*/
    "record_not_found": "سابقه ای یافت نشد",
    "warning": "هشدار",
    "login_success": "ورود با موفقیت انجام شد",
    "logout_success": "خروج با موفقیت انجام شد",
/*
##################################################################################
#                                                                                #
# blockchain - Live                                                              #
#                                                                                #
##################################################################################
*/
    "applied_for_super_representative": "به عنوان سورنماینده اقدام شده ",
    "sr_candidature": "نامزد سوپر نمایندگی",
    "created_token": "ساخت توکن",
    "token_creation": "توکن ایجاد شده",
    "bought": "خرید",
    "voter": "رای دهنده",
    "voting": "رای دادن",
    "asset": "دارایی",
    "token_transfer": "انتقال توکن",
/*
##################################################################################
#                                                                                #
# buy Tron                                                                       #
#                                                                                #
##################################################################################
*/
    "buy_trx": "خرید تی آر ایکس",
    "buy_trx_message_0": "تی آر ایکس را می توان به طور مستقیم با فیات و یا دیگرکریپتو کارنسی ها بدون بورس اوراق بهادار خریداری کرد. این سرویس از سایت چنجلی استفاده می کند و ساده ترین و سریعترین راه برای خرید تی آرایکس است. لیستی از ارزهای پشتیبانی شده و یک پرسشنامه را می توانید در اینجا مشاهده کنید",
    "buy_trx_using_changelly": "خرید تی آرایکس با استفاده از چنجلی",
    "cant_load_widget": "نمیتوان بارگذاری کرد",
/*
##################################################################################
#                                                                                #
# new variables                                                                  #
#                                                                                #
##################################################################################
*/
    "date": "تاریخ",
    "total_transactions": "مجموع معاملات",
    "avg_blockTime":  "Avg BlockTime",
    "avg_blockSize":  "Avg BlockSize",
    "total_BlockCount":  "Total BlockCount",
    "new_address_seen": "مشاهده آدرس جدید",
    "transfer_contract": "اتقال قرارداد",
    "TRX_transfer_between_addresses": "انتقال تی آرایکس بین آدرس ها",
    "transfer_asset_contract": "قرارداد  انتقال دارایی",
    "token_transfer_between_addresses": "انتقال توکن بین آدرس ها",
    "participate_asset_issue_contract": "قرارداد مشارکت در دارایی",
    "participate_token_between_addresses": "مشارکت توکن بین آدرس ها",
    "witness_update_contract": "گواهی به روز رسانی قرارداد",
    "updates_a_witness": "گواهی به روز رسانی",
    "witness_create_contract": "گواهی ساخت قرارداد",
    "create_a_witness": "ایجاد گواهی",
    "account_update_contract": "قرارداد به روز رسانی حساب",
    "update_account_name": "به روز رسانی نام حساب",
    "withdraw_balance_contract": "لغو قرارداد بالانس",
    "withdraw_balance": "حذف بالانس",
    "freeze_balance_contract": "قرارداد فریز بالانس",
    "freeze_TRX": "فریز کردن تی آرایکس",
    "unfreeze_balance_contract": "قرار داد آزاد کردن بالانس",
    "unfreeze_TRX": "آزاد کردن تی آرایکس",
    "vote_witness_contract": "گواهی رای",
    "vote_for_a_witness": "رای دادن به یک شاهد",
    "asset_issue_contract":  "Asset Issue Contract",
    "issue_a_new_asset": "انتشار یک دارایی جدید",
    "owner_address": "آدرس مالک",
    "frozen_balance": "فریز کردن بالانس",
    "frozen_days": "روزهای فریز",
    "counts": "تعداد",
    "TRX_exchange_rate": "نرخ تبادل تی آر ایکس",
    "start_time": "زمان شروع",
    "end_time": "زمان پایانی",
    "contracts": "قراردادها",
    "search_description": "آدرس جستجو، ارتفاع بلوک، هش تراکنش، نام توکن",
    "search_description1": "جستجو آدرس، بلوک، تراکنش، توکن",
    "transaction": "تراکنش",
    "total_addresses": "مجموع آدرس ها",
    "daily_increment": "افزایش روزانه",
    "address_growth_chart": "نشانی نمودار رشد",
    "addresses_amount": "آدرس میزان",
    "past_14_days_of_transactions": "معاملات ۱۴ روز گذشته",
    "address_growth": "آدرس رشد",
    "power": "انرژی",
    "token_transfers": "نقل و انتقالات توکن",
    "search": "جستجو",
    "inter_tnxl": "  Txns قرارداد بین المللی ",
    "inter_a_total": "در مجموع",
    "inter_transactions_found": "معاملات داخلی پیدا شده است.",
    "parent_hash": "ParentHash",
    "inter_type": "نوع",
    "website_url": "وب سایت رسمی",
    "search": "جستجو",
    "language_support": "در حال حاضر فقط ورودی انگلیسی پشتیبانی می شود",
    "note": "توجه",
    "_percentage": "درصد",
    "foundation": "آدرس بنیاد",
    "foundation_address": "تعداد تی آرایکس فریز شده توسط موسس",
    "unfreeze_time": "زمان آزاد کردن",
    "addresses_number": "تعداد آدرس ها",
    "copyright": "حق چاپ",
/*
##################################################################################
#                                                                                #
# new variables    20180822 17:11:52                                                              #
#                                                                                #
##################################################################################
*/
    "tron_convert_tool": "ابزار رمزگذاری",
    "breakdown_supply_types": "تفکیک بر اساس انواع موجودی",
    "genesis": "پیدایش",
    "TRX_distribution_overview": "نمای کلی توزیع تی آرایکس",

    "block_produce_rewards": "بلوک تولید پاداش",
    "node_rewards": "پاداش نود",
    "independence_day_burned": "روز استقلال سوزانده شد",
    "fee_burned": "هزینه های سوخته",
    "current_total_supply": "مجموع عرضه",
    "foundation_freeze": "فریز شده توسط موسس",
    "price_per_1000_trx": "قیمت هر۱۰۰۰ تی آرایکس",
    "in_USD":  "In USD",
    "in_BTC":  "In BTC",
    "total_TRX_supply": "مجموع تی آرایکس تامین شده",
    "market_capitalization": "ارزش بازار",
    "circulating_supply": "گردش موجودی",
    "list_trx": "لیست تی آرایکس",
    "burned_trx": "تی آر ایکس سوخته",
    "supply_notes": "پیش فروش موجود در سطح جهانی، به جز در ایالات متحده، چین و ژاپن",
    "14_day_transaction_history": "معاملات ۱۴ روز گذشته",
    "14_day_address_growth": "آدرس رشد در ۱۴ روز گذشته",
/*
##################################################################################
#                                                                                #
# ICO--rating page                                                              #
#                                                                                #
##################################################################################
*/
    "TRONRating": "رتبه توکن ترون",
    "rating_title": "سیستم اعتبار توکن ترون اسکن",
    "modify_on": "اصلاح شده در",
    "rating_description": "هدف سیستم اعتبار ترون اسکن کمک به کاربران برای درک، تمایز و ارزیابی نشانه های مختلف. هنگامی که شما از صفحه نشانه بازدید می کنید، اعتبار به 5 دسته تقسیم می شود:",
    "rating_status_1": "در انتظار بررسی",
    "rating_status_1_desc_a": "هنوز بررسی نشده",
    "rating_status_2":  "OK",
    "rating_status_2_desc": `اعتبار "OK" یک تأیید یا توصیه نیست، اما مطابق با معیارهای زیر است:`,
    "rating_status_2_desc_a": "اطلاعات کافی و دقیق ارائه کنید",
    "rating_status_2_desc_b": "دارای اهداف دقیق پروژه و کانال های ارتباطی است",
    "rating_status_2_desc_c": "اطلاعات قابل دسترس از بنیانگذاران / سرمایه گذاران / مشاوران پروژه",
    "rating_status_2_desc_d": "توکن در مبادله رمزنگاری ارز با AML / KYC معامله می شود",
    "rating_status_2_desc_e": "ICO کمتر از 3 ماه کامل یا فعال میشود",
    "rating_status_2_desc_f": "یک نقطه عطف بزرگ حاصل شده است.",
    "rating_status_3": "بی طرف",
    "rating_status_3_desc": `بی طرف" بدان معنی است که اطلاعات مربوط به پروژه و تیم نسبتا شفاف است."`,
    "rating_status_3_desc_a": "ارائه اطلاعات لازم و کافی (وب سایت رسمی، لوگو، ایمیل رسمی، وایت پیپر)",
    "rating_status_3_desc_b": "پروفایل عمومی حرفه ای اعضای تیم و مشاوران به صورت آنلاین ارسال می شود (نشان دادن پروژه در مشخصات شخصی لینکدین)",
    "rating_status_3_desc_c": "ارائه مطالب رسانه های اجتماعی",
    "rating_status_4": "اطلاعات کافی نیست",
    "rating_status_4_desc_a": "اطلاعات لازم و کافی (وب سایت رسمی، آرم، ایمیل رسمی، وایت پیپر) را ارائه نشده است",
    "rating_status_4_desc_b": "هیچ اطلاعاتی وجود ندارد که نشان دهد پروژه در حال پیشرفت عملیاتی است.",
    "rating_status_5": "اطلاعات نادرست است",
    "rating_status_5_desc_a": "برای انتشار توکن از هویت نادرست استفاده کرده اید.",
    "rating_status_5_desc_b": "اطلاعاتی وجود دارد که نشان می دهد رفتارهای تقلب / فیشینگ / کلاه برداری/ هرزنامه یا اشتباه مربوط به این توکن به درستی انجام نشده است و یا توکن دارای نشانه های خطرناک دیگری است.",
    "rating_disclaimer": "سلب مسئولیت",
    "disclaimer_desc_1": "ترون اسکن هیچگونه خدمات یا پروژه هایی را که مربوط به قراردادهای توکن   در ترون اسکن نمایش داده شده را تایید یا تکذیب نمی کند. قبل از انجام اقدامات مرتبط با توکن ، کاربران باید همیشه با تحقق اهداف تحقیق، کاربران باید همیشه با تحقیق در مورد اهداف توکن بپردازند، به ویژه هنگامی که به سرمایه گذاری می پردازند.",
    "disclaimer_desc_2": "در رابطه با این سرویس ممکن است دقیق نباشد زیرا آنها بر اساس ارزیابی ذهنی و / یا گزارش از جامعه است.. ما هیچ طرفی را نمی گیریم و هیچ سطح مسئولیت / صحت / ارزیابی قابلیت اطمینان را تضمین نمی کنیم و یا انجام نمی دهیم. ارزیابی اعتبار ما نمیتواند به عنوان توصیه های رفتاری، به ویژه مشاوره سرمایه گذاری، تلقی شود.",
    "disclaimer_desc_3": "ما حق تفسیر سابقه نمادین نشانه در این صفحه را داریم و ما ملزم به ارائه بازخورد برای امتناع نیستیم.. ما حق حذف و یا به روز رسانی اطلاعات (از جمله شهرت) را پس از یک اشتباه و یا عدم اطمینان از اطلاعات را داریم.",

/*
##################################################################################
#                                                                                #
# ICO--myToken page                                                              #
#                                                                                #
##################################################################################
*/
    "my_token": "توکن من",
    "my_token_desc_1": "اطلاعات مربوط به توکن روی صفحه نشان داده می شود. هر توکن بر اساس جامع بودن و صحت اطلاعات به دست می آید",
    "tron_rating": "اعتبار توکن",
    "my_token_desc_2": "اگر شما نیاز به به روز رسانی اطلاعات خود دارید، لطفا با استفاده از الگوی اکسل زیر به token@tronscan.org از طریق ایمیل شرکت خود یا ایمیل گواهی نامه مدارک لازم را ارسال کنید.",
    "brief_info": "مقدمه کوتاه",
    "website_official": "وب سایت رسمی",
    "white_paper": "وایت پیپر",
    "GitHub": "گیتهاب",
    "country": "کشور / منطقه",
    "social_link": "لینک رسانه اجتماعی",
    "download_excel": "قالب را دانلود کنید",
    "no_message": "N/A (لطفا برای تکمیل این اطلاعات، یک ایمیل ارسال کنید)",
    "insufficient_message": "اطلاعات کافی نیست",
    "neutral": "بی طرف",
    "pending": "در حال بررسی",
    "fake": "جعلی",
    "token_detail": "اطلاعات توکن",
    "contact_us": "با ما تماس بگیرید",
    "my_token": "توکن من",
    "try_later": "لطفا بعدا امتحان کنید",
    "contract_address": "آدرس قرارداد",

/*
##################################################################################
#                                                                                #
# ICO--create token page                                                         #
#                                                                                #
##################################################################################
*/
    "basic_info": "اطلاعات پایه",
    "basic_info_desc": "اطلاعات پایه توکن",
    "exchange_setting": "صدور مجوز",
    "exchange_setting_desc": "قیمت صدور و چارچوب زمانی برای توکن را تنظیم کنید ",
    "freeze_setting": "تنظیمات فریز",
    "freeze_setting_desc": "یک بخش از نشانه ها را برای یک دوره زمانی فریز کنید",
    "confirm_setting": "تایید تنظیمات",
    "confirm_setting_desc": "تمام اطلاعات خود را تأیید کنید",
    "token_logo": "لوگوی توکن",
    "image_restraint_desc": "رزولوشن 1: 1، قالب پیشنهاد شده jpg/png",
    "prev_step": "قبلی",
    "freeze_on": "روشن",
    "freeze_off": "خاموش",
    "freeze_not_valid": "خاموش کردن عملکرد فریز",
    "no_logo_error": "هیچ لوگویی یافت نشد",
    "confirm_issue_info": "لطفا اطمینان حاصل کنید که اطلاعات زیر درست است، زیرا قرارداد هوشمند نمیتواند پس از آنکه در زنجیره بلوک نوشته شود اصلاح شود",
    "tick_checkbox": "باید علامت کادر را تیک بزنید",
    "change_info": "اگر اطلاعات درست نباشد، لطفا",
    "total": "مجموع",
    "a_totle": "مجموع از",
    "transaction_info": "معاملات یافت شده",
    "hold_addr": "دارندگان توکن",
    "transactions_unit": "معاملات",
    "transfers_unit": "انتقال",
    "block_unit": "بلوک",
    "record_unit": "معاملات",
    "token_unit": "توکن ها",
    "vote_unit": "نامزدها",
    "voter_unit": "رای دهندگان",
    "account_unit": "حسابها",
    "address_unit": "آدرس ها",
    "contract_unit": "کد منبع تأیید قرار داد یافت شده است.",
    "inter_contract_unit": "معاملات داخلی ",

/*
##################################################################################
#                                                                                #
# ICO--participate page                                                         #
#                                                                                #
##################################################################################
*/

    "issue_progress": "پیش رفتن",
    "fund_raised":  "افزایش یافته",
    "issuing_price": "قیمت صدور",
    "buy_token_info": "چقدرمقدار توکن شما می خواهید خرید کنید؟",
    "reputation":  "پیش رفت",
    "issue_time": "زمان صدور مجوز",
    "success_receive": "با موفقیت دریافت شد",
    "circulating_supply": "منبع تغذیه",
    "issue_info": "اطلاعات صدور",
    "transferring": "در حال پیشرفت",
    "in_progress": "در حال پیشرفت",
    "fail_transaction": "معامله شکست خورده است",
    "records": "سوابق",
    "part_total": "مجموع",
    "part_pass": "توکن های یافت شده",
    "view_total": "مجموع از",
    "view_pass": "توکن برای به اشتراک گذاری",
    "token_overview_tron": "مرور اجمالی بر بازار توکن ترون",
    "token_participate_tron": "شركت در صدورتوکن ترون",
    "not_started": "شروع نشده",
    "no_token_to_buy": "با عرض پوزش، تمام عرضه هاصادر شده است، لطفا صبر کنید توکن ها برای شرکت در مسابقه باز شود.",

/*
##################################################################################
#                                                                                #
# contract page                                                                  #
#                                                                                #
##################################################################################
*/

    "Code": "کد",
    "contract_overview": "بررسی قرارداد",
    "trx_value": "ارزش تی آرایکس",
    "token_tracker": "ردیابی توکن",
    "contract_creator": "سازنده قرارداد",
    "at_txn":  "at txn",
    "token_txns":  "Token Txns",
    "Events": "رویدادها",
    "TxHash":  "TxHash",
    "Internal_Txns": "Txns داخلی",
    "ParentTxHash":  "ParentTxHash",
    "TxFee":  "[TxFee]",
    "contract_code_verified": "کد منبع قرارداد تأیید شده (دقیق)",
    "Contract_ABI": "قراردادABI ",
    "Byte_code": "کد بایت",
    "Constructor_Arguments": "استدلال سازنده -کد گذاری شده و آخرین بایت از قرارداد کد ایجاد شده در بالا است",
    "Copy": "کپی",
    "TxHash_Block_Age":  "TxHash | Block | Age",
    "Method": "روش",
    "Event_Logs": "گزارشات رویداد",
    "With_Verified_Source_Codes_Only": "فقط با کد منبع تأیید شده",
    "verified_contract_source_codes_found": "کد منبع تأیید شده یافت شده است",
    "contract_source_codes_found": "قراردادهای پیدا شده",
    "ContractName": "نام قرارداد",
    "TxCount":  "TxCount",
    "Settings": "تنظیمات",
    "DateVerified": "تاریخ تأیید",
    "Compiler": "گردآورنده",
    "Compiler_Text": "متن گردآورنده",
    "Contract_Internal_Transactions": "معاملات قرارداد  داخلی",
    "Internal_Transactions_found": "معاملات داخلی پیدا شده",
    "Misc": "متفرقه",
    "Optimization_Enabled": "بهینه سازی فعال",
    "Normal_Transactions": "معاملات عادی",
    "Verified_contracts": "قراردادهای تایید شده",
    "Constructor_Arguments_tip": "استدلال های سازنده",

/*
##################################################################################
#                                                                                #
# new variables    2018-09-11 12:51:31                                           #
#                                                                                #
##################################################################################
*/
    "pice_per_1trx": "قیمت",
    "tron_power_freezing": "انرژی را می توان از طریق فریز تی آر ایکس بدست آورد ،  هر ۱ تی آرایکس معادل ۱ انرژی میباشد.",
    "HighChart_tip": "برای بزرگنمایی روی منطقه کلیک کنید و بکشید",
    "general_information": "اطلاعات عمومی",
    "blockchain_information": "اطلاعات بلاکچین",
    "sr_information": "اطلاعات سوپر نماینده ها",
    "currency_information": "اطلاعات  کارنسی ها",
    "your_vote": "رای های شما",
    "total_number_frozenTRX": "تعداد تی آرایکس فریز شده ",
    "tronics_support_planTRX": "تی آرایکس توسط برنامه پشتیبانی ترونیک فریزشده ",
    "frozen_by_the_foundationTRX": "تی آرایکس فریزشده توسط بنیاد",
    "tronics_support_plan": "طرح پشتیبانی ترونیک",
    "tronics_support_plan_recipient_address": "آدرس گیرنده طرح پشتیبانی ترونیک ",
    "update_token": "به روز رسانی توکن",
    "total_frozen": "رزرو بنیاد",
    "account_create_contract": "قرارداد حساب کاربری",
    "account_create": "ساخت حساب کاربری",
    "create_from_address": "ورود آدرس قرارداد",
    "create_to_address": "ایجاد آدرس حساب کاربری",
    "proposal_create_contract": "پیشنهاد ایجاد قرارداد",
    "proposal_create": "ایجاد پیشنهاد",
    "block_not_found": "با عرض پوزش، بلوک یافت نشد",
    "transaction_not_found": "با عرض پوزش، معامله یافت نشد",
    "search_not_found": "با عرض پوزش، رشته جستجوی وارد شده یافت نشد.",
    "available_balance": "موجودی",
/*
##################################################################################
#                                                                                #
# verify-contract-code                                          #
#                                                                                #
##################################################################################
*/
    "contract_source_code": "کد قرارداد",
    "bytecode_and_ABI": "ByteCode And ABI",
    "verify_and_publish_your_solidity_source_code": "کد منبع خود را تأیید و منتشر کنید",
    "step": "مرحله",
    "step_1": "کد قرارداد خود را وارد کنید.",
    "step_2": "اگر بایت کد تولید شده منطبق با بایت کد آدرس باشد، قرارداد پس از آن تایید میشود.",
    "step_3": "کد منبع قرارداد به صورت آنلاین منتشر می شود و توسط هر کسی قابل  تایید است.",
    "contract_notes": "نکته",
    "contract_notes_1": "برای تأیید قراردادهایی که با استدلال سازنده موافق هستند، لطفا آرگومنت کد شده آی بی ای را در کادر زیر وارد کنید.",
    "contract_notes_2_1": "برای اهداف اشکال زدایی اگر آن را به درستی اصلاح نکنید در",
    "contract_notes_2_2": " TRON studio",
    "contract_notes_2_3": "همچنین باید در اینجا به درستی اصلاح شود.",
    "contract_notes_3": `ما از تأیید صحت قرارداد که با استفاده از "واردات" است پشتیبانی نمی کنیم.`,
    "contract_notes_4": "ما از تایید قرارداد برای قراردادهای ایجاد شده توسط یک قرارداد دیگر پشتیبانی نمی کنیم.",
    "contract_notes_5": "زمان قرارداد تا ۴۵ ثانیه برای هر قرارداد جمع شده وجود دارد. اگر قرارداد شما طولانی تر از این باشد ما قادر نخواهیم بود آن را تأیید کنیم.",
    "contract_notes_6": "اطلاعات بیشتر در نسخه بعدی قرار می گیرند.",
    "contract_address": "آدرس قرارداد",
    "contract_optimization": "بهینه سازی",
    "enter_contract_code": "کد قرارداد را در زیر وارد کنید",
    "following_optional_parameters": "در زیر پارامترها اختیاری هستند",
    "constructor_arguments_ABIencoded": "Arguments Constructor ABI-encoded (برای قراردادهایی که پارامترهای سازنده را می پذیرند)",
    "contract_library_address": "آدرس کتابخانه قرارداد (برای قراردادهایی که از کتابخانه ها استفاده می کنند، تا ۵ کتابخانه پشتیبانی می کند):",
    "library_1_name": "نام",
    "library_2_name": "نام",
    "library_3_name": "نام",
    "library_4_name": "نام",
    "library_5_name": "نام",
    "library_contract_address": "آدرس قرارداد کتابخانه",
    "verify_and_publish": "تایید و انتشار",
    "txn": "txn",
    "contract_name_tip": "باید با نام قرارداد در کد منبع یا در قرارداد مولتی پارت مطابقت داشته باشد، آن باید با نام قرارداد که شما مستقر کرده اید مطابقت داشته باشد.",
    "constructor_arguments_ABIencoded_tip": "این گزینه به تنهایی برای قراردادهای استدلال سازنده استفاده می شود، اگر شما مطمئن نیستید که احتمالا به آن نیاز ندارید. استدلال سازنده باید در مقادیر ABI-ENCODED باشد و به کد بایت قرارداد اضافه شود.",
    "library_1_name_tip": "این گزینه فقط برای قراردادهایی که از کتابخانه استفاده می کنند، اعمال می شود.",
    "library_contract_address_tip": "آدرس  قراردادکتابخانه",
    "contract_source_code_for": "کد منبع قرارداد برای",
    "has_already_been_verified": "قبلا تأیید شده است",
    "click_here_to_view": "برای مشاهده اینجا کلیک کنید",
    "contract_was_creating_during": "قرارداد ایجاد شد",
    "constructor_arguements": "آرگومان های مورد استفاده (ABI-کد گذاری) ،",
    "ContractBytecode": "ContractBytecode",
    "ContractABI": "ContractABI",
    "start_over": "شروع به کار",
    "sorry_unable_contract_address": "با عرض پوزش! نمیتوانید کد قرارداد را در قرارداد",
    "this_a_valid_contract_address": "این یک آدرس قرارداد معتبر است؟",
    "successfully_generated_byteCode": "ByteCode و ABI برای آدرس قرارداد ساخته شده است",
    "error_construct_ABI_encoded": "گمشده آرگومان های سازنده / کتابخانه برای تابع استفاده می شود",
    "error_construct_bytecode_for": "Sorry! The Compiled Contract ByteCode for ",
    "the_contract_creation_code_for": " با کد ایجاد قرارداد مطابقت ندارد",
    "error_contract_ABI_for": "Sorry! The Compiled Contract ABI for",
    "unableto_verify_contract_source_code": "عدم امکان تأیید کد منبع قرارداد",
    "contractname_found": "نام قراردادهای یافت شده",
/*
##################################################################################
#                                                                                #
# contract-type                                          #
#                                                                                #
##################################################################################
*/
    "trigger_smart_contract": "راه اندازی قرارداد هوشمند",
    "normal_address_trigger_smart_contract": "آدرس عادی باعث قرارداد هوشمندانه می شود",
    "trigger": "راه اندازی قرارداد",
    "contract_triggers_total": "راه اندازی قرارداد",
    "contract_triggers_owner": "مالک",
    "contract_triggers_owner_address": "آدرس مالک",
    "no_tnx": "بدون معامله",
    "no_event": "هیچ رویدادی وجود ندارد",
    "link_test_fauct": "تست سوپاپ ",
    "gain_bandwith": "فریز تی آرایکس برای به دست آوردن پهنای باند",
    "gain_energy": "فریز تی آرایکس برای به دست آوردن انرژی",
    "energy": "انرژی",
    "freeze_trx_gain_bandwith_energy": "شما میتوانید انرژی و پهنای باند بدست بیاورید",
    "freeze_type": "نوع فریز",
    "success_unfrozen_trx": "آزاد کردن تی آر ایکس موفقیت آمیز بود",
    "please_select_the_type_of_unfreeze": "لطفا نوع آزاد کردن را انتخاب کنید",
    "unfreeze_bandwidth": "برای دریافت تی آر ایکس، حساب پهنای باند را باز کنید",
    "unfreeze_energy": "برای دریافت تی آر ایکس انرژی را آز حالت فریز خارج کنید",
    "hide_small_currency": "Hide small balances",
    "tokens_less_than_10": "Tokens with a quantity less than 10",
    "only_TRX_transfers": "فقط انتقال تی آر ایکس",
    "no_transfers_found": "هیچ معامله ای یافت نشد",
    "current_MaxTPS": "Current/Max TPS",

/*
##################################################################################
#                                                                                #
# exchange                                         #
#                                                                                #
##################################################################################
*/

    "apply_for_the_currency": "درخواست ارز",
    "apply_for_process": "درخواست فرآیند ارز",
    "apply_content": "اگر می خواهید سکه ها را اضافه کنید، لطفا فرم درخواست را برای ارائه اطلاعات در مورد ارز، پر کنید. پس از ارسال اطلاعات، داده ها را در اسرع وقت بررسی خواهیم کرد. لطفا قبل از پاسخ به نتایج حسابرسی صبر کنید.",
    "operate_txn_pair_message": "لطفا یک عدد صحیح وارد کنید",
    "withdraw_all": "به طور کامل تحویل نمی شود",
    "creat_valid": "نمیتوان تعادل حساب را از دست داد",
    "my_trading_pairs": "جفت های معاملاتی من",
    "create_trading_pairs": "ایجاد جفت های معاملاتی",
    "pairs": "جفت",
    "no_pairs": "هیچ جفتی وجود ندارد",
    "capital_injection": "تزریق سرمایه",
    "capital_withdrawal": "خروج سرمایه",
    "pair_has_been_created": "جفت ایجاد شده است",
    "successfully_created_pair": "یک جفت معامله موفقیت آمیز ایجاد شد",
    "pair_creation_failed": "ایجاد جفت ناموفق بود",
    "successful_injection": "تزریق موفقیت آمیزبود",
    "sorry_injection_failed": "با عرض پوزش، تزریق انجام نشد",
    "successful_withdrawal": "برداشت موفقیت آمیز بود",
    "sorry_withdrawal_failed": "با عرض پوزش، خروج ناموفق بود",
    "select_the_name_of_the_Token": "لطفا نام توکن را انتخاب کنید",
    "enter_the_amount": "مقدار را وارد کنید",
    "choose_a_Token_for_capital_injection": "یک توکن برای تزریق سرمایه انتخاب کنید:",
    "choose_a_Token_for_capital_withdrawal": "انتخاب یک توکن برای خروج سرمایه:",
    "injection_amount": "میزان تزریق:",
    "withdrawal_amount": "مقدار خروج:",
    "marks": "بازار",
    "last_price": "آخرین قیمت",
    "pairs_change": "تغییرات",
    "H":  "H",
    "L":  "L",
    "O":  "O",
    "C":  "C",
    "24H_VOL":  "24H VOL",
    "token_application_instructions_title": "لیست توکن",
    "token_application_instructions_1": "توکن هایی که بررسی شده اند، در لیست دی ای ایکس نمایش داده می شوند. با استفاده از تابع جستجو می توان از توکن هایی های غیرقابل بازبینی استفاده کرد",
    "click_here_to_apply": "برای درخواست اینجا کلیک کنید",
    "TxTime": "زمان تراکنش",
    "TxAmount": "مبلغ معامله",
    "TxRecord": "ضبط تراکنش",
    "TxAvailable": "موجود",
    "TxBuy": "در انتظار خرید",
    "TxSell": "آماده فروش",
    "my_transaction": "تراکنش های من",
    "enter_the_trading_amount": "مقدار معامله را وارد کنید",
    "BUY": "خرید",
    "SELL": "فروش",
    "estimated_cost": "هزینه پیش بینی شده",
    "estimated_revenue": "برآورد درآمد",
    "slightly_cost": "هزینه برآورد شده کمی افزایش می یابد و میزان گردش آن بالاتر خواهد بود.",
    "slightly_revenue": "درآمد تخمین زده شده کمی کاهش پیدا می کند و میزان گردش آن بالاتر خواهد بود",
    "participation_message_2": "زمان فعال نیست، یعنی کاربران نمیتوانند در توکن ترون اسکن شرکت کنند.",
    "created_token_time": "ایجاد شده است",
    "overview_TRC20":  "TRC20 Overview",
    "overview_TRC10": "TRC10 Overview",
    "pice_per_onetrx": "قیمت تی آر ایکس",
    "total_tokens": "مجموع توکن ها",
    "application_entry": "درخواست ورود",


/*
##################################################################################
#                                                                                #
# commottee                                         #
#                                                                                #
##################################################################################
*/
    "committee": "کمیته ترون",
    "committee_dec_1": "کمیته ترون برای اصلاح پارامترهای پویا در شبکه ترون میباشد، به عنوان مثال پاداش بلوک، هزینه های معامله و غیره",
    "committee_dec_2": "کمیته شامل ۲۷ سوپر نماینده میباشد",
    "committee_dec_3": "هر ۲۷ نماینده دارای حق رای و پیشنهاد هستند .",
    "committee_dec_4": "هنگامی که یک پیشنهاد ۱۹ رای یا بیشتر از سوپرنماینده ها در مدت زمان معتبر دریافت می شود، پیشنهاد تایید خواهد شد و پارامترهای شبکه آن در دوره نگهداری بعدی اصلاح خواهد شد.",
    "get_committee_proposal": "پیشنهادهای کمیته را بررسی کنید",
    "TRON_network_parameters": "پارامترهای شبکه ترون",
    "commission_proposed": "پیشنهادات کمیته",
    "TRONSR": "سوپر نماینده های ترون",
    "learn_more": "بیشتر بدانید",
    "propose_number": "شماره",
    "propose_parameters": "پارامتر",
    "propose_current_value": "ارزش فعلی",
    "propose_hour": "ساعت",
    "propose_1": "پیشنهاد تغییر دوره تعمیر و نگهداری سوپر نماینده ها",
    "propose_2": "پیشنهاد برای تغییر هزینه درخواست برای حساب کاربری سوپرنماینده",
    "propose_3": "پیشنهاد برای تغییر هزینه ایجاد حساب",
    "propose_4": "پیشنهاد برای تغییر مقدار تی آر ایکس  برای به دست آوردن پهنای باند اضافی",
    "propose_5": "پیشنهاد برای تغییر مبلغ هزینه دارایی",
    "propose_6": "پیشنهاد برای تغییر پاداش بلوک سوپرنماینده ها",
    "propose_7": "پیشنهاد تغییر پاداش داده شده به ۲۷ رتبه برتر و ۱۰۰ نامزد بعدی",
    "propose_8": "پیشنهاد برای تغییر هزینه ایجاد حساب",
    "propose_9": "پیشنهاد برای اصلاح مصرف پهنای باند.",
    "propose_10": "پیشنهاد برای فعال کردن ماشین مجازی (VM)",
    "propose_11": "پیشنهاد برای حذف رای گیری Genesis GR",
    "propose_12": "پیشنهاد برای تغییر هزینه یک انرژی",
    "propose_13": "پیشنهاد برای تغییر حداکثر زمان اجرای یک معامله",
    "propose_14": "پیشنهاد برای تغییر نام حساب کاربری",
    "propose_15": "پیشنهاد اجازه صدور توکن های هم نام",
    "propose_16": "پیشنهاد برای اجازه دادن به مجوز منابع",
    "propose_17": "پیشنهاد به اجازه هیئت منابع",
    "propose_18": "پیشنهاد برای تغییر کل محدودیت انرژی",
    "propose_18_1": "پیشنهاد برای تغییر کل محدودیت انرژی",
    "propose_19": "پیشنهاد انتقال TRC-10 Token در قراردادهای هوشمند",
    "propose_20": "محدودیت های انرژی",
    "propose_21": "توصیه می شود چندین امضا را فعال کنید",
    "propose_22": "پیشنهاد به اجازه تنظیم تطبیقی برای انرژی کل",
    "propose_23": "هدف محدودیت انرژی",
    "propose_24": "میانگین حد انرژی",
    "propose_25": "هزینه برای به روز رسانی مجوز های حساب",
    "propose_26": "پیشنهاد برای تغییر هزینه برای چند امضایی",
    "propose_minute":"دقیقه",
    "propose_unactivate":"فعال نشده است",
    "propose_not_allowed": "مجاز نیست",
    "propose_allowed": "مجازاست",
    "propose_activate": "فعال کردن",
    "propose_finished": "پایان یافته",
    "proposal_content_info": "محتوای پیشنهاد",
    "proposer": "پیشنهاد دهنده",
    "proposal_time_of_creation": "زمان ایجاد (UTC)",
    "proposal_time_of_expire": "زمان انقضا (UTC)",
    "proposal_status": "وضعیت پیشنهاد",
    "proposal_to": "به",
    "no_commission_proposed_found": "هیچ کمیسیون پیشنهاد شده یافت نشد",
    "proposal_effective": "موثر",
    "proposal_voting": "رای دادن",
    "proposal_ineffective": "بی نتیجه",
    "proposal_cancelled": "لغو",
    "proposal": "پیشنهاد",
    "approvers_of_the_proposal": "تصویب پیشنهاد",
    "total_approving_votes": "مجموع آرای تایید",
    "to_provide_a_better_experience": "برای ارائه یک تجربه بهتر، این آمار هر دقیقه به روز می شود.",
    "TRC10_token": "TRC10 Token",
    "TRC20_token": "TRC20 Token",
    "TRC20_decimals": "دقت",
    "nav_more": "بیشتر",
    "no_holders_found": "هیچ دارنده توکن یافت نشد",
    "search_TRC20": "جستجوی آدرس",
    "beginners_guide": "راهنمایی",
    "Submit_a_bug": "ارسال باگ",
    "TRONdice": "سکه تاس را نگهدارید و سود تی آرایکس بگیرید",
    "Join_TRONdice": "Join_TRONdice",
    "search_TRC20_error": "لطفا آدرس صحیح را وارد کنید",
    "dex_announcement": "توجه",
    "regulations_on_trading_pairs": "مقررات جفتهای معاملاتی",
    "How_to_trade_on_DEX": "نحوه تجارت در DEX",
/*
##################################################################################
#                                                                                #
# about us                                         #
#                                                                                #
##################################################################################
*/
    "about_us": "درباره ما",
    "what_we_do": "فعالیت های ما ",
    "Transcan_desc": "ترون اسکن اولین بلوک کاوشگر مبتنی بر ترون است. این نه تنها شامل برخی از توابع اولیه مرورگر مبتی بر بلوک است ، مانند جستجوی تراکنش، حساب ها، بلوک ها، گره ها، قراردادهای هوشمند است. آمار و ارقام داده ها در مورد زنجیره، بلکه به طور مستقیم از ایجاد نشانه پشتیبانی می کند. در همان زمان، ترون اسکن همچنین دارای یک کیف پول داخلی ساخته شده و دی ای ایکس مبتنی بر بانکراست که ماتریس کاربرد ترون اسکن را غنی می کند.",
    "Our_team": "انجمن مولف",
    "Team_desc": "تیم ما بنیاد رفاهی بلاکچین در مالتا است و به طور فعال در ساخت و ساز اکولوژیکی ترون فعالیت دارد. این تیم شامل بیش از ۳۰ نفر در سراسر جهان است، که عمدتا توسعه دهندگان و اپراتورها هستند. در آینده، ما در بلند مدت به توسعه زیست محیطی ترون محدود خواهیم بود. برای تکمیل ترون اسکن، ما همچنین دپ ها را بر اساس ترون توسعه خواهیم داد.",
    "User_many": "کاربران ترون اسکن در سراسر جهان",
    "User_many_desc": "هر روز طرفداران ترون از سراسر جهان از مرورگر بلاکچین  ترون اسکن استفاده می کنند، جایی که آنها می توانند اطلاعات مربوط به معامله را بررسی کنند و آخرین ویژگی های ترون را تجربه کنند.",
    "HarryXu": "ارائه پشتیبانی فنی",
    "Skye": "جمع آوری نظرات و کمک به حل آنها",
    "Ariml": "دریافت پیشنهادات برای طراحی صفحات",
    "Lee": "کارهای زیادی برای ترجمه نسخه ژاپنی انجام دهید",
    "YanZheng": "ارائه پشتیبانی فنی",
    "Zach": "ارائه پشتیبانی پشتیانی فنی و تست",
    "Adolph": "بررسی آخرین تحولات در صنعت بلوکچین، کمک زیادی به طراحی محصول و موقعیت یابی ترون اسکن می باشد",
    "Vincent Lau": "ارائه بسیاری از فن آوری های بلاکچین برای پشتیبانی ",

/*
##################################################################################
#                                                                                #
# new variables    2018-12-06                                    #
#                                                                                #
##################################################################################
*/
    "newly_issued_token_by_tronscan": "توکن های جعلی به لیست سیاه اضافه می شود و نمایش داده نمی شود",
    "Favorites": "علاقه مندی ها",
    "dex_search_dec": "کلمه اختصاری توکن را وارد کنید",
    "TRC20_exchange_online": "تبادل آنلاین تی آرسی ۲۰ فعال است",
    "Trade_on_TRXMarket": "معامله در بازار تی آر ایکس",
    "issued_token_of_tronscan": "توکن صادر شده تنها در بازبینی تی آر سی ۱۰ نمایش داده می شود پس از صدور مجوز ترون اسکن منتقل می شود",
/*
##################################################################################
#                                                                                #
# notice  2018-12-10                                     #
#                                                                                #
##################################################################################
*/
    "OthersArticle": "مقالات در این گروه",
    "donateAddress": "اهداءی",
/*
##################################################################################
#                                                                                #
# trc20  2018-12-18                                     #
#                                                                                #
##################################################################################
*/
    "trc20_nav_state": "ورود به سیستم",
    "trc20_nav_dex": "DEX",
    "trc20_nav_trc10": "TRC10 Exchange",
    "trc20_nav_trc20":  "TRC20 Exchange",
    "trc20_nav_tokenList": "لیست توکن",
    "trc20_nav_aboutUs": "درباره",
    "trc20_footer_explain": "نرخ استاندارد",
    "trc20_footer_qa": "پرسش و پاسخ",
    "trc20_footer_standard_1": "هزینه خدمات تی آر ایکس مارکت به شرح زیر است",
    "trc20_footer_standard_2": "شارژ: بدون نیاز به شارژ",
    "trc20_footer_standard_3": "خروج: بدون خروج",
    "trc20_footer_standard_4": "0.1٪ تراکنش: هزینه کارمزد",
    "trc20_footer_standard_5": "توجه: حق تفسیر استاندارد هزینه متعلق به تی آر ایکس مارکت است، و تی آر ایکس مارکت حق تنظیم نرخ را دارد.",
    "trc20_apply_for_the_currency": "درخواست برای ارز",
    "trc20_apply_for_process": "درخواست برای روند ارز",
    "trc20_apply_content": "اگر میخواهید سکه ها را اضافه کنید، لطفا فرم درخواست را برای ارائه اطلاعات در مورد ارز، پر کنید. پس از ارسال اطلاعات، داده ها را در اسرع وقت بررسی خواهیم کرد. لطفا قبل از پاسخ به نتایج حسابرسی صبر کنید.",
    "trc20_operate_txn_pair_message": "لطفا یک عدد صحیح وارد کنید",
    "trc20_withdraw_all": "به طور کامل مجاز نیست",
    "trc20_creat_valid": "نمیتوان توازن حساب را از دست داد",
    "trc20_my_trading_pairs": "جفت های معاملاتی من",
    "trc20_create_trading_pairs": "ایجاد جفت های معاملاتی",
    "trc20_pairs": "جفت",
    "trc20_no_pairs": "بدون جفت",
    "trc20_capital_injection": "تزریق سرمایه",
    "trc20_capital_withdrawal": "خروج سرمایه",
    "trc20_pair_has_been_created": "جفت ایجاد شده است",
    "trc20_successfully_created_pair": "یک جفت معامله موفقیت آمیز ایجاد شد",
    "trc20_pair_creation_failed": "ایجاد جفت موفق آمیز نبود",
    "trc20_successful_injection": "تزریق موفقیت آمیز انجام شد",
    "trc20_sorry_injection_failed": "با عرض پوزش، تزریق با موفقیت انجام نشد",
    "trc20_successful_withdrawal": "خروج موفقیت آمیز بود",
    "trc20_sorry_withdrawal_failed": "با عرض پوزش، خروج انجام نشد",
    "trc20_select_the_name_of_the_Token": "لطفا نام توکن را انتخاب کنید",
    "trc20_enter_the_amount": "مقدار را وارد کنید",
    "trc20_choose_a_Token_for_capital_injection": "یک توکن برای تزریق سرمایه انتخاب کنید:",
    "trc20_choose_a_Token_for_capital_withdrawal": "یک توکن برای خروج سرمایه انتخاب کنید:",
    "trc20_injection_amount": "مقدار تزریق:",
    "trc20_withdrawal_amount": "مقدار خروج:",
    "trc20_marks": "بازار",
    "trc20_guide": "راهنمای کاربر",
    "trc20_last_price": "آخرین قیمت",
    "trc20_pairs_change": "مبادله",
    "trc20_H": "H",
    "trc20_L": "L",
    "trc20_O": "O",
    "trc20_C": "C",
    "trc20_24H_VOL": "24H VOL",
    "trc20_price": "قیمت",
    "trc20_amount": "مقدار",
    "trc20_enter_the_trading_amount": "مقدار معامله را وارد کنید",
    "trc20_enter_10": "Total ≥ 10 TRX",
    "trc20_enter_the_trading_price": "قیمت معامله را وارد کنید",
    "trc20_TxAvailable": "موجود",
    "trc20_BUY": "خرید",
    "trc20_SELL": "فروش",
    "trc20_token_application_instructions_title": "دستورالعمل کاربرد توکن",
    "trc20_token_application_instructions_1": "برای تجربه کاربری بهتر، لطفا درخواست را با اطلاعات دقیق در مورد توکن که میخواهید صادر کنید را پر کنید. پس از دریافت درخواست شما، بررسی اطلاعاتی را که در طی 3 تا 5 روز کاری ارائه کرده اید، مرور خواهیم کرد. توکن بدون بررسی پنهان خواهد شد.",
    "trc20_click_here_to_apply": "برای درخواست اینجا کلیک کنید",
    "trc20_TxTime": "زمان تراکنش",
    "trc20_TxAmount": "مقدار معامله",
    "trc20_TxRecord": "سابقه معامله",
    "trc20_CurOrder": "سفارش فعلی",
    "trc20_TxBuy": "در انتظار خرید",
    "trc20_TxSell": "مقدار مورد نظر برای فروش",
    "trc20_my_transaction": "معامله من",
    "trc20_estimated_cost": "هزینه تخمینی",
    "trc20_estimated_revenue": "درآمد تخمینی",
    "trc20_slightly_cost": "هزینه تخمین زده شده کمی افزایش می یابد و میزان گردش آن بالاتر خواهد بود.",
    "trc20_slightly_revenue": "درآمد تخمین زده شده کمی کاهش پیدا می کند و میزان گردش مالی نیز بالاتر خواهد بود",
    "trc20_accumulative": "مجموع",
    "trc20_buy": "خرید",
    "trc20_sell": "فروش",
    "trc20_balance_tip": "بالانس کافی نیست",
    "trc20_available_balance": "بالانس",
    "trc20_volume": "حجم معاملات",
    "trc20_cancel_order_confirm": "آیا مطمئن هستید که می خواهید این سفارش را لغو کنید؟",
    "trc20_cancel": "بله",
    "trc20_confirm": "خیر",
    "trc20_prompt": "هشدار",
    "trc20_order_success": "ارسال با موفقیت انجام شد",
    "trc20_cancel_order_fail": "ارسال ناموفق بود",
    "trc20_order_fail": "عدم ارسال",
    "trc20_downLoad_wallet1": "لطفا کیف پول را دانلود کنید",
    "trc20_downLoad_wallet2": "معاملات خود را شروع کنید",
    "trc20_login_wallet": "لطفا به حساب کاربری خود برای مرحله بعدی وارد شوید",
    "trc20_cur_order_header_order_time": "زمان",
    "trc20_cur_order_header_order_type": "نوع",
    "trc20_cur_order_header_price": "قیمت",
    "trc20_cur_order_header_amount": "مقدار",
    "trc20_cur_order_header_volume":  "Volume",
    "trc20_cur_order_header_progress": "پیشرفت",
    "trc20_cur_order_header_action": "عملیات",
    "trc20_cur_order_cancel": "لغو",
    "trc20_trans_record_header_block": "ارتفاع بلوک",
    "trc20_trans_record_header_buyAdr": "خریدار",
    "trc20_trans_record_header_sellAdr": "فروشنده",
    "trc20_trans_record_header_amount": "مقدار ",
    "trc20_trans_record_header_time": "زمان",
    "trc20_trans_record_header_price": "قیمت",
    "trc20_my_trans_header_time": "زمان",
    "trc20_my_trans_header_type": "نوع",
    "trc20_my_trans_header_price": "قیمت",
    "trc20_my_trans_header_amount": "مقدار ",
    "trc20_my_trans_header_volume":  "Volume",
    "trc20_my_trans_header_status": "وضعیت",
    "trc20_my_trans_header_detail": "جزئیات",
    "trc20_my_trans_finish": "همه چیز",
    "trc20_my_trans_part": "رسیدگی شد",
    "trc20_my_trans_cancle": "لغو",
    "trc20_my_trans_check": "بررسی",
    "trc20_no_data": "بدون داده",
    "trc20_token_info_Token_Info": "مقدمه",
    "trc20_token_info_Total_Name": "نام",
    "trc20_token_info_Token_Symbol": "نماد توکن",
    "trc20_token_info_Total_Supply": "موجودی",
    "trc20_token_info_Circulating_Supply": "منبع تغذیه",
    "trc20_token_info_Contract_Address": "آدرس قرارداد",
    "trc20_token_info_Website": "وب سایت",
    "trc20_token_info_ths_1": "جفت",
    "trc20_token_info_ths_2": "آخرین قیمت",
    "trc20_token_info_ths_3": "تغییرات در ۲۴ ساعت گذشته ",
    "trc20_token_info_ths_4":  "24h High",
    "trc20_token_info_ths_5":  "24h Low",
    "trc20_token_info_ths_6":  "24h Volume",
    "trc20_token_info_ths_7":  "24h Volume",
    "trc20_new_price": "آخرین قیمت",
    "trc20_exchange_status": "وضعیت جفت معاملاتی",
    "trc20_examine": "بازبینی",
    "trc20_unexamine": "بدون بازبینی",
    "trc20_id":  "ID",
    "trc20_first_token": "اولین توکن",
    "trc20_balance": "بالانس",
    "trc20_second_token": "دومین توکن",


/*
*  2018-12-18
* */
    "create_deal_pair": "ایجاد جفت های معاملاتی",
    "add_deal_pair_desc": "ایجاد جفت معاملاتی در دسترس است",
    "click_create": "برای ایجاد اینجا کلیک کنید",
    "deal_pair_tip": "حداقل ۱۰۰۰۰۰ تی آرکیکس موجودی در بالانس خود ",
    "create_deal_pair_input_tip": "کمتر از ۱۰۰۰۰۰ تی آر ایکس در استخر",
    "create_deal_pair_input_tip2": "پس از ایجاد موفقیت آمیز، قیمت ارائه نمی تواند تغییر یابد، یکی از آثار ۱۰۲۴ تی آر ایکس را می سوزاند",
    "publish_price": "قیمت پیشنهادی شما چیست؟",
    "pool_revert": "تعادل تی آر ایکس در استخر باید حداقل ۱۰۰۰۰۰ باشد",
    "sign_in_with_TRONlink": "TRONLINK",
    "import_a_wallet": "وارد کردن  کیف پول",
    "sign_in_TRONlink_warning": "لطفا TRONlink را نصب کنید و صفحه را رفرش کنید",
    "sign_in_TRONlink": "TRONLINK",
    "uninstall_TRONlink": "ترون لینک هنوز نصب نشده است؟ اینجا کلیک کنید",
    "change_login_method": "ورود به سیستم ترون لینک این عمل را در حال حاضر پشتیبانی نمی کند، لطفا از کلید خصوصی یا فایل کی استور برای ورود به سیستم استفاده کنید.",
    "Create_token_link_message_0": "این توکن تنها در صورتی نمایش داده می شود که پرونده ی ترون اسکن را تایید کرده باشد.",
    "sign_in_TRONlink_warning_0": "لطفا به کیف پول ترون لینک وارد شوید",
    "account_ad": "پیروز شدن با ترون دیس با استفاده از نشانه های تاس .تعهد به تیک زدن هر روزبرای کسب سود سهام تی آر ایکس ",
    "bandwidth_tip": "در ترون، پهنای باند با هر معامله مصرف می شود اما تراکنش ۵۰۰۰ پهنای باند به هر حساب فعال هر روز توسط سیستم داده می شود. کاربران می توانند پهنای باند را با انجماد تی آر ایکس بدست آورند.",
    "energy_tip": "در ترونایجاد و راه اندازی قراردادهای هوشمند انرژی را مصرف می کند. کاربران می توانند انرژی را از طریق انجماد تی آر ایمس به دست آورند.",
    "power_tip": "انرژی ترون برای رای گیری برای سوپرنماینده های ترون استفاده می شود. کاربران می توانند انرژی را از طریق انجماد تی آر ایکس به دست آورند.",
    "token_precision": "صحت توکن",
    "token_precision_message_0": "دقت نشانگر را در صورت نیاز تنظیم کنید، محدوده ۰-۶ است",
    "check_my_token": "بررسی توکن من",
    "totle_transactions_per_day": "مجموع معاملات روزانه",
    "tron_total_transactions_chart": "نمودارقیمت معاملات  ترون ",
    "sign_in_with_ledger": "LEDGER",
    "can_be_unlocked_now": "می تواند باز شود",
    "TRC20_under_maintenance": "TRC20 تحت نگهداری",
    "transaction_fewer_than_100000": " وقتی کمتر از ۱۰۰۰۰۰ ورودی داده های تراکنش وجود دارد، تمام داده ها نمایش داده می شوند.",
    "transaction_more_than_100000": ". وقتی که بیش از ۱۰۰۰۰۰ ورودی داده های تراکنش وجود دارد، داده های ۷روز گذشته نمایش داده خواهد شد.",
    "the_token_wait_few_minutes": "توکن در صفحه حساب در چند دقیقه نمایش داده خواهد شود.",
    "not_login": "وارد سیستم نشده اید",
    "Audit_failed": "بازرسی با موفقیت انجام نشد",
    "Auditing": "بازرسی",
    "Passed_audit": "ممیزی پذیرفته شد",
    "Have_questions": "آیا سوالی در مورد پیشرفت ممیزی توکن وجود دارد؟",
    "Please_contact_us": "لطفا با ما تماس بگیرید",
    "ok_confirm": "OK",
    "high_risk": "ریسک بالا",
    "contract_method": "روش قرارداد",
    "contract_parameters": "پارامترهای روش",
    "energy_fee": "سوزاندن تعدادی تی آرایکس  برای به دست آوردن انرژی",
    "energy_usage": "استفاده از انرژی از انرژی بدست آمده از فریز",
    "energy_usage_total": "هزینه کل انرژی",
    "origin_energy_usage": "استفاده از انرژی از قرارداد ارائه شده",
    "net_fee": "سوزاندن تعدادی تی آر ایکس برای رسیدن به پهنای باند",
    "net_usage": "استفاده از پهنای باند از پهنای باند بدست آمده از فریز",
    "TRC20_transfers": "TRC20 transfers",
    "Basic_info": "اطلاعات پایه",
    "Internal_txns":  "Internal txns",
    "Fee_Consumption": "هزینه مصرف",
    "Method_calling": "روش فراخوانی",
    "SELF_DESTRUCT Contract":  "SELF DESTRUCT Contract",
    "CONTRACT_CREATION": "ایجاد قرارداد",
    "open_ledger": "بازکردن لجر",
    "price_per_1000_btt": "قیمت ۱۰۰۰ بی تی تی",
    "BTT_distribution_overview": "بررسی توزیع بی تی تی",
    "total_BTT_supply": "موجودی کل بی تی تی",
    "BTT_supply": "موجودی بی تی تی",
    "BTT_Token_Release_Schedule": "زمان انتشار توکن بی تی تی",
    "source_btt_team": "منبع: تیم مدیریت بی تی تی",
    "20_transfers": "TRC-20 transfers",
    "internal_transactions": "internal transactions",


    "total_energy_used_chart": "نمودار مصرف انرژی روزانه قرارداد",	
    "total_used_energy": "کل انرژی استفاده شده،",	
    "energy_used_by_freezing_TRX": "انرژی استفاده شده توسط فریز تی آر ایکس",	
    "energy_used_by_burning_TRX": "انرژی استفاده شده توسط سوزاندن تی آر ایکس",	
    "total_energy_used": "کل انرژی مصرف شده",	
    "freezing_energy": "انرژی از تی آر ایکس فریز شده",	
    "burning_energy": "انرژی از تی آر ایکس سوزانده شده",	
    "energy_scale": "نسبت مصرف انرژی",	
    "range": "محدوده",	
	
    "call": "تماس",	
    "caller": "تماس گیرنده",	
    "call_time": "زمان تماس",	
    "call_scale": "	تعداد تماس",
    "call_address_time": "آدرس زمان تماس",	
    "call_address_scale": "آدرس تعداد تماس",	
	
    "contract_call_chart": "جدول وضعیت تماس قرارداد ترون",	
    "call_address_number": "تعداد آدرس ها",
    "contract_call_per_day": "قرارداد تماس در هر روز",	
    "contract_call_chart_day": 'نمودار تماس قرارداد روزانه',	
    "Tron_energy_chart": "مصرف انرژی روزانه ترون",	
    "tron_contract_call_chart": "	نمودار تماس قرارداد روز ترون",
    "day_contract_energy_distribution": "	توزیع انرژی مصرفی روزانه",
    "day_contract_call_distribution": " تماس روزانه",	
	
    "a_total": "مجموع",	
    "with_the_proportion_of": "با نسبت",	
    "uesd_by_the": "	استفاده شده توسط",
    "contracts_from_the_total_used_of": "قرارداد از مجموع استفاده از",	
    "Contract_times_calls": "زمان های تماس قرارداد (مرتب شده بر اساس قرارداد برابر ارزش به ترتیب نزولی)",	

    /*
        ##################################################################################
        #                                                                                #
        # new variables    2019-03-04                                    #
        #                                                                                #
        ##################################################################################
    */
    "table_info_big":"فقط  10،000 صفحه اول نمایش داده می شود",
    "table_info_big_tip1":" داده در طول زمان مشخص شده انتخاب شده ",
    "table_info_big_tip2":"در مجموع، ",
    "table_info_big_tip3":"در حال حاضر تنها 10،000 صفحه نمایش داده می شود.",
    "table_info_big_tip4":" اگر شما می خواهید اطلاعات دیگری را پرس و جو کنید، توصیه می شود که محدوده زمانی را تنظیم کنید.",
    "table_info_account_tip1":"زنجیره اصلی ترون در مجموع ",
    "table_info_account_tip2":"  حساب دارد و در حال حاضر فقط 10،000 صفحه را نشان می دهد (مطابق با تراز ترانس از بزرگ تا کوچک).",
    "Singapore":"Singapore",
    "table_info_new_tip":"در حال حاضر تنها 10،000 قطعه داده اول نمایش داده می شود. اگر شما می خواهید اطلاعات دیگر را جستجوکنید، توصیه می شود که محدوده زمانی را تنظیم کنید.",
    "select_start_time":"لطفا زمان شروع را انتخاب کنید",
    "select_end_time":"لطفا زمان پایان را انتخاب کنید",
    "binance": "binance",

    "EnergyConsume_title": "تاریخ مصرف انرژی روزانه TRON",
    "EnergyConsume_subtitle": "برای بزرگنمایی کلیک کنید و در قسمت نقطه بکشید",
    "EnergyConsume_yaxis": "انرژی",

    "social_link":"لینک های اجتماعی",
    "TRON_ecosystem":"محیط زیست ترون",
    "accunt_ad_tip":"نمایش پروژه TRXMarket LaunchBase ACE فرود سنگین",

    "token_fliter": 'فیلتر توکن',
    "gain": "تغییر (٪)",
    "volume_24_trx": '(24H) جلد',

};
