
export const messages = {
  /*
  ##################################################################################
  #                                                                                #
  #  $$$$$$$$\                                                                     #
  #  \__$$  __|                                                                    #
  #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
  #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
  #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
  #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
  #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
  #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  #         Template for translating the tronscan.org website                      #
  #         Version: 1.6-21072018                                                  #
  #         Update Date: 21.07.2018                                                #
  #         Language: Russian                                                      #
  #         Status: first Version                                                  #
  #         Number of checks: 1                                                    #
  #         Participants: Alex1984                                                 #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  # description and structure of the template                                      #
  #                                                                                #
  # "<name of the variable>": "<corresponding translation>"                        #
  #                                                                                #
  # Note: please concentrate only on the value <corresponding translation>         #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  # global section                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "ok": "ОК",
  "app_title": "Протокол Tron",
  "password": "пароль",
  "money_price": "Денежная Цена",
  "price": "цена",
  "blocks": "Блоки",
  "block": "блок",
  "name": "Имя/Название",
  "website": "Вебсайт",
  "address": "Адресс",
  "sign_out": "выйти",
  "sign_in": "войти",
  "register_login": "Регистрация/Вход",
  "register": "зарегистрироваться",
  "login": "войти",
  "height": "Величина",
  "age": "дата создания",
  "bytes": "Bytes",
  "MByte": "MByte",
  "produced by": "кем Создано",
  "contract": "контракт",
  "from": "кем",
  "to": "кому",
  "value": "Объём",
  "total_accounts": "Всего Аккаунтов (реальное время)",
  "submit": "подтвердить",
  "send": "отправить",
  "receive": "получить",
  "supply": "Количество TRX",
  "view": "Вид",
  "view_all": "посмотреть все",
  "create": "добавить",
  "country": "Страна/Регион",
  "amount": "Сумма",
  "my_vote": "мой голос",
  "submit_votes": "проголосовать",
  "accounts": "Аккаунты",
  "created": "добавлено",
  "exchange": "Обмен",
  "next": "следующий",
  "copied_to_clipboard": "скопировано в буфер",
  "cancel": "Отменить",
  "reset": " Сброс",
  "error": "Ошибка",
  "unlock_keyFile": " Разблокировать Ключевой файл ",
  "enter_password_message": " Необходимо ввести пароль!",
  "password_incorrect": " Неверный Пароль",
  "try_again": "Попробуйте еще раз",
  "wallet_unlocked": " Кошелек Разблокирован",
  "weak": " слабый",
  "okay": "сойдет",
  "good": "хороший",
  "strong": "сложный",
  "secure": "безопасный",
  "too_short": "слишком короткий",
  "status": "статус",
  "no_notifications": "нет уведомлений",
  "enable_desktop_notifications": "Включить Уведомления на Рабочем Столе",
  "desktop_notification_enabled": "Уведомления на Рабочем Столе Включены!",
  "notifications_enabled": "Уведомления  Включены",
  "contract_type": "Тип контракта",
  "filters": "Фильтры",
  "send_tokens": "Отправить токены",
  "desktop_explorer": "Desktop Explorer",
  "message": "Message",
  "wallet_address": "Wallet Address",
  /*
  ##################################################################################
  #                                                                                #
  # navigation section                                                             #
  #                                                                                #
  ##################################################################################
  */
  "blockchain": "Blockchain",
  "wallet": "Кошелек",
  "home": "На главную",
  "transfers": "Переводы",
  "live": "Live",
  "statistics": "Статистика",
  "markets": "Рынки",
  "tools": "Инструменты",
  "transaction_viewer": "Просмотр  транзакций",
  "node_tester": "Тестер Нодов",
  "system": "Система",
  "news": "Новости",
  "help": "Помощь",
  "nodes": "Ноды",
  "votes": "Голоса",
  "account": "Аккаунт",
  "tokens": "Токены",
  "overview": "Обзор",
  "participate": "Участвовать",
  /*
  ##################################################################################
  #                                                                                #
  # home dashboard                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "tron_main_message": "Децентрализируй  Интернет",
  "transactions_last_hour": "Транзакции за прошедший час",
  "block_height": "Последний Блок",
  "online_nodes": "Ноды в сети",
  "pice_per_1000trx": "Цена (за 1000TRX)",
  "vote_for_super_representatives": "Голосовать за Супер Представителей",
  "view_super_representatives": "Посмотреть Супер Представителей",
  "create_new_wallet": "Создать новый кошелек",
  "view_tokens": "Посмотреть токены",
  "transactions_last_day": "Транзакций за прошедший день",
  /*
  ##################################################################################
  #                                                                                #
  # tableinformations and statistics                                               #
  #                                                                                #
  ##################################################################################
  */
  "first_page": "первая страница",
  "previous_page": "предыдущая старница",
  "next_page": "следующая страница",
  "last_page": "последняя страница",
  "page": "страница",
  "of": "из",
  "page_size": "размер страницы",
  "most_nodes": "Большинство Нодов",
  "loading_nodes": "загрузка Нодов",
  "Hostname": " Hostname ",
  "Last Update": "Последнее Обновление ",
  "first_node_sync_message": "Ожидание синхронизации первого нода повторите попытку через несколько минут.",
  "last_block": "последний блок",
  "blocks_produced": "Блоки произведены",
  "blocks_missed": "Пропущенные Блоки",
  "productivity": "производительность",
  "rewards": "получать награды",
  "token_created": "Токен создан",
  "witness": "Свидетель",
  "asset_participation": "Участие в активах",
  "loading_transaction": "Загрузка Транзакции",
  "nodes_ranking": "Рейтинг  Нодов (Рейтинг по странам и регионам)",
  "total_accounts_last_day": " Всего аккаунтов до последнего дня ",
  "chart_tip": "Перетащите область масштабирования данных, чтобы увеличить и уменьшить масштаб",
  "link_test_server": "Testnet",
  "highest": "Наибольший ",
  "lowest": "низший ",
  "increase": "увеличение ",
  "number": "номер ",
  "_of": "из",
  "was_recorded_on": "было записано в",
  "rank_real_time": "Rank (Real time)",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain - statistics                                                        #
  #                                                                                #
  ##################################################################################
  */
  "addresses": "адресы",
  "trx_transferred_past_hour": "TRX переведено за последний час ",
  "transactions_past_hour": "Транзакции за последний час",
  "average_blocksize": "Средний размер блока",
  "rich_list": "Список богатых",
  "tron_transaction_chart": "Диаграмма транзакций Tron",
  "transactions_per_day": "Транзакций в день",
  /*
  ##################################################################################
  #                                                                                #
  # account section                                                                #
  #                                                                                #
  ##################################################################################
  */
  "set_name": "Укажите имя",
  "unique_account_message": " Вы можете указать имя учетной записи только один раз!",
  "name_to_short": "Имя короткое",
  "name_to_long": "Имя длинное",
  "permitted_characters_message": "Им я может содержать только a-z A-Z 0-9",
  "change_name": "Сменить Имя",
  "account_name": "Имя пользователя",
  "show_qr_code": "Показать QR-код",
  "do_not_send_2": "Не отправляйте TRX из своего собственного кошелька или обменивайте на указанный адрес учетной записи в Testnet!",
  "bandwidth": "пропускная способность",
  "balance": "баланс",
  "tron_power": "Энергия Tron",
  "transactions": "транзакции",
  "no_transfers": "Нет Переводов",
  "no_tokens": "Нет Токенов",
  "free_bandwidth": "Свободная пропускная способность",
  "expires": "истекает",
  "have_been_added_to_your_account": "были добавлены в ваш аккаунт!",
  "information_message_1": "Mainnet не может запросить тестирование trx, пожалуйста, свяжитесь с Tron, чтобы получить тестовый trx",
  "information_message_2": "Вы можете запросить TRX только 10 раз за аккаунт.",
  "request_trx_for_testing": "Запросить TRX для тестирования",
  "token_balances": "Баланс токена",
  "produced_blocks": "произведено блоков",
  "voters": "голосующие",
  "progress": "прогресс",
  "transactions_count": "{transactions, plural, оne {transaction} other {transactions}}",
  "issuer": "эмитент",
  "network": "сеть",
  "current": "текущий",
  "trx_received": "TRX получено",
  "test_trx_temporarily_unavailable_message": "Тест TRX  временно не доступен. Пожалуйста, повторите попытку позже.",
  "not_enough_trx": "Не достаточно TRX",
  "information_message_3": "Успешно запрошен TRX. Если вы не получили TRX, то сейчас нет TRX для теста TRX, и вы должны попробовать снова в более позднее время.",
  "send_to_following_address": "Отправьте по следующему адресу",
  "change_website": "Изменить сайт",
  "you_must_enter_url": "Вы должны ввести URL-адрес",
  "specify_the_url": "Укажите URL-адрес",
  /*
  ##################################################################################
  #                                                                                #
  # account freeze                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "freeze": "заморозить",
  "unfreeze": "разморозить",
  "freeze_trx_least": "Вам нужно как минимум 1 TRX для замораживания",
  "unable_unfreeze_trx_message": "Невозможно разморозить TRX. Это может быть вызвано тем, что минимальный период замораживания еще не достигнут.",
  "freeze_trx_premessage_0": `TRX можно заморозить, чтобы получить энергию Tronа и включить дополнительные функции.
    Например, с помощью энергии Trona вы можете `,
  "freeze_trx_premessage_link": "голосовать за супер представителей.",
  "freeze_trx_premessage_1": `Замороженные токены «заблокированы» на 3 дня. В течение этого периода замороженным TRX нельзя торговать.
    После этого периода вы можете разморозить TRX и обменять токены.`,
  "trx_amount": "Сумма TRX",
  "token_freeze_confirm_message_0": "Я подтверждаю замораживание",
  "token_freeze_confirm_message_1": "не менее  3 дней",
  "frozen_supply": "Замороженный объем",
  "tokens_unfrozen": "Токенов  разморожено",
  "success_tokens_unfrozen_message": "токены успешно разморожены",
  "unable_to_unfreeze": "Невозможно разморозить",
  "Unable_tokens_unfrozen_message": "Невозможно разморозить токены.",
  "tokens_frozen": "Замороженные токены",
  "successfully_frozen": "Успешно замороженные",
  "name_changed": "Имя изменено",
  "successfully_changed_name_to_message": "Имя успешно и зменено на",
  "unable_to_rename_title": "Не удалось переименовать",
  "unable_to_rename_message": "При обновлении имени вашей учетной записи что-то пошло не так, повторите попытку позже",
  "unfreeze_trx_confirm_message": "Вы уверены, что хотите разморозить TRX?",
  "unfreeze_assets": "Разморозить Активы",
  "sure_to_unfreeze_unlocked_tokens_message": "Вы уверены что хотите разморозить разблокированные токены?",
  /*
  ##################################################################################
  #                                                                                #
  # account superdelegates                                                          #
  #                                                                                #
  ##################################################################################
  */
  "apply_for_delegate": "подать заявку на делегирование",
  "apply_super_representative_candidate": " Подать заявку на кандидата супер представителя",
  "your_personal_website_address": " адрес вашего персонального сайта",
  "apply_for_delegate_predescription": "Каждый владелец токена имеет возможность стать супер представителем TRON.Тем не менее, чтобы сеть и сообщество работали более плавно и эффективно, мы создали набор стандартов и правил для подходящих кандидатов, чтобы стать рекомендованными супер-представителями. Мы будем продвигать рекомендованные Супер Представители, чтобы увеличить их шансы быть избранными. Новые Рекомендуемые супер-представители обновляются и публикуются раз в неделю.",
  "apply_for_delegate_description": `Все держатели токенов могут подать заявку на получение статуса супер представителя (SR), нажав на страницу учетной записи; они также могут голосовать за кандидатов, нажав на страницу голосов. Каждый пользователь может голосовать за нескольких кандидатов, при этом количество голосов меньше или равно количеству TRX, которое они держат. Результаты голосования основываются на последнем туре голосования каждого пользователя. Количество голосов будет обновляться в 02: 00 (GMT+8),08:00(GMT+8),14:00(GMT+8), 20:00(GMT+8) каждый день; пользователи также могут просматривать номера голосования в режиме реального времени. Лучшие 27 наиболее проголосовавших кандидатов станут SRs и будут отвечать за упаковку транзакций и генерацию блоков с вознаграждением 32 TRX за поколение блоков. 27 SRs и 100 лучших кандидатов SR также могут получать награды узлов на основе голосов, которые они получают. Единовременная плата за транзакцию в размере 9999 TRX будет вычтена для того, чтобы заявка стала кандидатом. Это не будет стоить каких-либо TRX для пользователей, чтобы голосовать за кандидатов SR.`,
  "unknown_error": " произошла неизвестная ошибка",
  "representative_understand": " Я понимаю, как быть представителем TRON",
  "generate_account": " Нажмите, чтобы создать адрес учетной записи и пароль",
  "create_account_confirm_1": " Я понимаю, что если я забуду / потеряю свой пароль, я никогда не смогу получить доступ к своим активам",
  "create_account_confirm_2": " Я понимаю, что если я забуду/потеряю пароль, никто не сможет помочь мне восстановить его",
  "create_account_confirm_3": "Я написал свой пароль на бумажке",
  "vote_thanks": " Спасибо за отправку Вашего голоса!",
  "recent_transactions": "последние операции",
  "newest_account": " новая учетная запись",
  "representatives": "представители",
  "most_votes": "большинство голосов",
  "start_end_time": " Время Начала / Окончания ",
  "scan_qr_code": " Сканируйте код сканером QR-кодов ",
  "receive_trx": "получить TRX",
  "require_account_to_send": " Для отправки монет необходимо войти в систему",
  "require_account_to_receive": " Вы должны войти в систему, чтобы получить монеты",
  "successful_send": "Успешно отправлено!",
  "confirm_transaction": "подтвердить транзакцию",
  "last_confirmed": "Последнее Подтверждение",
  "trx_produced": "Произведенные транзакции",
  "do_not_send_1": " Не отправляйте TRX со своего кошелька или не обменивайте на свой адрес в Testnet!",
  "go_to_votelist": " Перейти к списку голосов",
  "understand_tron_sr_message_0": " Я понимаю, как быть представителем TRON, и я подтверждаю, перевод ",
  "understand_tron_sr_message_1": "комиссия.",
  "invalid_url": " Неверный URL-адрес",
  "apply_representative_error_message_0": " Что-то пошло не так, пытаясь подать заявку на представителя.",
  "apply_representative_error_message_1": " Убедитесь, что у вас достаточно TRX для оплаты, или повторите попытку позже.",
  "open_external_link": " Вы открываете внешнюю ссылку",
  "private_key_untrusted_website_message_0": " Никогда не вводите свой личный ключ на не надежном  веб-сайте.",
  "no_official_tron_website": " не является официальным сайтом Tron.",
  "continue_to_external_website": "Перейти на внешний сайт",
  "url_changed": "URL-адрес изменился",
  "successfully_changed_website_message": "Успешно изменен сайт на",
  "unable_to_change_website_title": "Не возможно изменить URL",
  "unable_to_change_website_message": " Что-то пошло не так при обновлении веб-сайта, пожалуйста, повторите попытку позже",
  "successfully_linked_github": "Успешно связан с Github!",
  "github_linked": "Github привязан!",
  "unable_to_link_github_message": "Не удалось создать ссылку на Github, убедитесь, что имя пользователя правильное!",
  "could_not_link_github": "Не удалось привязать Github",
  "enter_your_github_username": " Введите имя пользователя Github",
  "link_to_github": "Ссылка на Github",
  "link_github": "Ссылка На Github",
  "you_must_enter_a_url": "Необходимо ввести URL-адрес",
  "success": "Успешно",
  "successfully_appied_sr_canidate_message_0": "Успешно подана заявка в кандидаты на супер представителя ",
  "successfully_appied_sr_canidate_message_1": " Ваша учетная запись будет обновлена в ближайшее время",
  "landing_page": "главная страница ",
  "show_more_information_publish_sr_page": " Показать дополнительные сведения о публикации страницы",
  "create_sr_landing_page_message_0": "Супер-представители могут создать главную страницу, на которой они могут поделиться дополнительной информацией о своей команде и планах",
  "set_github_url_message_0": " Вы уже настроили шаблон Github? Затем установите URL с помощью кнопки ниже",
  "set_github_link": " Установить Ссылку На Github",
  "could_not_claim_rewards": " Не удалось получить награды",
  "claim_rewards_error_message": " Что-то пошло не так, пытаясь претендовать на награды, пожалуйста, повторите попытку позже.",
  "rewards_claimed": "Заявленные Награды!",
  "successfully_claimed_rewards": " Успешно заявленные награды",
  "claim_rewards": "получить Награды",
  "sr_receive_reward_message_0": " В качестве представителя вы получаете награды за производство блоков. Эти награды можно получить каждые 24 часа",
  "intro": " Вступление",
  "budget_expenses": "Бюджетные расходы ",
  "server_configuration": "Конфигурация сервера ",
  "community_plan": "План сообщества",
  "team": "Команда",
  /*
  ##################################################################################
  #                                                                                #
  # token creation formular                                                        #
  #                                                                                #
  ##################################################################################
  */
  "name_of_the_token": "название  токена",
  "token_message": "название  для токена",
  "token_abbr": "Аббревиатура токена",
  "abbr_message": "Аббревиатура для токена",
  "total_supply": "общий запас",
  "issued_token": "выпущенный токен",
  "create_token": "Создать Токен",
  "description": "Описание",
  "description_url": "Описание URL",
  "quote_token_amount": " Изначальное количество токенов",
  "base_token_amount": "Базовое количество токенов",
  "creating_a_token": "Создание токена",
  "available": "доступно",
  "testnet": "Testnet",
  "days_to_freeze": "Дней до заморозки",
  "trx_token_fee_message": "1024 TRX требуется для выпуска нового токена",
  "trx_token_account_limit": " Вы можете создать только один токен на аккаунт",
  "trx_token_wallet_requirement": " Для создания токена необходимо открыть кошелек",
  "invalid_address": "Неверный адресс",
  "insufficient_tokens": "Недостаточно токенов",
  "fill_a_valid_number": " Пожалуйста, введите правильный номер",
  "fill_a_valid_address": " Пожалуйста, введите правильный адрес",
  "make_another_transaction": "Сделать еще одну транзакцию",
  "token_exchange_confirm": " Я подверждаю, что за Преобретение {Сумму TRX} оплачиваю токенами, и получаю за это {Сумму  TRX} токены.",
  "An_unknown_error_occurred,_please_try_again_in_a_few_minutes": " Произошла неизвестная ошибка, повторите попытку через несколько минут",
  "An_error_occurred": "Произошла ошибка",
  "create_a_token": "Создание токена",
  "not_started_yet": "Еще не запущен",
  "participated": "Вы успешно участвовали!",
  "participated_error": "Произошла ошибка",
  /*
  ##################################################################################
  #                                                                                #
  # token participate                                                              #
  #                                                                                #
  ##################################################################################
  */
  "buy_confirm_message_0": "Вы уверены?",
  "how_much_buy_message": " Сколько токенов вы хотите купить?",
  "buy_confirm_message_1": " Вы уверены, что хотите купить",
  "for": "для",
  "insufficient_trx": "Недостаточно TRX",
  "not_enouth_trx_message": " У Вас недостаточно TRX, чтобы купить так много токенов",
  "ends": "конец",
  "starts": "начать",
  "can_be_unlocked_in": "может быть разблокирована в",
  /*
  ##################################################################################
  #                                                                                #
  # global messages                                                                #
  #                                                                                #
  ##################################################################################
  */
  "address_warning": " Введите только действительный адрес Кошелька TRON. Неправильные адреса могут привести к потере TRX.",
  "search_address_or_url": " Поиск адреса или URL",
  "the_lunch_test": " Запуск Testnet направлен на тестирование всех функций нашего блокчейн-проводника и кошелька",
  "please_keep_in_mind": " Пожалуйста, имейте в виду, что, так как ваш зарегистрированный адрес используется только для Testnet, не отправляйте TRX с вашего собственного кошелька или биржи на адрес учетной записи Testnet.",
  "tron_foundation": "TRON Foundation",
  "trx_for_testing": "TRX для тестирования будет отправлен на Ваш тестовый аккаунт, как только вы успешно подадите заявку  через управление аккаунтом.",
  "dear_users": " Уважаемый пользователь,",
  "finished": "Завершено",
  "token": "Токен",
  "url": "URL-адрес ",
  "need_to_login": " Вы должны войти в систему, чтобы получить доступ к странице учетной записи",
  "thanks_for_applying": " Спасибо за участие!",
  "to_much_votes": "вы отдали очень  много голосов",
  "no_trx_remaining": "TRX не осталось",
  "produced_by": "Произведенно {Адресс)",
  "show_more": "Показать {список стран} Больше",
  "vote_guide_message": `Используйте TRX для голосования за супер представителей.
   Для каждого TRX ,в вашем аккаунте,  у вас есть один голос, чтобы проголосовать.
   TRX не будет тратиться. Вы можете голосовать за нескольких представителей сколько угодно раз.
   Количество голосов будет обновляться 02:00,08:00,14:00,20:00(по Гринвичу+8）каждый день и список делегатов будет обновляться.`,
  "search_address": "Поиск адреса",
  "token_transactions": "Транзакции токена",
  "token_holders": "Держатели токена",
  "nr_of_Transfers": " Количество переводов",
  "not_signed_in": " Для использования этой функции необходимо войти в систему",
  "loading_map": " Загрузка Карты",
  "loading_accounts": "Загрузка аккаунтов",
  "quantity": " количество",
  "percentage": " Процент",
  "loading_token": " Загрузка токена",
  "voter_percentage": "Процент голосов",
  /*
  ##################################################################################
  #                                                                                #
  # transaction information                                                        #
  #                                                                                #
  ##################################################################################
  */
  "no_transactions_found": "Транзакции не найдены",
  "no_tokens_found": "Токены не найдены",
  "no_blocks_found": " Блоки не найдены",
  "no_votes_found": " Голосов не найдено",
  "no_voters_found": " Избирателей не найдено",
  "waiting_for_transactions": "Ожидание транзакции",
  "loading_address": "Загрузка адреса",
  /*
  ##################################################################################
  #                                                                                #
  # token creation - default messages                                              #
  #                                                                                #
  ##################################################################################
  */
  "details": "подробная информация",
  "issue_a_token": "выпустить токен",
  "issue_token": "Выпуск токена",
  "token_name": "Название токена",
  "total_issued": " Общая сумма выпуска",
  "registered": "Зарегистрирован",
  "abbreviation": "Аббревиатура",
  "exchange_rate": "Обменный курс",
  "token_price": " Цена Токена",
  "supply_message": " Общее количество токенов, которые будут находиться в обращении",
  "description_message": " Краткое описание назначения токена",
  "url_message": " Веб-сайт, на котором пользователи могут найти дополнительные сведения о токене",
  "exchange_rate_message_0": " Укажите цену одного токена, определив, сколько токенов участник получит за каждый потраченный TRX.",
  "exchange_rate_message_1": "Участники получат",
  "exchange_rate_message_2": "для каждого",
  "exchange_rate_message_3": "TRX",
  "participation_message_0": " Укажите период участия, в течение которого будут выпущены токены. В период участия пользователи могут обменять TRX на",
  "participation_message_1": " токены.",
  "frozen_supply_message_0": "Часть поставок может быть заморожена. Объем поставки может быть указан и должен быть заморожен  минимум на 1 день. Замороженную поставку можно вручную разморозить после даты начала + дни заморозки были достигнуты. Заморозка поставки необходима.",
  "token_issued_successfully": "Токен успешно выдан",
  "participation": "участие",
  "start_date": "дата начала",
  "end_date": " дата окончания",
  "token_spend_confirm": " Я подтверждаю, что создание общей поставки токена стоит единовременной общей платы в размере 1024 TRX.",
  "token_issue_guide_message_1": ` Выдача токена по протоколу Tron может быть выполнена Кем-либо , кто имеет на своем счете  хотя бы 1024TRX.`,
  "token_issue_guide_message_2": ` Когда токен выпущен, он будет показан на странице обзора токена. Затем пользователи могут участвовать в период участия и обмена TRX для токенов`,
  "token_issue_guide_message_3": `После выпуска токена на ваш счет поступит количество токенов равное общему запасу.
    Когда другие пользователи обменивают свои TRX на токены, токены будут сняты с вашего счета, и вы  получите число TRX по указанному курсу.`,
  /*
  ##################################################################################
  #                                                                                #
  # token creation - error messages                                                #
  #                                                                                #
  ##################################################################################
  */
  "date_error": " Дата окончания является очень ранней или совпадает с датой начала",
  "no_name_error": "Требуется имя",
  "no_supply_error": " Общий запас должен быть не менее 1",
  "coin_value_error": " Количество токенов должно быть не менее 1",
  "tron_value_error": " Количество TRX на монету должно быть не менее 1",
  "invalid_starttime_error": " Указана недопустимая Дата начала",
  "invalid_endtime_error": " Указана недопустимая Дата окончания",
  "no_description_error": " Требуется Описание",
  "no_url_error": " Требуется URL -Адрес",
  "past_starttime_error": " Дата начала в прошлом",
  "no_transactions": "Нет  Транзакций",
  "errors_in_form": "Есть ошибки в форме",
  "token_link_message_0": "Токен будет доступен на",
  "token_link_message_1": "Страница токенов",
  "token_link_message_2": " через несколько минут",
  "description_error_message_0": " Длина описания не должна превышать 200 символов",
  "token_creation_error": " Произошла ошибка при попытке создать токен",
  "tokenname_error_message_0": " Длина имени не должна превышать 32 символа",
  "tokenname_error_message_1": " Имя может содержать только символы A-Z",
  "abbreviation_required": " Аббревиатура обязательна",
  "abbreviation_error_message_0": " Аббревиатура не может быть длиннее 5 символов",
  "abbreviation_error_message_1": " Аббревиатура может содержать только символы A-Z",
  /*
  ##################################################################################
  #                                                                                #
  # representatives section                                                        #
  #                                                                                #
  ##################################################################################
  */
  "highest_productivity": "Более высокая продуктивность",
  "lowest_productivity": "Более низкая продуктивность",
  "Super Representatives": "Супер Представители",
  "Super Representative Candidates": "Кандидаты в суперпредставителей",
  "loading_representatives": "Загрузка представителей",
  "address_not_super_representative": " Этот адрес не является супер представителем",
  "unable_load_representatives_page_message": " Не удается загрузить страницу, это может произойти, если адрес является недопустимым, адрес не является представителем или представитель еще не настроил эту страницу",
  "loading_representative": "Загрузка представителя",
  /*
  ##################################################################################
  #                                                                                #
  # markets section                                                                #
  #                                                                                #
  ##################################################################################
  */
  "average_price_usd": "Средняя цена в USD",
  "average_volume_usd": "Средний объем в USD",
  "Trade Volume": "Объем торговли в USD",
  "rank": "Ранг",
  "pair": "Пара",
  "volume": "Объем",
  "usd": "USD",
  "average_price": "Средняя цена",
  "click_the_chart_title_to_find_more": " Нажмите на заголовок диаграммы, чтобы узнать больше.",
  /*
  ##################################################################################
  #                                                                                #
  # votes section                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "next_round": "Следующий раунд",
  "total_votes": "Всего голосов",
  "most_ranks": "Наибольший прирост рейтинга в этом раунде",
  "view_live_ranking": "Посмотреть живой рейтинг",
  "open_team_page": "Открыть страницу команды",
  "warning_votes": " Для начала голосования требуется не менее 1 трона. Мощь Tron получают путем замораживания TRX на ",
  "account_page": "Страница аккаунта",
  "loading_votes": "Загрузка голосов",
  "3_day_ranking": "Рейтинг за 3 Дня (Топ 10)",
  "live_ranking": "Живой рейтинг",
  "live_ranking_msg": " Обновляется каждые 15 секунд. Подсчет новых голосов может занять до 1-2 минут",
  "candidate": "Кандидат",
  "current_votes": "Текущие голоса",
  "click_to_start_voting": "Нажмите здесь ,чтоб голосовать",
  "votes_remaining_message": "Оставшиеся  Голоса",
  "open_wallet_start_voting_message": " Открыть Кошелек для начала голосования",
  "thanks_submitting_vote_message": " Спасибо за отправку Вашего голоса!",
  "need_min_trx_to_vote_message": "Вам нужно по крайней мере 1 TRX, чтобы иметь возможность голосовать",
  "to_much_votes_massage": "Вы тратите много голосов!",
  "all_votes_are_used_message": "Все голоса используются!",
  "submissing_vote_message_title": "Спасибо за голосование!",
  "submissing_vote_message_0": " Ваши голоса успешно отданы, они вступят в силу, когда начнется следующий цикл голосования.",
  "submissing_vote_message_1": " Вы можете перераспределять свои голоса в любое время",
  "submitting_vote_error_message": " Что-то пошло не так при подаче голосов. Повторите попытку позже.",
  "loading_super_representatives": "Загрузка Супер Представителей",
  /*
  ##################################################################################
  #                                                                                #
  # transaction Viewer                                                             #
  #                                                                                #
  ##################################################################################
  */
  "info_tx_viewer": " Здесь можно вставить шестнадцатеричный код транзакции, чтобы проверить содержимое транзакции. Затем транзакция может быть передана в сеть",
  "load_tx": "Загрузить транзакцию",
  "tx_qrcode": "QR-код транзакции",
  "load_tx_qrcode": " Загрузить транзакцию из QR-кода",
  "transaction_load_error": "Ошибка загрузки транзакции",
  "transaction_load_error_message": " Что-то пошло не так при попытке загрузить транзакцию Убедитесь, что шестнадцатеричный код имеет правильный формат ",
  "transaction_success_message": "Транзакция успешно отправлена в сеть",
  "transaction_success": "Транзакция успешно проведена",
  "transaction_error_message": "Что-то пошло не так при попытке отправить ",
  "transaction_error": " Ошибка Транзакции",
  "confirm_transaction_message": " Вы уверены, что хотите совершить транзакцию?",
  "broadcast_transaction_to_network": "совершить транзакцию в сеть",
  /*
  ##################################################################################
  #                                                                                #
  # tools node tester                                                              #
  #                                                                                #
  ##################################################################################
  */
  "node_tester_msg": "Введите IP-адрес узла для проверки соединения GRPC",
  "node_tester_stop": " Остановить тестирование",
  "node_tester_test": "Тестирование GRPC",
  "node_tester_rt": "Время отклика",
  "confirmed_block": "Подтвержденный блок",
  "loading": "загрузка...",
  "connection_node": "Connecting to Node",
  /*
  ##################################################################################
  #                                                                                #
  # tools scanner                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "no_webcam_found": " Веб-камера не найдена",
  "trying_enable_webcam_message_0": " Ошибка при попытке включить веб камеру.",
  "trying_enable_webcam_message_1": " Убедитесь, что разрешения камеры включены.",
  /*
  ##################################################################################
  #                                                                                #
  # help section                                                                   #
  #                                                                                #
  ##################################################################################
  */
  "what_is_tron": "Что такое TRON",
  "tron_explorer_api": "Tron эксплорер API",
  "tron_architechure": "Архитектура TRON ",
  "tron_protobuf_doc": "Документация Буферного протокола TRON ",
  "report_an_error": " Отправить сообщение об ошибке / предложение ",
  "frequently_asked_questions": "Часто задаваемые вопросы",
  "telegram_updates": "После Обновления",
  /*
  ##################################################################################
  #                                                                                #
  # wallet section                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "open_wallet": "Открыть кошелек",
  "private_key": "Приватный ключ",
  "keystore_file": "Файл хранилища ключей",
  "select_file": "Выберите файл",
  "login_mobile": " Вход с мобильного устройства",
  "create_wallet": "Создать кошелек",
  "no_open_wallet": " Нет открытого Кошелька для просмотра ",
  "new_wallet": "Новый кошелек",
  "password_encr_key_message_0": "Этот пароль шифрует ваш секретный ключ. Это не действует как генерация ключей.",
  "password_encr_key_message_1": " Вам понадобится этот пароль и ваш личный ключ, чтобы разблокировать кошелек.",
  "strong_password_info": " Требуется надежный пароль ",
  "save_keystore_file": "Сохраните ваш файл хранилища ключа",
  "download_keystore_file": "Скачать Зашифрованный Ключ",
  "do_not_lose_it": "Не теряйте его!",
  "do_not_lose_it_message_0": " Tron Foundation не может помочь восстановить потерянный ключ.",
  "do_not_share_it": "Не делитесь им ни с кем!",
  "do_not_share_it_message_0": " Ваши средства могут быть украдены, если вы используете этот вредоносный файл, сайт.",
  "make_a_backup": "Сделайте резервную копию!",
  "make_a_backup_message_0": "На случай если ваш ноутбук сгорит.",
  "save_private_key": "Сохраните ваш приватный ключ",
  "print_paper_wallet": "Распечатайте на бумаге ваш кошелек",
  "new_wallet_ready_message": "Ваш новый кошелек готов",
  "go_to_account_page": "Перейти на страницу аккаунта",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain block                                                                #
  #                                                                                #
  ##################################################################################
  */
  "hash": "hash",
  "time": "Время",
  "parenthash": " Parenthash",
  "size": "Размер",
  "blockchain_size": "Размер блокировки",
  /*
  ##################################################################################
  #                                                                                #
  # ledger help page                                                               #
  #                                                                                #
  ##################################################################################
  */
  "ledger_guide": " руководтсво  к Ledger ",
  "requirements": "Требования",
  "using_ledger_steps_message_0": "Использование Ledger с Tronscan требует следующих шагов:",
  "a": "A",
  "install_the": "Установить ",
  "app": "приложение",
  "install_latest_version_message_0": "Установите последнюю версию",
  "opening_your_wallet": "Откройте ваш кошелек",
  "open_the_tronscan_desktop_client": "Откройте Tronscan клиент на рабочем столе",
  "click_open_wallet_top_right": "Нажмите 'Открыть кошелек' в правом верхнем углу",
  "choose_ledger": "Выберите Ledger",
  "connect_unlock_ledger_with_pin": "Откройте и разблокируйте ваш девайс с PIN кодом",
  "open_tron_app_on_ledger": "Откройте Tron приложение на вашем Ledger",
  "ledger_connected_tronscan_message_0": "Если ваш Ledger подключен правильно тогда Tronscan покажет 'Подключено'",
  "click_on_open_wallet": "Нажмите 'Открыть кошелек' в правом верхнем углу",
  "redirect_to_your_wallet_message": " Вы будете перенаправлены на Ваш кошелек, и вы сможете просмотреть свой адрес Tron",
  "using_ledger_to_sign_transactions": "Используйте ledger чтобы произвести транзакций",
  "using_ledger_to_sign_transactions_message_0": "Убедитесь, что Ledger подключен и приложение Tron  открыто, чтобы произвести транзакцию используйте Ledger когда используете Tronscan на рабочем столе",
  "using_ledger_to_sign_transactions_message_1": "Tronscan покажет всплывающее окно с деталями транзакции ,когда вы голосуете, отправляете TRX, меняете имя учетной записи и т. д.. ",
  /*
  ##################################################################################
  #                                                                                #
  # userinfo - popup notification                                                  #
  #                                                                                #
  ##################################################################################
  */
  "record_not_found": "запись не найдена!",
  "warning": "Предупреждение",
  "login_success": "Успех в Интернете",
  "logout_success": "Выход из системы",
  /*
  ##################################################################################
  #                                                                                #
  # new variables                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "date": "Дата",
  "total_transactions": "Всего транзакций ",
  "avg_blockTime": "Среднее время блока ",
  "avg_blockSize": "Средний размер блока",
  "total_BlockCount": "Всего BlockCount",
  "new_address_seen": "Новый адрес",
  "transfer_contract": "Трансфер контракта",
  "TRX_transfer_between_addresses": "TRX трансфер между адресами",
  "transfer_asset_contract": "Трансфер контракта на активы",
  "token_transfer_between_addresses": "Трансфер токена между адресами",
  "participate_asset_issue_contract": " Участвовать в контракте на выдачу актива",
  "participate_token_between_addresses": "Участие токена между адресами",
  "witness_update_contract": "Контракт обновления свидетеля",
  "updates_a_witness": "Обновить свидетеля",
  "witness_create_contract": "Создать контракт свидетеля",
  "create_a_witness": "Создать свидетеля",
  "account_update_contract": "Контракт обновления аккаунта",
  "update_account_name": "Обновить имя аккаунта",
  "withdraw_balance_contract": "Вывести баланс контракта",
  "withdraw_balance": "Вывести баланс",
  "freeze_balance_contract": "Заморозить баланс контракта",
  "freeze_TRX": "Заморозить TRX",
  "unfreeze_balance_contract": "Разморозить баланс контраткта",
  "unfreeze_TRX": "Разморозоить TRX",
  "vote_witness_contract": "Голосовать за контракт свидетеля",
  "vote_for_a_witness": " Голосовать за свидетеля ",
  "asset_issue_contract": "Контракт на выпуск активов ",
  "issue_a_new_asset": " Выпуск нового актива ",
  "owner_address": "Адрес владельца ",
  "frozen_balance": "Замороженный баланс",
  "frozen_days": "Замороженные дни",
  "counts": "счет",
  "TRX_exchange_rate": "TRX обменный курс",
  "start_time": "Время начала",
  "end_time": "Время окончания",
  "contracts": "Контракты",
  "search_description": "Поиск адреса, Номер кадра, транзакция Hash ,название токена",
  "search_description1": "Поиск адреса ,блока, транзакции, токена",
  "transaction": "Транзакция",
  "total_addresses": "Всего адресов",
  "daily_increment": "Дневной прирост",
  "address_growth_chart": "Диаграмма прироста адресов",
  "addresses_amount": "Количество адресов",
  "past_14_days_of_transactions": "Транзакции за последние 14 дней",
  "address_growth": "Прирост адресов",
  "power": "Мощь",
  "token_transfers": "Трансфер токена",
  "website_url": "Ссылка на сайт",
  "search": "Поиск"

};
