export const messages = {
  /*
  ##################################################################################
  #                                                                                #
  #  $$$$$$$$\                                                                     #
  #  \__$$  __|                                                                    #
  #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
  #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
  #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
  #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
  #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
  #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  #         Template for translating the tronscan.org website                      #
  #         Version: 1.6-13082018                                                  #
  #         Update Date: 13.08.2018                                                #
  #         Language: Russian 俄语                                                      #
  #         Status: Approved Version                                               #
  #         Number of checks: 4                                                    #
  #         Participants: Rovak,PMD3VSolution,DrKaradenizli                        #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  # description and structure of the template                                      #
  #                                                                                #
  # "<name of the variable>": "<corresponding translation>"                        #
  #                                                                                #
  # Note: please concentrate only on the value <corresponding translation>         #
  #                                                                                #
  ##################################################################################
  #                                                                                #
  # global section                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "ok": "OK",
  "app_title": "Протокол TRON",
  "password": "Пароль",
  "money_price": "Цена",
  "price": "Цена",
  "blocks": "блоки",
  "block": "блок",
  "name": "название",
  "website": "Веб-сайт",
  "address": "Адрес",
  "sign_out": "выход",
  "sign_in": "вход",
  "register_login": "Зарегистрироваться / Войти",
  "register": "зарегистрироваться",
  "login": "авторизоваться",
  "height": "высота",
  "age": "возраст",
  "bytes": "Байт",
  "MByte": "МБайт",
  "produced_by": "произведено",
  "block_reward": "Вознаграждение за блок",
  "contract": "Контракт",
  "from": "от",
  "to": "к",
  "value": "сумма",
  "total_accounts": "Всего аккаунтов",
  "submit": "Отправить",
  "send": "отправить",
  "receive": "получать",
  "supply": "Доля TRX",
  "view": "посмотреть",
  "view_all": "Посмотреть все",
  "create": "создать",
  "country": "страна",
  "amount": "Количество",
  "my_vote": "мой голос",
  "submit_votes": "подтвердить голоса",
  "accounts": "учетные записи",
  "created": "создано",
  "exchange": "Биржа",
  "next": "следующий",
  "copied_to_clipboard": "Скопировано в буфер обмена",
  "cancel": "Отмена",
  "reset": "Сбросить",
  "error": "Ошибка",
  "unlock_keyFile": "Разблокировать ключевой файл",
  "enter_password_message": "Вы должны ввести свой пароль!",
  "password_incorrect": "Неверный пароль",
  "try_again": "Попробуйте снова",
  "wallet_unlocked": "Кошелек разблокирован",
  "weak": "коротко",
  "okay": "окей",
  "good": "хорошо",
  "strong": "сильный",
  "secure": "безопасный",
  "too_short": "слишком коротко",
  "status": "статус",
  "no_notifications": "Нет уведомлений",
  "enable_desktop_notifications": "Включить уведомления на рабочем столе",
  "desktop_notification_enabled": "Уведомления на рабочем столе включены!",
  "notifications_enabled": "Уведомления включены",
  "contract_type": "Тип контракта",
  "filters": "Фильтры",
  "send_tokens": "Отправить токены",
  "desktop_explorer": "Эксплорер для рабочего стола",
  "message": "Сообщение",
  "wallet_address": "Адрес кошелька",
  "confirm": "Подтвердить",
  "_percentage": "Процент",
  "language_support": "В настоящее время поддерживается только английский ввод",
  "note": "Заметка",
  /*
  ##################################################################################
  #                                                                                #
  # navigation section                                                             #
  #                                                                                #
  ##################################################################################
  */
  "blockchain": "Блокчейн",
  "wallet": "Кошелек",
  "home": "Главная",
  "transfers": "Переводы",
  "live": "В реальном времени",
  "statistics": "Статистика",
  "markets": "Рынки",
  "tools": "Инструменты",
  "transaction_viewer": "Просмотр транзакций",
  "node_tester": "Тест узлов",
  "system": "Система",
  "news": "Новости",
  "help": "Помощь",
  "nodes": "Узлы",
  "votes": "Голоса",
  "account": "Учетная запись",
  "tokens": "Токены",
  "overview": "Обзор",
  "participate": "Участвовать",
  /*
  ##################################################################################
  #                                                                                #
  # home dashboard                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "tron_main_message": "Децентрализация Интернета",
  "transactions_last_hour": "Транзакции за последний час",
  "block_height": "Высота блока",
  "online_nodes": "Узлы онлайн",
  "pice_per_1000trx": "Цена (за 1000 TRX)",
  "vote_for_super_representatives": "Голосовать за SR",
  "view_super_representatives": "Посмотреть SR",
  "create_new_wallet": "Создать новый кошелек",
  "view_tokens": "Просмотр токенов",
  "transactions_last_day": "Транзакции за последний день",
  /*
  ##################################################################################
  #                                                                                #
  # tableinformations and statistics                                               #
  #                                                                                #
  ##################################################################################
  */
  "first_page": "первая страница",
  "previous_page": "предыдущая страница",
  "next_page": "следущая страница",
  "last_page": "последняя страница",
  "page": "страница",
  "of": "из",
  "page_size": "размер страницы",
  "most_nodes": "Большинство узлов",
  "loading_nodes": "Загрузка узлов",
  "Hostname": "Имя хоста",
  "Last Update": "Последнее обновление",
  "first_node_sync_message": "В ожидании синхронизации первого узла повторите попытку через несколько минут.",
  "last_block": "последний блок",
  "blocks_produced": "Произведено блоков",
  "blocks_missed": "Пропущено блоков",
  "productivity": "производительность",
  "rewards": "награды",
  "token_created": "Токен создан",
  "witness": "Создатель",
  "asset_participation": "Участие в выпуске токенов",
  "loading_transaction": "Загрузка транзакции",
  "nodes_ranking": "Рейтинг узлов",
  "split_by_country": "Рейтинг по странам и регионам",
  "total_accounts_last_day": "Всего счетов за последний день",
  "chart_tip": "Выберите область данных, чтобы увеличить или уменьшить масштаб",
  "link_test_server": "Тестнет",
  "highest": "Наибольшее ",
  "lowest": "Низшее ",
  "increase": "увеличение ",
  "number": "число ",
  "_of": "равное",
  "was_recorded_on": "было зарегистрировано",
  "rank_real_time": "Ранг (в реальном времени)",
  "volume_24": "24-часовой объем торгов",
  "billion_usd": "Млрд. Долларов США",
  "loading_transfers": "Загрузка переводов",
  "loading_transactions": "Загрузка транзакций",
  "loading_block": "Загрузка блока",
  "current_power": "Текущие права голоса",
  "produce_distribution": "Диаграмма Производителей блоков",
  "confirm_token_issue": "Подтвердите выпуск токена",
  "_to": "до",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain - statistics                                                        #
  #                                                                                #
  ##################################################################################
  */
  "addresses": "адресов",
  "trx_transferred_past_hour": "Сумма перевода TRX за прошедший час",
  "transactions_past_hour": "Транзакции за прошедший час",
  "average_blocksize": "Средний размер блока",
  "rich_list": "Список богатейших адресов",
  "tron_transaction_chart": "График транзакций TRON",
  "transactions_per_day": "Транзакций в день",
  "foundation": "Адреса Фонда",
  "foundation_address": "Общее количество Замороженных TRX Фондом",
  "unfreeze_time": "Время разморозки",
  "addresses_number": "Номер Адреса",
  "Confirmed": "Подтверждено",
  "Unconfirmed": "Не подтверждено",
  /*
  ##################################################################################
  #                                                                                #
  # account section                                                                #
  #                                                                                #
  ##################################################################################
  */
  "set_name": "Установить имя",
  "unique_account_message": "Вы можете установить имя своей учетной записи только один раз!",
  "name_to_short": "Имя слишком короткое",
  "name_to_long": "Имя слишком длинное",
  "permitted_characters_message": "Имя может содержать только a-z A-Z 0-9",
  "change_name": "Сменить имя",
  "account_name": "Имя пользователя",
  "show_qr_code": "Показать QR-код",
  "do_not_send_2": "Не отправляйте TRX со своего собственного кошелька и не обменивайте его по указанному выше адресу учетной записи на тестнете!",
  "bandwidth": "пропускная способность",
  "balance": "Баланс",
  "tron_power": "Право голоса",
  "transactions": "транзакции",
  "no_transfers": "Нет переводов",
  "no_tokens": "Нет токенов",
  "free_bandwidth": "Бесплатная пропускная способность",
  "expires": "истекает",
  "have_been_added_to_your_account": "были добавлены в ваш аккаунт!",
  "information_message_1": "Главная сеть не может запрашивать тестовые trx, пожалуйста, свяжитесь с TRON для получения тестовых trx.",
  "information_message_2": "Вы можете запросить TRX только 10 раз для одного аккаунта.",
  "request_trx_for_testing": "Запрос TRX для тестирования",
  "token_balances": "балансы токенов",
  "produced_blocks": "Произведенные блоки",
  "voters": "голосующие",
  "progress": "прогресс",
  "transactions_count": "{transactions, plural, one {transaction} other {transactions}}",
  "issuer": "выпускающий",
  "network": "сеть",
  "current": "текущий",
  "trx_received": "TRX получены",
  "test_trx_temporarily_unavailable_message": "Тестовые TRX временно недоступны. Пожалуйста, попробуйте позже.",
  "not_enough_trx": "Недостаточно TRX",
  "information_message_3": "TRX успешно запрошены. Если вы не получили TRX, то тестовые TRX временно недоступны. Пожалуйста, попробуйте позже.",
  "send_to_following_address": "Отправить по следующему адресу",
  "change_website": "Изменить сайт",
  "you_must_enter_url": "Вы должны ввести URL",
  "specify_the_url": "Пожалуйста, укажите URL",
  /*
  ##################################################################################
  #                                                                                #
  # account freeze                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "freeze": "заморозить",
  "unfreeze": "разморозить",
  "freeze_trx_least": "Вам нужно как минимум 1 TRX, чтобы иметь возможность заморозить",
  "unable_unfreeze_trx_message": "Невозможно разморозить TRX. Это может быть вызвано тем, что минимальный период замораживания еще не достигнут.",
  "freeze_trx_premessage_0": `TRX может быть заморожен, чтобы получить Право голоса и включить дополнительные функции.
   Например, с Правом голоса вы можете `,
  "freeze_trx_premessage_link": "Голосовать за Суперпредставителей.",
  "freeze_trx_premessage_1": `Замороженные токены блокируются на 3 дня. В течение этого периода Замороженные TRX не могут быть проданы.
   По истечении этого периода вы можете разморозить TRX и обменять токены.`,
  "freeze_trx_premessage_2": `Пропускная способность или энергия могут быть получены через замораживание. Вы не можете приобрести оба ресурса одновременно. Когда пользователь разморозит определенный ресурс, его предыдущие голоса будут полностью аннулированы. Если пользователь захочет проголосовать, используя оставшиеся Права голоса, ему придется заново выполнять свои операции голосования.`,
  "trx_amount": "Сумма TRX",
  "token_freeze_confirm_message_0": "Я подтверждаю, что хочу заморозить",
  "token_freeze_confirm_message_1": "как минимум на 3 дня",
  "frozen_supply": " Кол-во замороженых токенов",
  "tokens_unfrozen": "Токены разморожены",
  "success_tokens_unfrozen_message": "Токены успешно разморожены",
  "unable_to_unfreeze": "Невозможно разморозить",
  "Unable_tokens_unfrozen_message": "Невозможно разморозить токены.",
  "tokens_frozen": "Токены заморожены",
  "successfully_frozen": "Токены успешно заморожены",
  "name_changed": "Имя изменено",
  "successfully_changed_name_to_message": "Успешно изменено имя на",
  "unable_to_rename_title": "Невозможно переименовать",
  "unable_to_rename_message": "При обновлении имени учетной записи что-то пошло не так, попробуйте позже",
  "unfreeze_trx_confirm_message": "Вы уверены, что хотите разморозить TRX?",
  "unfreeze_assets": "Разморозить активы",
  "sure_to_unfreeze_unlocked_tokens_message": "Вы уверены, что хотите разморозить разблокированные токены?",
  "After": "После",
  /*
  ##################################################################################
  #                                                                                #
  # account superdelegates                                                         #
  #                                                                                #
  ##################################################################################
  */
  "apply_for_delegate": "Подать заявку, чтобы стать Суперпредставителем",
  "apply_super_representative_candidate": "Подать заявку, чтобы стать кандидатом в Суперпредставители",
  "your_personal_website_address": "ваш личный адрес сайта",
  "apply_for_delegate_predescription": "Каждый владелец токена имеет возможность стать Суперпредставителем TRON. Однако, чтобы сеть и сообщество работали более слаженно и эффективно, мы разработали набор стандартов и правил, позволяющих подходящим кандидатам стать рекомендованными Суперпредставителями. Мы будем продвигать рекомендованных Суперпредставителей, чтобы увеличить их шансы быть избранными. Новые рекомендованные Суперпредставители обновляются раз в неделю.",
  "apply_for_delegate_description": "Все обладатели токенов могут подать заявку на получение статуса Суперпредставителя (SR), перейдя на страницу Аккаунт; они также могут голосовать за кандидатов, нажав на Голосовать. Каждый пользователь может голосовать за нескольких кандидатов, причем количество голосов будет меньше или равно сумме TRX, которой они обладают. Результаты голосования основаны на последнем раунде голосования каждого пользователя. Количество голосов будет обновляться каждый день в 02:00 (GMT + 8), 08:00 (GMT + 8), 14:00 (GMT + 8), 20:00 (GMT + 8); пользователи также могут просматривать кол-во голосов в режиме реального времени. 27 лучших кандидатов с наибольшим количеством голосов станут SR и будут отвечать за генерацию блоков с вознаграждением 32 TRX за блок. 27 SR и 100 лучших кандидатов SR также могут получить вознаграждение на основе полученных голосов. Единовременная плата за транзакцию в размере 9 999 TRX будет вычтена для заявки, чтобы стать кандидатом. Пользователям не будет стоить TRX, чтобы проголосовать за кандидатов в SR.",
  "unknown_error": "Произошла неизвестная ошибка",
  "representative_understand": "Я понимаю, как быть представителем TRON",
  "generate_account": "Нажмите, чтобы сгенерировать адрес и пароль вашей учетной записи",
  "create_account_confirm_1": "Я понимаю, что если я забуду/потеряю свой пароль, я никогда не смогу получить доступ к своим активам",
  "create_account_confirm_2": "Я понимаю, что если я забуду/потеряю свой пароль, никто не сможет помочь мне восстановить его",
  "create_account_confirm_3": "Я написал свой пароль на бумаге",
  "vote_thanks": "Спасибо за ваш голос!",
  "recent_transactions": "недавние транзакции",
  "newest_account": "новый аккаунт",
  "representatives": "представители",
  "representativesAcandidates": "Суперпредставители и кандидаты",
  "most_votes": "большинство голосов",
  "start_end_time": "Время начала/окончания",
  "scan_qr_code": "Отсканируйте код с помощью сканера QR-кода",
  "receive_trx": "получить TRX",
  "require_account_to_send": "Вы должны войти в систему, чтобы отправить монеты",
  "require_account_to_receive": "Вы должны войти в систему, чтобы получить монеты",
  "successful_send": "Успешно отправлены!",
  "confirm_transaction": "подтвердите транзакцию",
  "last_confirmed": "Окончательное подтверждение",
  "trx_produced": "Произведенные транзакции",
  "do_not_send_1": "Не отправляйте TRX из собственного кошелька и не обменивайте его на свой адрес в тестовой сети!",
  "go_to_votelist": "Перейти к списку голосов",
  "understand_tron_sr_message_0": "Я понимаю, как быть представителем TRON, и я подтверждаю, что заплачу",
  "understand_tron_sr_message_1": "в качестве комиссии.",
  "invalid_url": "Неверная ссылка",
  "apply_representative_error_message_0": "Что-то пошло не так при попытке подать заявку на представителя.",
  "apply_representative_error_message_1": "Убедитесь, что у вас достаточно TRX для оплаты, или повторите попытку позже.",
  "open_external_link": "Вы открываете внешнюю ссылку",
  "private_key_untrusted_website_message_0": "Никогда не вводите свой приватный ключ на ненадежном веб-сайте.",
  "no_official_tron_website": "не является официальным сайтом TRON.",
  "continue_to_external_website": "Продолжить переход на внешний сайт",
  "url_changed": "URL изменен",
  "successfully_changed_website_message": "Сайт успешно изменен на",
  "unable_to_change_website_title": "Невозможно изменить URL",
  "unable_to_change_website_message": "При обновлении сайта что-то пошло не так, попробуйте позже",
  "successfully_linked_github": "Успешно привязан к Github!",
  "github_linked": "Github привязан!",
  "unable_to_link_github_message": "Не удалось привязать к Github, убедитесь, что ваше имя пользователя указано правильно!",
  "could_not_link_github": "Не удалось привязать к Github",
  "enter_your_github_username": "Введите ваше имя пользователя на Github",
  "link_to_github": "Привязать к Github",
  "link_github": "Привязать Github",
  "you_must_enter_a_url": "Вы должны ввести URL",
  "success": "Успешно",
  "successfully_appied_sr_canidate_message_0": "Заявка в кандидаты в Суперпредставители успешно подана",
  "successfully_appied_sr_canidate_message_1": "Ваша учетная запись будет обновлена в ближайшее время.",
  "landing_page": "Целевая страница",
  "show_more_information_publish_sr_page": "Показать больше информации о том, как опубликовать страницу",
  "create_sr_landing_page_message_0": "Суперпредставители могут создать целевую страницу, на которой они могут поделиться дополнительной информацией о своей команде и планах.",
  "set_github_url_message_0": "Вы уже настроили свой шаблон на Github? Затем задайте URL с помощью кнопки ниже",
  "set_github_link": "Задать ссылку Github",
  "could_not_claim_rewards": "Нельзя претендовать на награды",
  "claim_rewards_error_message": "При попытке получить вознаграждение что-то пошло не так. Повторите попытку позже.",
  "rewards_claimed": "Награда получена!",
  "successfully_claimed_rewards": "Награда успешно получена",
  "claim_rewards": "Получить награды",
  "sr_receive_reward_message_0": "Как представитель вы получаете награды за производство блоков. Эти награды можно получить каждые 24 часа",
  "intro": "О проекте",
  "budget_expenses": "Бюджетные расходы",
  "server_configuration": "Конфигурация сервера",
  "community_plan": "План сообщества",
  "team": "Команда",
  /*
  ##################################################################################
  #                                                                                #
  # token creation formular                                                        #
  #                                                                                #
  ##################################################################################
  */
  "name_of_the_token": "Имя токена",
  "token_message": "Имя токена, избегайте дублирования",
  "token_abbr": "Сокращенное имя токена",
  "abbr_message": "Сокращенное имя токена, избегайте дублирования",
  "total_supply": "общее кол-во",
  "issued_token": "токен выпущен",
  "create_token": "Создать токен",
  "description": "Краткое введение",
  "description_url": "URL Описания",
  "quote_token_amount": "Количество токенов",
  "base_token_amount": "Количество базовых токенов",
  "creating_a_token": "Создание токена",
  "available": "доступно",
  "testnet": "Тестнет",
  "days_to_freeze": "Дни заморозки",
  "trx_token_fee_message": "1024 TRX требуется для выпуска нового токена",
  "trx_token_account_limit": "Вы можете создать только один токен TRC10 для каждой учетной записи",
  "trx_token_wallet_requirement": "Вам нужно открыть кошелек, чтобы создать токен",
  "invalid_address": "неверный адрес",
  "insufficient_tokens": "Недостаточно токенов",
  "fill_a_valid_number": "Пожалуйста, введите правильный номер",
  "fill_a_valid_address": "Пожалуйста, введите правильный адрес",
  "make_another_transaction": "Совершить еще одну транзакцию",
  "token_exchange_confirm": "Я подтверждаю, что использую {trxAmount}, чтобы получить {tokenAmount} токенов.",
  "An_unknown_error_occurred,_please_try_again_in_a_few_minutes": "Произошла неизвестная ошибка. Повторите попытку через несколько минут.",
  "An_error_occurred": "Произошла ошибка",
  "create_a_token": "Создать токен",
  "not_started_yet": "Еще не началось",
  "participated": "Вы успешно приняли участие!",
  "participated_error": "Произошла ошибка",
  /*
  ##################################################################################
  #                                                                                #
  # token participate                                                              #
  #                                                                                #
  ##################################################################################
  */
  "buy_confirm_message_0": "Уверены ли вы?",
  "how_much_buy_message": "Сколько токенов вы хотите купить?",
  "buy_confirm_message_1": "Вы уверены, что хотите купить",
  "for": "за",
  "insufficient_trx": "Недостаточно TRX",
  "not_enough_trx_message": "У вас недостаточно TRX, чтобы купить столько токенов",
  "ends": "окончание",
  "starts": "начало",
  "can_be_unlocked": "можно разблокировать",
  /*
  ##################################################################################
  #                                                                                #
  # global messages                                                                #
  #                                                                                #
  ##################################################################################
  */
  "address_warning": "Введите только действительный адрес кошелька TRON. Неправильные адреса могут привести к потере TRX.",
  "search_address_or_url": "Поиск адреса или URL",
  "the_lunch_test": "Целью запуска Тестнет является проверка всех возможностей нашего блокчейна-эксплорера и кошелька.",
  "please_keep_in_mind": "Пожалуйста, имейте в виду, что, поскольку адрес вашей зарегистрированной учетной записи используется только для Тестнета, не отправляйте TRX из собственного кошелька или биржи на адрес учетной записи Тестнета.",
  "tron_foundation": "TRON Foundation",
  "trx_for_testing": "TRX для тестирования будет отправлено на ваш тестовый аккаунт, как только вы успешно подадите заявку через управление аккаунтом.",
  "dear_users": "Уважаемые пользователи,",
  "finished": "готово",
  "token": "токен",
  "url": "url",
  "need_to_login": "Вы должны войти в систему, чтобы получить доступ к странице учетной записи",
  "thanks_for_applying": "Спасибо за заявку!",
  "to_much_votes": "Слишком много голосов",
  "no_trx_remaining": "Не осталось TRX",
  "show_more": "Показать {countriesLength} больше",
  "vote_guide_message": `Используйте свои TRX, чтобы голосовать за Суперпредставителей.
   За каждый TRX, который вы имеете в своем аккаунте, вы можете потратить на один голос.
   TRX не будет тратиться. Вы можете проголосовать за несколько представителей столько раз, сколько захотите.
   Количество голосов будет обновляться в 02:00, 08:00, 14:00, 20:00 (GMT+8) каждый день, и список делегатов будет обновляться.`,
  "search_address": "Поиск адреса",
  "token_transactions": "Транзакции токена",
  "token_holders": "Держатели токенов",
  "nr_of_Transfers": "Количество переводов",
  "not_signed_in": "Вам нужно будет войти в свой аккаунт, чтобы использовать эту функцию",
  "loading_map": "Загрузка карты",
  "loading_accounts": "загрузка аккаунтов",
  "quantity": "количество",
  "percentage": "процент",
  "loading_token": "Загрузка токена",
  "voter_percentage": "Процент голосующих",
  "total_balance": "Общий баланс",
  /*
  ##################################################################################
  #                                                                                #
  # transaction information                                                        #
  #                                                                                #
  ##################################################################################
  */
  "no_transactions_found": "Транзакции не найдены",
  "no_tokens_found": "Токены не найдены",
  "no_blocks_found": "Блоки не найдены",
  "no_votes_found": "Голоса не найдены",
  "no_voters_found": "Не найдено голосующих",
  "waiting_for_transactions": "Ожидание транзакций",
  "loading_address": "Загрузка Адреса",
  /*
  ##################################################################################
  #                                                                                #
  # token creation - default messages                                              #
  #                                                                                #
  ##################################################################################
  */
  "details": "подробности",
  "issue_a_token": "Создать токен",
  "issue_token": "Создать токен",
  "token_name": "Имя токена",
  "total_issued": "Всего создано",
  "registered": "Зарегистрировано",
  "abbreviation": "Аббревиатуры",
  "exchange_rate": "Установка обменного курса",
  "token_price": "Цена токена",
  "supply_message": "Всего токенов выдано (без точности)",
  "description_message": "A short description of the purpose of the token",
  "url_message": "Адрес веб-сайта, который показывает больше информации о токене",
  "exchange_rate_message_0": "Укажите цену одного токена, указав, сколько токенов участник получит за каждый потраченный TRX.",
  "exchange_rate_message_1": "Участники получат",
  "exchange_rate_message_2": "за каждый",
  "exchange_rate_message_3": "TRX",
  "participation_message_0": "Укажите период, в котором будут выпущены токены. В течение данного периода пользователи могут обменять TRX на",
  "participation_message_1": " токенов.",
  "frozen_supply_message_0": `Часть токенов может быть заморожена. Количество должно быть указано и должно быть заморожено
    минимум на 1 день. Замороженное кол-во может быть вручную заморожено после даты начала и заморожено
    дни были достигнуты. Заморозка не является обязательной.`,
  "token_issued_successfully": "Токен успешно выпущен",
  "participation": "Время выпуска токена",
  "start_date": "Дата начала",
  "end_date": "Дата окончания",
  "token_spend_confirm": "Я подтверждаю, что для создания всех токенов требуется единовременная оплата в 1024 TRX",
  "token_issue_guide_message_1": `Выдача токена по протоколу TRON может быть выполнена
     любым, у кого в аккаунте есть хотя бы 1024 TRX.`,
  "token_issue_guide_message_2": `Когда токен будет выпущен, он будет отображаться на странице обзора токенов.
     Пользователи могут обменивать свои TRX на токены в течение времени выпуска токена.`,
  "token_issue_guide_message_3": `После выпуска токена ваш аккаунт получит количество токенов, равное его общему количеству.
     Когда другие пользователи обменяют свои TRX на токены, токены будут сняты с вашего аккаунта, и вы
     получите TRX, равный указанному обменному курсу.`,
  /*
  ##################################################################################
  #                                                                                #
  # token creation - error messages                                                #
  #                                                                                #
  ##################################################################################
  */
  "date_error": "Дата окончания раньше или совпадает с датой начала",
  "no_name_error": "Требуется указать имя",
  "no_supply_error": "Общее количество должно быть не менее 1",
  "coin_value_error": "Общее количество должно быть больше стоимости одного TRX",
  "tron_value_error": "Количество TRX должно быть не меньше 1",
  "invalid_starttime_error": "Указанная дата начала недействительна",
  "invalid_endtime_error": "Указанная дата окончания недействительна",
  "no_description_error": "Требуется описание",
  "no_url_error": "Требуется веб-URL",
  "past_starttime_error": "Дата начала раньше, чем сегодня",
  "no_transactions": "Нет транзакций",
  "errors_in_form": "Есть ошибки в форме",
  "token_link_message_0": "Токен будет доступен ",
  "token_link_message_1": "Страница токенов",
  "token_link_message_2": "через несколько минут",
  "description_error_message_0": "Описание не может быть длиннее 200 символов",
  "token_creation_error": "Произошла ошибка при попытке создать токена",
  "tokenname_error_message_0": "Имя не должно быть длиннее 32 символов",
  "tokenname_error_message_1": "Имя может содержать только символы a-Z",
  "abbreviation_required": "Аббревиатура обязательна",
  "abbreviation_error_message_0": "Аббревиатура не может быть длиннее 5 символов",
  "abbreviation_error_message_1": "Аббревиатура может содержать только символы a-Z",
  /*
  ##################################################################################
  #                                                                                #
  # representatives section                                                        #
  #                                                                                #
  ##################################################################################
  */
  "highest_productivity": "Самая высокая производительность",
  "lowest_productivity": "Самая низкая производительность",
  "Super Representatives": "Суперпредставители",
  "Super Representative Candidates": "Кандидаты в суперпредставители",
  "loading_representatives": "Загрузка Суперпредставителей",
  "address_not_super_representative": "Этот адрес не является Суперпредставителем",
  "unable_load_representatives_page_message": "Невозможно загрузить страницу, это может произойти, если адрес неверен, адрес не является представителем или представитель еще не настроил эту страницу",
  "loading_representative": "Загрузка Суперпредставителя",
  /*
  ##################################################################################
  #                                                                                #
  # markets section                                                                #
  #                                                                                #
  ##################################################################################
  */
  "average_price_usd": "Средняя цена в долларах США",
  "average_volume_usd": "Средний объем в долларах США",
  "Trade Volume": "Объем торгов в долларах США",
  "rank": "Ранг",
  "pair": "Кол-во пар",
  "volume": "Объем",
  "usd": "USD",
  "average_price": "Средняя цена",
  "click_the_chart_title_to_find_more": "Нажмите на название диаграммы, чтобы узнать больше.",
  /*
  ##################################################################################
  #                                                                                #
  # votes section                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "next_round": "Следующий раунд",
  "total_votes": "Всего голосов",
  "most_ranks": "Наибольшее продвижение в рейтинге",
  "view_live_ranking": "Просмотр рейтинга в реальном времени",
  "open_team_page": "Открыть страницу команды",
  "warning_votes": "Для начала голосования требуется как минимум 1 Право голоса. Право голоса достигается путем замораживания TRX на",
  "account_page": "Странице аккаунта",
  "loading_votes": "Загрузка голосов",
  "3_day_ranking": "Рейтинг за 3 дня (10 лучших)",
  "live_ranking": "Рейтинг в реальном времени",
  "live_ranking_msg": "Обновляется каждые 15 секунд. Новые голоса могут занять 1-2 минут перед подсчетом",
  "candidate": "Кандидат",
  "current_votes": "Текущие голоса",
  "click_to_start_voting": "Нажмите здесь, чтобы начать голосование",
  "votes_remaining_message": "Осталось голосов",
  "open_wallet_start_voting_message": "Откройте кошелек, чтобы начать голосование",
  "thanks_submitting_vote_message": "Спасибо за ваш голос!",
  "need_min_trx_to_vote_message": "Вам нужно хотя бы 1 TRX, чтобы проголосовать",
  "to_much_votes_massage": "Вы тратите много голосов!",
  "all_votes_are_used_message": "Все голоса использованы!",
  "submissing_vote_message_title": "Спасибо за ваш голос!",
  "submissing_vote_message_0": "Ваши голоса успешно отправлены, они вступят в силу, когда начнется следующий раунд голосования.",
  "submissing_vote_message_1": "Вы можете перераспределить свои голоса в любое время",
  "submitting_vote_error_message": "При отправке ваших голосов что-то пошло не так. Пожалуйста, попробуйте позже.",
  "loading_super_representatives": "Загрузка Суперпредставителей",
  /*
  ##################################################################################
  #                                                                                #
  # transaction Viewer                                                             #
  #                                                                                #
  ##################################################################################
  */
  "info_tx_viewer": "Здесь вы можете вставить шестнадцатеричный код (HEX) транзакции для проверки информации о транзакции. Затем транзакция может быть передана в сеть",
  "load_tx": "Загрузить транзакцию",
  "tx_qrcode": "QR-код транзакции",
  "load_tx_qrcode": "Загрузить транзакцию через QR-код",
  "transaction_load_error": "Ошибка загрузки транзакции",
  "transaction_load_error_message": "Что-то пошло не так при попытке загрузить транзакцию. Убедитесь, что HEX указан в правильном формате",
  "transaction_success_message": "Транзакция успешно передана в сеть",
  "transaction_success": "Транзакция прошла успешно",
  "transaction_error_message": "При попытке передачи транзакции в сеть что-то пошло не так",
  "transaction_error": "Ошибка транзакции",
  "confirm_transaction_message": "Вы уверены, что хотите произвести транзакцию?",
  "broadcast_transaction_to_network": "Передача транзакции в сеть",
  /*
  ##################################################################################
  #                                                                                #
  # tools node tester                                                              #
  #                                                                                #
  ##################################################################################
  */
  "node_tester_msg": "Вставьте IP-адрес вашего узла для проверки GRPC соединения",
  "node_tester_stop": "Прекратить тестирование",
  "node_tester_test": "Тест GRPC",
  "node_tester_rt": "Время отклика",
  "confirmed_block": "Подтвержденный блок",
  "loading": "загрузка ...",
  "connection_node": "Подключение к узлу",
  /*
  ##################################################################################
  #                                                                                #
  # tools scanner                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "no_webcam_found": "Веб-камера не найдена",
  "trying_enable_webcam_message_0": "Ошибка при попытке включить веб-камеру.",
  "trying_enable_webcam_message_1": "Убедитесь, что разрешения камеры включены.",
  /*
  ##################################################################################
  #                                                                                #
  # help section                                                                   #
  #                                                                                #
  ##################################################################################
  */
  "what_is_tron": "TRON whitepaper V2.0",
  "tron_explorer_api": "TRONSCAN API",
  "tron_architechure": "Архитектура TRON",
  "tron_protobuf_doc": "Документация Protobuf TRON",
  "report_an_error": "Отправить сообщение об ошибке / предложение",
  "frequently_asked_questions": "FAQ",
  "telegram": "Telegram",
  /*
  ##################################################################################
  #                                                                                #
  # wallet section                                                                 #
  #                                                                                #
  ##################################################################################
  */
  "open_wallet": "Войти в систему",
  "private_key": "Приватый ключ",
  "keystore_file": "Файл Keystore",
  "select_file": "Выберите файл",
  "login_mobile": "Войти с помощью мобильного устройства",
  "create_wallet": "создать кошелек",
  "no_open_wallet": "Нет открытого кошелька для просмотра",
  "new_wallet": "Новый кошелек",
  "password_encr_key_message_0": "Этот пароль шифрует ваш закрытый ключ. Это не действует как SEED для генерации ваших ключей.",
  "password_encr_key_message_1": "Вам понадобится этот пароль и ваш приватный ключ, чтобы разблокировать ваш кошелек.",
  "strong_password_info": "Требуется надежный пароль",
  "save_keystore_file": "Сохраните ваш Keystore файл",
  "download_keystore_file": "Скачать зашифрованный ключ",
  "do_not_lose_it": "Не теряйте его!",
  "do_not_lose_it_message_0": "TRON Foundation не может помочь вам восстановить потерянный ключ.",
  "do_not_share_it": "Не делись им!",
  "do_not_share_it_message_0": "Ваши средства могут быть украдены, если вы используете этот файл на вредоносном сайте.",
  "make_a_backup": "Сделайте резервную копию!",
  "make_a_backup_message_0": "В случае, если ваш компьютер сломается.",
  "save_private_key": "Сохранить свой Приватный ключ",
  "print_paper_wallet": "Распечатать бумажный кошелек",
  "new_wallet_ready_message": "Ваш новый кошелек готов",
  "go_to_account_page": "Перейти на страницу аккаунта",
  "login_first": "Сначала войдите в кошелек",
  "contract_name": "Название контракта",
  "compiler": "Компилятор",
  "tx_count": "Количество транзакций",
  "setting": "Настройка",
  "date_verified": "Дата подтвердена",
  "compiler_version": "Версия компилятора",
  "creator": "Создатель",
  "verify_contract_code": "Проверить код контракта",
  "buy_tokens": "Купить токены",
  "fill_a_valid_private_key": "Пожалуйста, введите правильный приватный ключ",
  "confirm_private_key": "Подтвердите Приватный ключ",
  "transfer_confirm_info": "Вы уверены, что хотите перевести трансфер",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain block                                                                #
  #                                                                                #
  ##################################################################################
  */
  "hash": "Хеш",
  "time": "Время",
  "parenthash": "Родительский хэш",
  "size": "Размер",
  "blockchain_size": "Размер блокчейна",
  /*
  ##################################################################################
  #                                                                                #
  # ledger help page                                                               #
  #                                                                                #
  ##################################################################################
  */
  "ledger_guide": "Справочник по Ledger",
  "requirements": "Требования",
  "using_ledger_steps_message_0": "Для использования Ledger с Tronscan требуется нужно:",
  "a": "A",
  "install_the": "Установить ",
  "app": "приложение",
  "install_latest_version_message_0": "Установите последнюю версию ",
  "opening_your_wallet": "Открыв свой кошелек",
  "open_the_tronscan_desktop_client": "Откройте блокчейн-эксплорер: ",
  "click_open_wallet_top_right": `Нажмите «Войти» в правом верхнем углу`,
  "choose_ledger": "Выберите Ledger",
  "connect_unlock_ledger_with_pin": "Подключите и разблокируйте устройство с помощью PIN-кода",
  "open_tron_app_on_ledger": "Откройте приложение TRON в Ledger",
  "ledger_connected_tronscan_message_0": `Если ваш Ledger подключен правильно, то Tronscan покажет «Подключено»`,
  "click_on_open_wallet": `Нажмите на "Открыть кошелек"`,
  "redirect_to_your_wallet_message": "Вы будете перенаправлены на ваш кошелек и сможете просмотреть свой адрес TRON.",
  "using_ledger_to_sign_transactions": "Использование Ledger для подписания транзакций",
  "using_ledger_to_sign_transactions_message_0": "Убедитесь в том, что Ledger подключен, а приложение TRON открыто для подписания транзакций с использованием Ledger при использовании Tronscan.",
  "using_ledger_to_sign_transactions_message_1": "Tronscan покажет всплывающее окно с деталями транзакции, когда потребуется подпись транзакции. Подписи требуются, когда вы голосуете, отправляете TRX, меняете имя аккаунта и т.д.",
  "ledger_note": "Заметка",
  "ledger_note_message_1": "пока поддерживает только Ledger Nano S,Ledger Nano X,Ledger Blue.",
  "ledger_note_message_2": "используйте Chrome Explorer.",
  "ledger_note_message_3": "Мы поддерживаем: передачу токенов TRX и TRC10, передача токена TRC20, замораживание и размораживание TRX, голосование, настройку имени",
  "ledger_note_message_4": "В настоящее время недоступны следующие функции: размораживание токенов TRC10, создание токена, trxmarket, подачу заявки на SR, обановление Github, создание торговых пар, ввод и снятие капитала.",

  /*
  ##################################################################################
  #                                                                                #
  # userinfo - popup notification                                                  #
  #                                                                                #
  ##################################################################################
  */
  "record_not_found": "Запись не найдена!",
  "warning": "Предупреждение",
  "login_success": "Вход совершен успешно",
  "logout_success": "Выход совершен успешно",
  /*
  ##################################################################################
  #                                                                                #
  # blockchain - Live                                                              #
  #                                                                                #
  ##################################################################################
  */
  "applied_for_super_representative": "подана заявка на Суперпредставителя",
  "sr_candidature": "Кандидат в Суперпредставители",
  "created_token": "созданный токен",
  "token_creation": "Создание токена",
  "bought": "купилено",
  "voter": "участник голосования",
  "voting": "голосование",
  "asset": "актив",
  "token_transfer": "Передача токена",
  /*
  ##################################################################################
  #                                                                                #
  # buy Tron                                                                       #
  #                                                                                #
  ##################################################################################
  */
  "buy_trx": "Купить TRX",
  "buy_trx_message_0": "TRX можно приобрести напрямую через фиат или другие криптовалюты без бирж. Использует сервис от Changelly.com и является самым простым и быстрым способом покупки trx. Список поддерживаемых валют и FAQ можно найти по адресу",
  "buy_trx_using_changelly": "Купить TRX с помощью Changelly",
  "cant_load_widget": "Невозможно загрузить виджет",
  /*
  ##################################################################################
  #                                                                                #
  # new variables                                                                  #
  #                                                                                #
  ##################################################################################
  */
  "date": "Дата",
  "total_transactions": "Всего транзакций",
  "avg_blockTime": "Среднее время создания блока",
  "avg_blockSize": "Средний размер блока",
  "total_BlockCount": "Общее количество блоков",
  "new_address_seen": "Количество новых адресов",
  "transfer_contract": "Контракт передачи",
  "TRX_transfer_between_addresses": "Передача TRX между адресами",
  "transfer_asset_contract": "Контракт передачи активов",
  "token_transfer_between_addresses": "Перевод токена между адресами",
  "participate_asset_issue_contract": "Участие в контракте на выпуск активов",
  "participate_token_between_addresses": "Участвовать в переводе токена между адресами",
  "witness_update_contract": "Контракт обновления Суперпредставителей",
  "updates_a_witness": "Обновить Суперпредставителей",
  "witness_create_contract": "Контракт создания Суперпредставителей",
  "create_a_witness": "Создать Суперпредставителя",
  "account_update_contract": "Контракт обновления аккаунта",
  "update_account_name": "Обновить имя аккаунта",
  "withdraw_balance_contract": "Контракт вывода средств",
  "withdraw_balance": "Вывести средства",
  "freeze_balance_contract": "Контракт заморозки средств",
  "freeze_TRX": "Заморозить TRX",
  "unfreeze_balance_contract": "Контракт разморозки средств",
  "unfreeze_TRX": "Разморозить TRX",
  "vote_witness_contract": "Контракт голосования за Суперпредставителей",
  "vote_for_a_witness": "Голосовать за Суперпредставителей",
  "asset_issue_contract": "Контракт выпуска активов",
  "issue_a_new_asset": "Выпустить новый актив",
  "owner_address": "Адрес владельца",
  "frozen_balance": "Замороженный Баланс",
  "frozen_days": "Дни заморозки",
  "counts": "раз",
  "TRX_exchange_rate": "Обменный курс TRX",
  "start_time": "Начальное время",
  "end_time": "Время окончания",
  "contracts": "Контракты",
  "search_description": "Поиск Адреса, Высоты блока, хэша транзакции, имени токена",
  "search_description1": "Поиск адреса, блока, транзакции, токена",
  "transaction": "Транзакция",
  "total_addresses": "Всего адресов",
  "daily_increment": "Ежедневное увеличение",
  "address_growth_chart": "Диаграмма роста адресов",
  "addresses_amount": "Количество адресов",
  "past_14_days_of_transactions": "Последние транзакций за 14 дней",
  "address_growth": "Рост количества адресов",
  "power": "Право голоса",
  "token_transfers": "Переводы токенов",
  "search": "Поиск",
  "inter_tnxl": "Внутренние транзакции контракта",
  "inter_a_total": "Всего",
  "inter_transactions_found": "Найдены внутренние транзакции",
  "parent_hash": "Родительский хэш",
  "inter_type": "Тип",
  "website_url": "Официальный веб-сайт",
  "search": "Поиск",
  "language_support": "В настоящее время поддерживается только английский ввод",
  "note": "Заметка",
  "_percentage": "Процент",
  "foundation": "Адреса Фонда",
  "foundation_address": "Общее количество замороженных TRX Фондом",
  "unfreeze_time": "Время разморозки",
  "addresses_number": "Количество адресов",
  "copyright": "Авторские права",
  /*
    ##################################################################################
    #                                                                                #
    # new variables    20180822 17:11:52                                                              #
    #                                                                                #
    ##################################################################################
  */
  "tron_convert_tool": "Инструмент кодирования",
  "breakdown_supply_types": "Распределение TRX",
  "genesis": "Изначальный выпуск",
  "TRX_distribution_overview": "ОБЗОР РАСПРЕДЕЛЕНИЯ TRX",

  "block_produce_rewards": "Награды за производство блоков",
  "node_rewards": "Награды Узлов",
  "independence_day_burned": "Сожжено в День Независимости",
  "fee_burned": "Сожженная плата",
  "current_total_supply": "Текущий общий объем",
  "foundation_freeze": "Заморожено Фондом",
  "price_per_1000_trx": "ЦЕНА ЗА 1000 TRX",
  "in_USD": "В долларах США",
  "in_BTC": "В BTC",
  "total_TRX_supply": "Общий объем TRX",
  "market_capitalization": "Рыночная капитализация",
  "circulating_supply": "Общее количество в обороте",
  "list_trx": "Залистить TRX",
  "burned_trx": "TRX сожжено",
  "supply_notes": "Краудсейл и предварительная продажа доступны по всему миру, за исключением США, Китая и Японии.",
  "14_day_transaction_history": "История транзакций за 14 дней",
  "14_day_address_growth": "Увеличение количества адресов за 14 дней",
  /*
  ##################################################################################
  #                                                                                #
  # ICO--rating page                                                              #
  #                                                                                #
  ##################################################################################
*/
  "TRONRating": "Рейтинг токенов TRON",
  "rating_title": "Система репутации токенов Tronscan",
  "modify_on": "Изменено",
  "rating_description": "Система репутации Tronscan направлена на то, чтобы помочь пользователям понять, дифференцировать и оценивать различные токены. Когда вы посещаете страницу токена, Репутация делится на 5 категорий:",
  "rating_status_1": "Ожидает рассмотрения",
  "rating_status_1_desc_a": "Еще не проверено",
  "rating_status_2": "OK",
  "rating_status_2_desc": "Репутация «ОК» не является одобрением или рекомендацией, но соответствует следующим критериям:",
  "rating_status_2_desc_a": "Предоставить достаточную и точную информацию",
  "rating_status_2_desc_b": "Имеет четкие цели проекта и каналы связи",
  "rating_status_2_desc_c": "Доступная информация учредителей проекта/инвесторов/консультантов",
  "rating_status_2_desc_d": "Токен торгуется на биржах криптовалют с проверкой AML / KYC",
  "rating_status_2_desc_e": "ICO было завершено или активно в течение не менее 3 месяцев",
  "rating_status_2_desc_f": "Была достигнута важная цель проекта",
  "rating_status_3": "Нейтрально",
  "rating_status_3_desc": "Репутация «Нейтрально» означает, что информация о проекте и команде относительно прозрачна.",
  "rating_status_3_desc_a": "Предоставить необходимую и достаточную информацию (официальный сайт, логотип, официальный контактный адрес электронной почты, Белая книга)",
  "rating_status_3_desc_b": "Профессиональный публичный профиль членов команды и консультантов размещен онлайн (укажите проект в личном профиле LinkedIn)",
  "rating_status_3_desc_c": "Предоставить материалы о социальных сетях",
  "rating_status_4": "Недостаточно информации",
  "rating_status_4_desc_a": "Не предоставлена необходимая и достаточная информация (официальный сайт, логотип, официальный контактный адрес электронной почты, Белая книга)",
  "rating_status_4_desc_b": "Нет информации о том, что проект находится в процессе",
  "rating_status_5": "Ложная информация",
  "rating_status_5_desc_a": "Использована ложная идентификацая для выпуска токена",
  "rating_status_5_desc_b": "Существует информация, указывающая на то, что проект заподозрен в мошенничестве/фишинге/рассылке спама, или информация, связанная с этим токеном, не была должным образом обработана, или токен имеет другие «опасные» признаки.",
  "rating_disclaimer": "ОТКАЗ ОТ ОТВЕТСТВЕННОСТИ",
  "disclaimer_desc_1": "Tronscan не одобряет и не осуждает какие-либо услуги или проекты, связанные с контрактами токенов, отображаемыми в Tronscan. Пользователи должны всегда проводить исследования с должной осмотрительностью, прежде чем предпринимать какие-либо действия, связанные с токеном, особенно когда речь идет об инвестировании.",
  "disclaimer_desc_2": "Репутация, связанная с этой услугой, может быть или не быть точной, поскольку она основана на субъективных оценках и/или отчетах сообщества. Мы не принимаем никаких сторон и не гарантируем и не проводим оценку ответственности/точности/надежности; наша оценка репутации не может рассматриваться как какой-либо совет, особенно инвестиционный совет.",
  "disclaimer_desc_3": "Мы оставляем за собой право интерпретировать символическую репутацию токена на этой странице, и мы не обязаны предоставлять какие-либо отзывы об отказе. Мы оставляем за собой право удалять или обновлять информацию (в том числе репутацию) в случае ее недостоверности или несоответствия.",

  /*
  ##################################################################################
  #                                                                                #
  # ICO--myToken page                                                              #
  #                                                                                #
  ##################################################################################
*/
  "my_created_token": "Мой токен",
  "my_token_desc_1": "Информация, связанная с токеном, будет отображаться на странице токена. Каждый токен, основанный на полноте и достоверности информации, получит",
  "tron_rating": "Репутацию Токена",
  "my_token_desc_2": "Если вам необходимо обновить информацию, отправьте обновления с помощью следующего шаблона Excel на token@tronscan.org по электронной почте вашей компании или по электронной почте с указанием необходимых учетных данных.",
  "brief_info": "Краткая информация",
  "website_official": "Официальный веб-сайт",
  "white_paper": "Белая Книга",
  "GitHub": "GitHub",
  "country": "Страна/Регион",
  "social_link": "Ссылка на социальные сети",
  "download_excel": "Скачать шаблон",
  "no_message": "N/A (Пожалуйста, отправьте электронное письмо для дополнения этой информации)",
  "insufficient_message": "Недостаточно информации",
  "neutral": "Нейтрально",
  "pending": "В ожидании",
  "fake": "Фальшивка",
  "token_detail": "О токене",
  "contact_us": "Связаться с нами",
  "my_token": "Мой токен",
  "try_later": "Пожалуйста, попробуйте позже",
  "contract_address": "Адрес контракта",

  /*
##################################################################################
#                                                                                #
# ICO--create token page                                                         #
#                                                                                #
##################################################################################
*/
  "basic_info": "Основная информация",
  "basic_info_desc": "Основная информация токена ",
  "exchange_setting": "Настройка выдачи",
  "exchange_setting_desc": "Установить цену и срок выдачи токенов",
  "freeze_setting": "Настройки заморозки",
  "freeze_setting_desc": "Заморозить часть токенов на некоторое время",
  "confirm_setting": "Подтвердите настройку",
  "confirm_setting_desc": "Подтвердите всю вашу информацию",
  "token_logo": "ЛОГОТИП токена",
  "image_restraint_desc": "разрешение 1: 1, предлагаемый формат jpg/png",
  "prev_step": "Предыдущий шаг",
  "freeze_on": "Включить",
  "freeze_off": "Выключить",
  "freeze_not_valid": "Функция заморозки выключена",
  "no_logo_error": "логотип не найден",
  "confirm_issue_info": "Пожалуйста, убедитесь, что следующая информация верна, так как смарт-контракт не может быть изменен после его записи в блокчейн.",
  "tick_checkbox": "Нужно поставить галочку",
  "change_info": "Если информация не верна, пожалуйста",
  "total": "всего",
  "a_totle": "Всего",
  "transaction_info": "Транзакции найдены",
  "hold_addr": "Держатели токенов",
  "transactions_unit": "Транзакции",
  "transfers_unit": "Переводы",
  "block_unit": "Блоки",
  "record_unit": "Транзакции",
  "token_unit": "Токены",
  "vote_unit": "кандидаты",
  "voter_unit": "Голосующие",
  "account_unit": "Аккаунты",
  "address_unit": "адреса",
  "contract_unit": "найдены проверенные исходные коды контракта",
  "inter_contract_unit": "Внутренние транзакции найдены",

  /*
##################################################################################
#                                                                                #
# ICO--participate page                                                         #
#                                                                                #
##################################################################################
*/

  "issue_progress": "Прогресс",
  "fund_raised": "Собрано средств",
  "issuing_price": "Цена при выпуске",
  "buy_token_info": "Сколько токенов вы хотите купить?",
  "reputation": "Репутация",
  "issue_time": "Время выпуска ",
  "success_receive": "Успешно получено",
  "circulating_supply": "Количество в обороте",
  "issue_info": "Информация о выпуске",
  "transferring": "В процессе",
  "in_progress": "В процессе",
  "fail_transaction": "Транзакция не удалась",
  "records": "Документация",
  "part_total": "Всего ",
  "part_pass": "найдено токенов",
  "view_total": "Всего",
  "view_pass": "Токенов для участия",
  "token_overview_tron": "Обзор рынка токенов TRON",
  "token_participate_tron": "Участвовать в выдаче токенов TRON",
  "not_started": "Не началось",
  "no_token_to_buy": "Извините, все оборотные средства уже выпущены, пожалуйста, подождите, пока токены не будут заморожены для участия",

  /*
  ##################################################################################
  #                                                                                #
  # contract page                                                                  #
  #                                                                                #
  ##################################################################################
  */

  "Code": "Код",
  "contract_overview": "Обзор контракта",
  "trx_value": "Цена TRX",
  "token_tracker": "Токен",
  "contract_creator": "Создатель контракта",
  "at_txn": "в процессе транзакции",
  "token_txns": "Транзакции токена",
  "Events": "События",
  "TxHash": "Хэш транзакции",
  "Internal_Txns": "Внутренние транзакции",
  "ParentTxHash": "Родительский хэш транзакции",
  "TxFee": "[Плата]",
  "contract_code_verified": "Исходный код контракта подтвержден (точное совпадение)",
  "Contract_ABI": "ABI Контракта",
  "Byte_code": "Байт код",
  "Constructor_Arguments": "Аргументы конструктора (кодируются ABI и являются последними байтами кода создания контракта выше) ",
  "Copy": "Копировать",
  "TxHash_Block_Age": "Хэш транзакции | Блок | Возраст",
  "Method": "Метод",
  "Event_Logs": "Журналы событий",
  "With_Verified_Source_Codes_Only": "Только с проверенными исходными кодами",
  "verified_contract_source_codes_found": " найдено контрактов с проверенным исходным кодом ",
  "contract_source_codes_found": " найдено контрактов",
  "ContractName": "Название контракта",
  "TxCount": "Количество транзакций",
  "Settings": "Настройки",
  "DateVerified": "Дата проверки",
  "Compiler": "Компилятор",
  "Compiler_Text": "Версия Компилятора",
  "Contract_Internal_Transactions": "Внутренние транзакции контракта",
  "Internal_Transactions_found": "Найдено внутренних транзакций",
  "Misc": "Разное",
  "Optimization_Enabled": "Оптимизация включена",
  "Normal_Transactions": "Нормальные транзакции",
  "Verified_contracts": "проверенные контракты",
  "Constructor_Arguments_tip": "Аргументы конструктора",

  /*
  ##################################################################################
  #                                                                                #
  # new variables    2018-09-11 12:51:31                                           #
  #                                                                                #
  ##################################################################################
  */
  "pice_per_1trx": "Цена",
  "tron_power_freezing": "Право голоса может быть получено путем замораживания TRX, 1 TRX за 1 Право голоса.",
  "HighChart_tip": "Нажмите и перетащите в область графика, чтобы увеличить",
  "general_information": "Основная информация",
  "blockchain_information": "Информация о блокчейне",
  "sr_information": "Информация SR",
  "currency_information": "Информация о валюте",
  "your_vote": "Ваш голос",
  "total_number_frozenTRX": "Общее количество замороженных TRX",
  "tronics_support_planTRX": "TRX заморожен планом поддержки Tronics",
  "frozen_by_the_foundationTRX": "TRX заморожен Фондом",
  "tronics_support_plan": "План поддержки Tronics",
  "tronics_support_plan_recipient_address": "Адрес получателя плана поддержки Tronics",
  "update_token": "Обновить токен",
  "total_frozen": "Резервы Фонда",
  "account_create_contract": "Аккаунт Создать Контракт",
  "account_create": "Создать учетную запись",
  "create_from_address": "Инициировать адрес контракта",
  "create_to_address": "Адрес созданной учетной записи",
  "proposal_create_contract": "Предложение Создать Контракт",
  "proposal_create": "Создать предложение",
  "block_not_found": "Извините, блок не найден.",
  "transaction_not_found": "Извините, транзакция не найдена.",
  "search_not_found": "Извините, введенная вами строка поиска не найдена.",
  "available_balance": "Доступные средства",
  /*
   ##################################################################################
   #                                                                                #
   # verify-contract-code                                          #
   #                                                                                #
   ##################################################################################
   */
  "contract_source_code": "Исходный код контракта",
  "bytecode_and_ABI": "ByteCode и ABI",
  "verify_and_publish_your_solidity_source_code": "Проверьте и опубликуйте исходный код Solidity",
  "step": "Шаг",
  "step_1": "Введите исходный код вашего контракта ниже.",
  "step_2": "Если сгенерированный Bytecode соответствует существующему Bytecode, контракт затем будет проверен.",
  "step_3": "Исходный код контракта публикуется онлайн и публично проверяется кем-либо.",
  "contract_notes": "ЗАМЕТКИ",
  "contract_notes_1": "Чтобы проверить контракты, которые принимают аргументы конструктора, введите аргументы в кодировке ABI в поле ниже.",
  "contract_notes_2_1": "Для целей отладки, если он правильно компилируется в",
  "contract_notes_2_2": " TRON studio",
  "contract_notes_2_3": ",здесь также следует правильно скомпилировать.",
  "contract_notes_3": 'Мы не поддерживаем проверку контрактов, которые используют «импорт» до сих пор.',
  "contract_notes_4": "Мы не поддерживаем проверку договора для договоров, созданных другим договором.",
  "contract_notes_5": "Для каждого скомпилированного контракта существует тайм-аут до 45 секунд. Если ваш контракт занимает больше времени, мы не сможем его проверить.",
  "contract_notes_6": "Больше функций появятся в следующей версии.",
  "contract_address": "Адрес контракта",
  "contract_optimization": "Оптимизация",
  "enter_contract_code": "Введите Solidity код контракта ниже",
  "following_optional_parameters": "Следующие необязательные параметры",
  "constructor_arguments_ABIencoded": "Аргументы конструктора, кодированные ABI (для контрактов, которые принимают параметры конструктора)",
  "contract_library_address": "Адрес библиотеки контрактов (для контрактов, в которых используются библиотеки, поддерживается до 5 библиотек):",
  "library_1_name": "Библиотека_1 Имя",
  "library_2_name": "Библиотека_2 Имя",
  "library_3_name": "Библиотека_3 Имя",
  "library_4_name": "Библиотека_4 Имя",
  "library_5_name": "Библиотека_5 Имя",
  "library_contract_address": "Адрес Договора Библиотеки",
  "verify_and_publish": "Проверить и опубликовать",
  "txn": "txn",
  "contract_name_tip": "Должен совпадать с ContractName в исходном коде или в MultiPart контракте, он должен совпадать с развернутым вами ContractName.",
  "constructor_arguments_ABIencoded_tip": "Эта опция применяется ТОЛЬКО к контрактам, которые принимают аргументы конструктора, если вы не уверены, то это вам не нужно. Аргументы конструктора должны быть в значениях ABI-ENCODED и будут добавлены в байт-код контракта.",
  "library_1_name_tip": "Эта опция применяется ТОЛЬКО к контрактам, которые используют библиотеки.",
  "library_contract_address_tip": "Адрес библиотеки соответствующего контракта.",
  "contract_source_code_for": "The Контракт Исходный код для",
  "has_already_been_verified": "уже был проверен.",
  "click_here_to_view": "Нажмите здесь, чтобы посмотреть",
  "contract_was_creating_during": "Контракт создавался во время",
  "constructor_arguements": "Используемые аргументы конструктора (в кодировке ABI)",
  "ContractBytecode": "ContractBytecode",
  "ContractABI": "ContractABI",
  "start_over": "Начать сначала",
  "sorry_unable_contract_address": "Извините！ Невозможно найти код контракта на",
  "this_a_valid_contract_address": "это действующий адрес договора?",
  "successfully_generated_byteCode": "Успешно сгенерированные ByteCode и ABI для адреса контракта",
  "error_construct_ABI_encoded": "Отсутствуют аргументы конструктора/библиотеки, используемые для функции",
  "error_construct_bytecode_for": "Извините! Скомпилированный Bytecode контракта для",
  "the_contract_creation_code_for": " НЕ соответствует коду создания контракта для ",
  "error_contract_ABI_for": "Извините! Составленный договор ABI для",
  "unableto_verify_contract_source_code": "Невозможно проверить исходный код контракта.",
  "contractname_found": "Имя контракта найдено",
  /*
  ##################################################################################
  #                                                                                #
  # contract-type                                          #
  #                                                                                #
  ##################################################################################
  */
  "trigger_smart_contract": "Запустить смарт-контракт",
  "normal_address_trigger_smart_contract": "Обычный адрес запускает смарт-контракт",
  "approve_trigger_smart_contract": "Deposit authorization",
  "approve_normal_trigger_smart_contract": "Token transfer between the main chain and the sidechain are allowed",
  "pledge_trigger_smart_contract": "Token deposit",
  "pledge_normal_trigger_smart_contract": "Transfer from main chain to sidechain",
  "mapping_trigger_smart_contract": "Token mapping",
  "mapping_normal_trigger_smart_contract": "Main chain and sidechain mapping",
  "sign_trigger_smart_contract": "Token withdraw",
  "sign_normal_trigger_smart_contract": "Transfer from sidechain to main chain",
  "trigger": "Запуск контрактов",
  "contract_triggers_total": "Контрактов запущенно",
  "contract_triggers_owner": "Владелец",
  "contract_triggers_owner_address": "Адрес владельца",
  "no_tnx": "Нет транзакции",
  "no_event": "Нет событий",
  "link_test_fauct": "test faucet",
  "gain_bandwith": "Заморозить TRX, чтобы получить пропускную способность",
  "gain_energy": "Заморозить TRX, чтобы получить энергию",
  "energy": "Энергия",
  "freeze_trx_gain_bandwith_energy": "Вы также можете получить пропускную способность или энергию.",
  "freeze_type": "Тип заморозки",
  "success_unfrozen_trx": "Успешно Разморожен TRX",
  "please_select_the_type_of_unfreeze": "Пожалуйста, выберите тип размораживания",
  "unfreeze_bandwidth": "Разморозить учетную запись пропускной способности, чтобы получить TRX",
  "unfreeze_energy": "Разморозить счет энергии, чтобы получить TRX",
  "hide_small_currency": "Скрыть небольшие остатки",
  "tokens_less_than_10": "Токены с количеством менее 10",
  "only_TRX_transfers": "Только переводы TRX",
  "no_transfers_found": "Переводы не найдены",
  "current_MaxTPS": "Текущий/Максимальный TPS",

  /*
  ##################################################################################
  #                                                                                #
  # exchange                                         #
  #                                                                                #
  ##################################################################################
 */

  "apply_for_the_currency": "Подать заявку на валюту",
  "apply_for_process": "Подать заявку на валютный процесс",
  "apply_content": "Если вы хотите добавить монету, пожалуйста, заполните форму заявки, чтобы предоставить информацию о валюте. После предоставления информации, мы рассмотрим данные как можно скорее. Пожалуйста, терпеливо подождите, прежде чем отвечать на результаты аудита.",
  "operate_txn_pair_message": "Пожалуйста, введите целое число",
  "withdraw_all": "Не полностью распродан",
  "creat_valid": "Не может превышать остаток на счете",
  "my_trading_pairs": "Мои торговые пары",
  "create_trading_pairs": "Создать торговые пары",
  "pairs": "Пары",
  "no_pairs": "Нет пары",
  "capital_injection": "Вложение капитала",
  "capital_withdrawal": "Снятие капитала",
  "pair_has_been_created": "Пара была создана",
  "successfully_created_pair": "Успешно создана пара сделок",
  "pair_creation_failed": "создание пары не удалось",
  "successful_injection": "Вложение успешно",
  "sorry_injection_failed": "Извините, вложение не удалось",
  "successful_withdrawal": "Успешный вывод",
  "sorry_withdrawal_failed": "Извините, вывод не выполнен",
  "select_the_name_of_the_Token": "Пожалуйста, выберите имя токена",
  "enter_the_amount": "Введите сумму",
  "choose_a_Token_for_capital_injection": "Выберите токен для вложения капитала:",
  "choose_a_Token_for_capital_withdrawal": "Выберите токен для снятия капитала:",
  "injection_amount": "Количество вложения:",
  "withdrawal_amount": "Сумма вывода:",
  "marks": "РЫНОК",
  "last_price": "Последняя цена",
  "pairs_change": "Изменение",
  "H": "H",
  "L": "L",
  "O": "O",
  "C": "C",
  "24H_VOL": "24-часовой Объем",
  "token_application_instructions_title": "Листинг токенов",
  "token_application_instructions_1": "Токены, прошедшие проверку, будут отображаться в списке DEX. Непроверенный токены можно обменять с помощью функции поиска.",
  "click_here_to_apply": "Нажмите здесь, чтобы подать заявку",
  "TxTime": "Время транзакции",
  "TxAmount": "Сумма сделки",
  "TxRecord": "Запись транзакции",
  "TxAvailable": "Доступен",
  "TxBuy": "Ожидается купить",
  "TxSell": "Сумма хочу продать",
  "my_transaction": "Мои транзакции",
  "enter_the_trading_amount": "Введите торговую сумму",
  "BUY": "КУПИТЬ ",
  "SELL": "ПРОДАТЬ ",
  "estimated_cost": "предполагаемая стоимость",
  "estimated_revenue": "Предполагаемый доход",
  "slightly_cost": "Немного увеличится предполагаемая стоимость, и скорость оборота будет выше.",
  "slightly_revenue": "Немного ниже предполагаемый доход, и скорость оборота будет выше.",
  "participation_message_2": "Время выдачи не включено, что означает, что пользователи не могут участвовать в токене на tronscan.",
  "created_token_time": "Создан",
  "overview_TRC20": "Обзор TRC20",
  "overview_TRC10": "Обзор TRC10",
  "pice_per_onetrx": "Цена (TRX)",
  "total_tokens": "Всего токенов",
  "application_entry": "Заявка на участие",


  /*
   ##################################################################################
   #                                                                                #
   # commottee                                         #
   #                                                                                #
   ##################################################################################
  */
  "committee": "Комитет TRON",
  "committee_dec_1": "Комитет TRON предназначен для изменения динамических параметров на сети TRON, например, вознаграждения за генерацию блоков, комиссионные за транзакции и т. д.",
  "committee_dec_2": "Комитет состоит из нынешних {total} супер-представителей (SR).",
  "committee_dec_3": "Каждый SR имеет право предлагать и голосовать за предложения.",
  "committee_dec_4": "Если предложение получает {total} или более голосов от SR в течение действующего периода времени, предложение будет одобрено, и его параметры сети будут изменены в следующем периоде обслуживания.",
  "get_committee_proposal": "Проверьте предложения комитета",
  "TRON_network_parameters": "Параметры сети TRON",
  "commission_proposed": "Комитет предложений",
  "TRONSR": "TRON SR",
  "learn_more": "Узнать больше",
  "propose_number": "Число",
  "propose_parameters": "Параметр",
  "propose_current_value": "Текущее значение",
  "propose_hour": "Час",
  "propose_1": "Предлагается изменить интервал технического обслуживания SR",
  "propose_2": "Предлагается изменить стоимость подачи заявки на SR аккаунт",
  "propose_3": "Предлагается изменить плату за создание аккаунта",
  "propose_4": "Предлагается изменить количество TRX, используемого для получения дополнительной пропускной способности",
  "propose_5": "Предлагается изменить плату за выдачу активов",
  "propose_6": "Предлагается изменить награду генерации блоков SR",
  "propose_7": "Предлагается изменить награды, полученные 27 лучшими SR и следующим 100 кандидатам",
  "propose_8": "Предлагается изменить стоимость создания аккаунта",
  "propose_9": "Предлагается изменить потребление пропускной способности",
  "propose_10": "Предлагается активировать Виртуальную машину (TVM)",
  "propose_11": "Предлагается убрать голоса GR",
  "propose_12": "Предлагается изменить плату за 1 энергию",
  "propose_13": "Предлагается изменить стоимость создания торговой пары",
  "propose_14": "Предлагается изменить максимальное время выполнения одной транзакции",
  "propose_15": "Предлагается разрешить сменить имя аккаунта",
  "propose_16": "Предлагается разрешить одно и то же имя токена",
  "propose_17": "Предлагается разрешить делегирование ресурсов",
  "propose_18": "Предлагается изменить общий предел энергии",
  "propose_18_1": "Предлагается изменить общий предел энергии",
  "propose_19": "Предлагается разрешить передачу токена TRC-10 в смарт-контрактах",
  "propose_20": "Текущий предел энергии",
  "propose_21": "Предлагаем разрешить инициирование мульти-подписи",
  "propose_22": "Предложить адаптивную корректировку общей энергии",
  "propose_23": "Целевой предел энергии",
  "propose_24": "Средний предел энергии",
  "propose_25": "Плата за обновление разрешения учетной записи",
  "propose_26": "Предлагаю изменить плату за мультиподпись",
  "propose_27": "Propose to enable protocol optimization",
  "propose_28": "Propose to support the new features of TRON Virtual Machine 0.5.4",
  "propose_minute": "мин",
  "propose_unactivate": "Не активирован",
  "propose_not_allowed": "Не разрешено",
  "propose_allowed": "Разрешено",
  "propose_activate": "Активировать",
  "propose_finished": "Законченный",
  "proposal_content_info": "Содержание предложения",
  "proposer": "Автор предложения",
  "proposal_time_of_creation": "Время создания (UTC)",
  "proposal_time_of_expire": "Время истечения (UTC)",
  "proposal_status": "Статус предложения",
  "proposal_to": " в ",
  "no_commission_proposed_found": "Комиссия не найдена",
  "proposal_effective": "Эффективный",
  "proposal_voting": "Голосование",
  "proposal_ineffective": "Неэффективен",
  "proposal_cancelled": "Отменен",
  "proposal": "Предложение",
  "approvers_of_the_proposal": "Утверждающие предложение",
  "total_approving_votes": "Всего одобряющих голосов",
  "to_provide_a_better_experience": "Чтобы обеспечить лучший опыт, эта статистика обновляется каждую минуту.",
  "TRC10_token": "TRC10 токен",
  "TRC20_token": "TRC20 токен",
  "TRC20_decimals": "Точность",
  "nav_more": "Больше",
  "no_holders_found": "Держатели токенов не найдены",
  "search_TRC20": "Поиск адреса",
  "beginners_guide": "Руководство",
  "Submit_a_bug": "Отправить ошибку",
  "TRONdice": "Держите монету кубика и получите TRX дивиденд!",
  "Join_TRONdice": "-Присоединиться к TRONdice!",
  "search_TRC20_error": " Пожалуйста, введите правильный адрес",
  "dex_announcement": "Извещение:",
  "regulations_on_trading_pairs": "Положения о торговых парах",
  "How_to_trade_on_DEX": "Как торговать на DEX",
  /*
   ##################################################################################
   #                                                                                #
   # about us                                         #
   #                                                                                #
   ##################################################################################
  */
  "about_us": "О Нас",
  "what_we_do": "Что мы делаем?",
  "Transcan_desc": "Tronscan - это первый блокчейна-эксплорера, основанный на TRON. Он включает не только некоторые основные функции блокчейна-эксплорера, такие как транзакции поисковых запросов, учетные записи, блоки, узлы, смарт-контракты; статистика данных и запросов по цепочке, но также напрямую поддерживает создание токенов. В то же время Tronscan также имеет встроенный веб-кошелек и DEX на основе Bancor, что обогащает матрицу приложений Tronscan.",
  "Our_team": "Участник Сообщества",
  "Team_desc": "Наша команда - это Blockchain Welfare Foundation на Мальте, который активно участвует в строительстве экосистемы TRON. Команда состоит из более чем 30 человек по всему миру, в основном разработчики и операторы. В будущем мы будем связаны с экологическим развитием TRON в долгосрочной перспективе. Чтобы усовершенствовать Tronscan, мы также разработаем DApps на основе TRON.",
  "User_many": "Пользователи Tronscan по всему миру",
  "User_many_desc": "Каждый день сторонники TRON со всего мира используют Tronscan block explorer, где они могут запрашивать детали транзакции и использовать новейшие функции TRON.",
  "HarryXu": "Обеспечить фронтальную техническую поддержку",
  "Skye": "Собрать комментарии сообщества и помочь решить их",
  "Ariml": "Обеспечить больше вдохновения для дизайна страницы",
  "Lee": "Много работаю над переводом для японской версии",
  "YanZheng": "Обеспечить бэк-энд техническая поддержка",
  "Zach": "Обеспечить бэк-энд тех/тест поддержку",
  "Adolph": "Изучение последних разработок в индустрии блокчейна, внесение большого вклада в дизайн и позиционирование продукта tronscan.",
  "Vincent Lau": "Обеспечить много технической поддержки блокчейна",

  /*
  ##################################################################################
  #                                                                                #
  # new variables    2018-12-06                                    #
  #                                                                                #
  ##################################################################################
  */
  "newly_issued_token_by_tronscan": "Поддельные токены будут добавлены в черный список и не будут отображаться.",
  "Favorites": "Избранные",
  "dex_search_dec": "Введите Аббревиатуру токена",
  "TRC20_exchange_online": "Обмен TRC20 онлайн",
  "Trade_on_TRXMarket": "Торгуйте на TRXMarket",
  "issued_token_of_tronscan": "Выданный токен будет отображаться в обзоре TRC10 только после прохождения проверки на tronscan.",
  /*
    ##################################################################################
    #                                                                                #
    # notice  2018-12-10                                     #
    #                                                                                #
    ##################################################################################
   */
  "OthersArticle": "Статьи в этой группе",
  "donateAddress": "ПОДДЕРЖИТЕ",
  /*
    ##################################################################################
    #                                                                                #
    # trc20  2018-12-18                                     #
    #                                                                                #
    ##################################################################################
   */
  "trc20_nav_state": "вошел",
  "trc20_nav_dex": "DEX",
  "trc20_nav_trc10": "Обмен TRC10",
  "trc20_nav_trc20": "Обмен TRC20",
  "trc20_nav_tokenList": "Список токенов",
  "trc20_nav_aboutUs": "О нас",
  "trc20_footer_explain": "Оценить стандарт",
  "trc20_footer_qa": "Вопросы и ответы",
  "trc20_footer_standard_1": "Плата за обслуживание TRXMarket заключается в следующем:",
  "trc20_footer_standard_2": "•Пополнить: не нужно пополнять",
  "trc20_footer_standard_3": "•Снятие: без вывода",
  "trc20_footer_standard_4": "•Транзакция: комиссия за обработку 0,1%",
  "trc20_footer_standard_5": "Примечание. Право на интерпретацию стандарта оплаты принадлежит TRXMarket, и TRXMarket оставляет за собой право корректировать ставку.",
  'trc20_apply_for_the_currency': "Подать заявку на валюту",
  "trc20_apply_for_process": "Подать заявку на валютный процесс",
  "trc20_apply_content": "Если вы хотите добавить монеты, пожалуйста, заполните форму заявки, чтобы предоставить информацию о валюте. После предоставления информации, мы рассмотрим данные как можно скорее. Пожалуйста, терпеливо подождите, прежде чем отвечать на результаты аудита.",
  "trc20_operate_txn_pair_message": "Пожалуйста, введите целое число",
  "trc20_withdraw_all": "Не полностью распродан",
  "trc20_creat_valid": "Не может превышать остаток на счете",
  "trc20_my_trading_pairs": "Мои торговые пары",
  "trc20_create_trading_pairs": "Создать торговые пары",
  "trc20_pairs": "Пары",
  "trc20_no_pairs": "Нет Пар",
  "trc20_capital_injection": "Вложения капитала",
  "trc20_capital_withdrawal": "Снятие Капитала",
  "trc20_pair_has_been_created": "Пара была создана",
  "trc20_successfully_created_pair": "Успешно создана пара сделок",
  "trc20_pair_creation_failed": "Создание пары не удалось",
  "trc20_successful_injection": "Успешное вложение",
  "trc20_sorry_injection_failed": "Извините, вложение не удалось",
  "trc20_successful_withdrawal": "Успешный вывод",
  "trc20_sorry_withdrawal_failed": "Извините, вывод не выполнен",
  "trc20_select_the_name_of_the_Token": "Пожалуйста, выберите имя токена",
  "trc20_enter_the_amount": "Введите сумму",
  "trc20_choose_a_Token_for_capital_injection": "Выберите токен для вложения капитала:",
  "trc20_choose_a_Token_for_capital_withdrawal": "Выберите токен для снятия капитала:",
  "trc20_injection_amount": "Сумма вложения",
  "trc20_withdrawal_amount": "Сумма вывода:",
  "trc20_marks": "рынок",
  "trc20_guide": "руководство пользователя",
  "trc20_last_price": "Последняя цена",
  "trc20_pairs_change": "изменение",
  "trc20_H": "H",
  "trc20_L": "L",
  "trc20_O": "O",
  "trc20_C": "C",
  "trc20_24H_VOL": "24-часовой объём",
  "trc20_24H_Total": "24-часовой оборот",
  "trc20_price": "Цена",
  "trc20_amount": "Количество",
  "trc20_enter_the_trading_amount": "Введите торговую сумму",
  "trc20_enter_10": "Всего ≥ 10 TRX",
  "trc20_enter_1": "Всего ≥ 1 USDT",
  "trc20_enter_the_trading_price": "Введите торговую цену",
  "trc20_TxAvailable": "Имеется в наличии",
  "trc20_BUY": "КУПИТЬ",
  "trc20_SELL": "ПРОДАТЬ",
  "trc20_token_application_instructions_title": "Инструкция по применению токена",
  "trc20_token_application_instructions_1": "Для удобства пользователей заполните заявку с подробной информацией о токене, который вы хотите выпустить. После получения вашей заявки мы завершим рассмотрение предоставленной вами информации в течение 3–5 рабочих дней. Токены без обзора будут скрыты.",
  "trc20_click_here_to_apply": "Нажмите здесь, чтобы подать заявку",
  "trc20_TxTime": "Время транзакции",
  "trc20_TxAmount": "Сумма сделки",
  "trc20_TxRecord": "Торговая запись",
  "trc20_CurOrder": "Текущий заказ",
  "trc20_TxBuy": "Ожидается купить",
  "trc20_TxSell": "Сумма продажи",
  "trc20_my_transaction": "Мой трейдинг",
  "trc20_estimated_cost": "Предполагаемая стоимость",
  "trc20_estimated_revenue": "Расчетный доход",
  "trc20_slightly_cost": "Немного увеличьте предполагаемая стоимость, и скорость оборота будет выше.",
  "trc20_slightly_revenue": "Немного понизить предполагаемый доход, и скорость оборота будет выше.",
  "trc20_accumulative": "Всего",
  "trc20_buy": "купить",
  "trc20_sell": "продать",
  "trc20_balance_tip": "Баланса недостаточно",
  "trc20_available_balance": "Остаток средств",
  "trc20_volume": "Торговая сумма",
  "trc20_cancel_order_confirm": "Вы уверены, что хотите отменить этот заказ?",
  "trc20_cancel": "Нет",
  "trc20_confirm": "Да",
  "trc20_prompt": "Предупреждение",
  "trc20_order_success": "Отправлено успешно",
  "trc20_cancel_order_fail": "Отменить заказ не удалось",
  "trc20_order_fail": "Не удалось отправить",
  "trc20_downLoad_wallet1": "Пожалуйста, скачайте кошелек",
  "trc20_downLoad_wallet2": " начать свою торговлю",
  "trc20_login_wallet": "Пожалуйста, войдите в свою учетную запись для следующего шага",
  "trc20_cur_order_header_order_time": "Время",
  "trc20_cur_order_header_order_type": "Тип",
  "trc20_cur_order_header_price": "Цена",
  "trc20_cur_order_header_amount": "Количество",
  "trc20_cur_order_header_volume": "Объем",
  "trc20_cur_order_header_progress": "Прогресс",
  "trc20_cur_order_header_action": "Операция",
  "trc20_cur_order_cancel": "Отменить",
  "trc20_trans_record_header_block": "Высота блока",
  "trc20_trans_record_header_buyAdr": "Покупатель",
  "trc20_trans_record_header_sellAdr": "Продавец",
  "trc20_trans_record_header_amount": "Количество",
  "trc20_trans_record_header_time": "Время",
  "trc20_trans_record_header_price": "Цена",
  "trc20_my_trans_header_time": "Время",
  "trc20_my_trans_header_type": "Тип",
  "trc20_my_trans_header_price": "Цена",
  "trc20_my_trans_header_amount": "Количество",
  "trc20_my_trans_header_volume": "Объем",
  "trc20_my_trans_header_status": "Статус",
  "trc20_my_trans_header_detail": "Детали",
  "trc20_my_trans_finish": "Все сдано",
  "trc20_my_trans_part": "Частично сданы",
  "trc20_my_trans_cancle": "Отменить",
  "trc20_my_trans_check": "Проверка",
  "trc20_no_data": "Нет данных",
  "trc20_token_info_Token_Info": "Введение",
  "trc20_token_info_Total_Name": "Название",
  "trc20_token_info_Token_Symbol": "Символ токена",
  "trc20_token_info_Total_Supply": "Поставка",
  "trc20_token_info_Circulating_Supply": "Циркуляционная поставка",
  "trc20_token_info_Contract_Address": "Адрес контракта",
  "trc20_token_info_Website": "Веб-сайт",
  "trc20_token_info_ths_1": "Пара",
  "trc20_token_info_ths_2": "Последняя цена",
  "trc20_token_info_ths_3": "24-часовая изменение",
  "trc20_token_info_ths_4": "24-часовая высота",
  "trc20_token_info_ths_5": "24-часовое снижение",
  "trc20_token_info_ths_6": "24-часовой объем",
  "trc20_token_info_ths_7": "24-часовой объем",
  "trc20_new_price": "Последняя цена",
  "trc20_exchange_status": "Статус торговой пары",
  "trc20_examine": "Отзыв",
  "trc20_unexamine": "Непроверенный",
  "trc20_id": "ID",
  "trc20_first_token": "Первый токен",
  "trc20_balance": "Баланс",
  "trc20_second_token": "Второй токен",
  "trc20_kchart": "K Line",
  "trc20_depth": "DEPTH",
  "trc20_trade_win_content": "Current network is unstable , please check later",
  "trc20_trade_win_confirm": "Confirm",
  "trc20_hot": "популярный",
  "trc20_top_Volume": "Торговый список",
  "trc20_top_Rising": "Восходящий список",
  "trc20_history": "Биржевые торги",
  "trc20_register": "Книга заказов",
  "trc20_24h_h": "24h Высоко",
  "trc20_24h_l": "24h низкий",
  "trc20_fire_token": "50 lucky draws to win 100,000 VENA!",
  "trc20_vena_tip": "Due to the particularity of VENA contract, extra 0.1 VENA will be authorized but not deducted.",

  /*
   *  2018-12-18
   * */
  "create_deal_pair": "Создать торговые пары",
  "add_deal_pair_desc": "Создание торговой пары доступно.",
  "click_create": "нажмите здесь, чтобы создать",
  "deal_pair_tip": "Не менее 100000 TRX на вашем балансе",
  "create_deal_pair_input_tip": "Не менее 100000 TRX в пул",
  "create_deal_pair_input_tip2": "Цена предложения не может быть изменена после успешного создания, одно создание сжигает 1024 TRX",
  "publish_price": "Ваша цена предложения",
  "pool_revert": "Баланс TRX в пуле должен быть не менее 100000",
  "sign_in_with_TRONlink": "TRONLINK",
  "import_a_wallet": "Импортировать кошелек",
  "sign_in_TRONlink_warning": "Пожалуйста, установите TRONlink и обновите страницу",
  "sign_in_TRONlink": "TRONLINK",
  "uninstall_TRONlink": "Еще не установили TRONlink? Нажмите сюда",
  "change_login_method": "Вход в TRONlink не поддерживает эту функцию в настоящее время, пожалуйста, используйте приватный ключ или файл хранилища ключей для входа.",
  "Create_token_link_message_0": "Токен будет указан только в том случае, если он прошел проверку токена на tronscan.",
  "sign_in_TRONlink_warning_0": "Пожалуйста, войдите в кошелек TRONlink!",
  "account_ad": "Выиграйте жетоны костей, играя в TRONDice. Обещайте жетоны, чтобы выигрывать дивиденды TRX каждый день",
  "bandwidth_tip": "На TRON пропускная способность будет использоваться для любой транзакции, но запрос 5000 пропускной способности будет ежедневно передаваться каждой активированной учетной записи системой. Пользователи могут заработать пропускную способность, заморозив TRX.",
  "energy_tip": "На TRON создание и запуск смарт-контрактов потребляется энергия. Пользователи могут получить энергию путем замораживания TRX.",
  "power_tip": "Право голоса используется для голосования за SR TRON. Пользователи могут получить TP замораживанием TRX.",
  "token_precision": "Точность Токена",
  "token_precision_message_0": "Установите точность токена, как требуется, диапазон 0-6",
  "check_my_token": "Проверить мой токен",
  "totle_transactions_per_day": "Всего ежедневных транзакций",
  "tron_total_transactions_chart": "График общих транзакций TRON",
  "sign_in_with_ledger": "LEDGER",
  "can_be_unlocked_now": "можно разблокировать",
  "TRC20_under_maintenance": "TRC20 на обслуживании",
  "transaction_fewer_than_100000": "1. При наличии менее 100000 (включая 100000) записей данных транзакций будут отображаться все данные.",
  "transaction_more_than_100000": "2. При наличии более 100 000 записей данных транзакций будут отображаться данные за последние 7 дней.",
  "the_token_wait_few_minutes": "Токен будет отображен на странице учетной записи через несколько минут.",
  "not_login": "Не Войти",
  "Audit_failed": "Аудит не прошел",
  "Auditing": "Проходит аудиторская проверка",
  "Passed_audit": "Прошел аудит",
  "Have_questions": "Есть вопросы о ходе проверки токенов?",
  "Please_contact_us": "Пожалуйста свяжитесь с нами.",
  "ok_confirm": "ОК",
  "high_risk": "Высокий риск",
  "contract_method": "Метод контракта",
  "contract_parameters": "Параметры метода",
  "energy_fee": "Сожгите столько TRX, чтобы получить энергию",
  "energy_usage": "Использование энергии из замороженной энергии пользователя",
  "energy_usage_total": "Общая стоимость энергии",
  "origin_energy_usage": "Использование энергии из предоставленного контракта",
  "net_fee": "Сожгите номер TRX, чтобы получить пропускную способность",
  "net_usage": "Использование пропускной способности из замороженной пропускной способности пользователя",
  "TRC20_transfers": "Переводы TRC20",
  "Basic_info": "Базовая информация",
  "Internal_txns": "Внутренний txns",
  "Fee_Consumption": "Потребление комиссии",
  "Method_calling": "Метод вызова",
  "SELF_DESTRUCT Contract": "Контракт на самоуничтожение",
  "CONTRACT_CREATION": "СОЗДАНИЕ КОНТРАКТА",
  "open_ledger": "Открыть Ledger",
  "price_per_1000_btt": "ЦЕНА НА 1000 БТТ",
  "BTT_distribution_overview": "ОБЗОР РАСПРЕДЕЛЕНИЯ BTT",
  "total_BTT_supply": "Общее количество BTT",
  "BTT_supply": "Количество BTT",
  "BTT_Token_Release_Schedule": "График выпуска токенов BTT",
  "source_btt_team": "Источник: команда управления BTT",
  "20_transfers": "TRC-20 transfers",
  "internal_transactions": "ВНУТРЕННИЕ ТРАНЗАКЦИИ",
  "total_energy_used_chart": "диаграмма общей использованной энергии",
  "total_used_energy": "общая использованная энергия ",
  "energy_used_by_freezing_TRX": " энергия, используемая при замораживание TRX ",
  "energy_used_by_burning_TRX": " энергия, используемая при сжигании TRX ",
  "total_energy_used": " общая использованная энергия ",
  "freezing_energy": " энергия при заморозки",
  "burning_energy": "энергия при сжигание",
  "energy_scale": "шкала энергии ",
  "range": " диапазон ",
  "call": "вызов",
  "caller": "звонящий",
  "call_time": "время звонка ",
  "call_scale": "шкала вызовов",
  "call_address_time": "время адреса вызова",
  "call_address_scale": "шкала адресов вызовов",
  "contract_call_chart": "диаграмма вызваных контрактов ",
  "call_address_number": " номер вызованого адреса",
  "contract_call_per_day": " контрактный звонок в день ",
  "contract_call_chart_day": ' диаграмма контрактных звоноков в день ',
  "Tron_energy_chart": " диаграмма энергии TRON",
  "tron_contract_call_chart": "диаграмма звонков по контракту TRON",
  "day_contract_energy_distribution": " распределение энергии однодневного котнракта ",
  "day_contract_call_distribution": " Распределение вызова дневного контракта",
  "a_total": " Всего ",
  "with_the_proportion_of": " с пропорцией в",
  "uesd_by_the": " используемой",
  "contracts_from_the_total_used_of": " контракты от общего объема использованных ",
  "Contract_times_calls": " Вызовы времени контракта (отсортировано по значению времени контракта в порядке убывания)",
  "EnergyConsume_title": "Ежедневная История Использованной Энергии TRON",
  "EnergyConsume_subtitle": "Нажмите и перетащите в область для увеличения",
  "EnergyConsume_yaxis": "Энергия",
  /*
      ##################################################################################
      #                                                                                #
      # new variables    2019-03-04                                    #
      #                                                                                #
      ##################################################################################
  */
  "table_info_big1": "Отображать только первые ",
  "table_info_big2": "",
  "table_info_big_tip1": "Всего в течение выбранного времени найдено",
  "table_info_big_tip2": "данных ,",
  "table_info_big_tip3": "и отображается только 10 000.",
  "table_info_big_tip4": "Если вы хотите посмотреть другие статистические данные, мы рекомендуем вам изменить временные рамки. ",
  "table_info_account_tip1": "В Главной сети TRON насчитывает в общей сложности ",
  "table_info_account_tip2": "учетных записей и в настоящее время отображает только первые 10000 (отображено в соответствии с балансом TRX от большого до малого).",
  "table_info_holders_tip1": "В текущее время есть ",
  "table_info_holders_tip2": "адреса токенов, и сейчас отображаются только первые 10000 (отсортированные от большого к маленькому в зависимости от количества токенов)",
  "Singapore": "Singapore",
  "table_info_new_tip": "В настоящее время отображаются только первые 10000 данных. Если вы хотите запросить другие данные, рекомендуется настроить временной диапазон.",
  "select_start_time": "Пожалуйста, выберите время начала",
  "select_end_time": "Пожалуйста, выберите время окончания",
  "binance": "binance",
  "social_link": "Ссылка на социальную сеть",
  "TRON_ecosystem": "Экосистема TRON",
  "accunt_ad_tip": "TRXMarket LaunchBase укажет свой первый токен -ACE",
  "token_fliter": 'Фильтр токенов',
  "gain": "Изменение (%)",
  "volume_24_trx": 'Объем (24 часа)',
  'all': 'полный',
  "market_capitalization_trx": "Рыночная капитализация (TRX)",
  "token_txs_info": "Token",
  "result": "Результат",

  /*
     ##################################################################################
     #                                                                                #
     # new variables    ledger 2019-04-24                                    #
     #                                                                                #
     ##################################################################################
 */
  "ledger_user_guide": "Руководство по использованию Ledger",
  "latest_version_chrome": "Обновите Сhrome до последней версии",
  "ledger_support_version": "Поддерживаемая версия Ledger: 0.1.1., Поддерживаемая версия Chrome 73.0",
  "ledger_you_can": "Вы можете посетить",
  "ledger_website": " Ledger веб-сайт ",
  "ledger_website_download": "Загрузите и обновите последнюю версию Ledger",
  "ledger_click_help": "Нажмите здесь для получения дополнительной помощи",


  /*
      ##################################################################################
      #                                                                                #
      # new variables    address 2019-05-13                                    #
      #                                                                                #
      ##################################################################################
  */

  "address_balance_token_type": "Проходная категория",
  "address_balance_token_price_TRX": "Значение",
  "address_transactions_tip": "Количество транзакций включает в себя количество переводов",
  "address_tron_power_tip": "Заморозить TRX, чтобы получить права голоса",
  "address_total_balance_tip": "Общий баланс включает в себя все ценные сертификаты",
  "address_tron_power_used": "Используется",
  "address_tron_power_remaining": "Прибавочный",
  "address_total_balance_info_sources": "Источник информации",
  "address_info_transfers": "Переводы",
  "address_info_transactions": "транзакции",
  "address_netLimit": "Общая пропускная способность",
  "address_netRemaining": "Доступная пропускная способность",
  "address_netUsed": "Использованная пропускная способность",
  "address_energyLimit": "Общая энергия",
  "address_energyRemaining": "Доступная энергия",
  "address_energyUsed": "Использованная энергия",
  "address_percentage": "Соотношение",
  "address_net_fee": "Стоимость пропускной способности",
  "address_energy_fee": "Стоимость энергии",
  "address_transfer_all": "ВСЕ",
  "address_transfer_in": "В",
  "address_transfer_out": "ИЗ",
  "address_transfer_unrecorded_token": "Unrecorded Token",

  /*
  ##################################################################################
  #                                                                                #
  # footer  2019-05-20                                    #
  #                                                                                #
  ##################################################################################
  */

  "footer_fellow_us": "Follow Us",
  "footer_developer_resources": "Developer Resources",
  "footer_support_center": "Support Center",
  "footer_tron_network": "TRON",
  "login_privatekey_warn": "Чтобы обеспечить безопасность учетной записи и избежать потери активов, пожалуйста сохраните и хорошо следите за своим приватным ключом и никогда никому не отдавайте его. Для входа рекомендуется Tronlink",
  "login_privatekey_warn_safe": " использовать",
  "token_does_not_support_exchange": "Token doesn't support trading now",
  "token_trade": "сделка",
  "updata_token_info": "обновить информацию токена",
  "input_transcan": "войти в TRONSCAN",
  "pass_time": "одобрен в",
  "black_time": "занесен в черный список в",
  "appeal_time": "запрос получен по:",
  "check_token_detail": "увидеть детали токена",
  "check_market_detail": "увидеть детали рынка",
  "check_abcc_detail": "увидеть детали abcc",
  "check_cmc_detail": "увидеть детали cmc",
  "type_black": "занесен в черный список",
  "type_pass": "одобрен ",
  "type_appeal": "заявка обрабатывается",
  "Appeal": "заявка",
  "input_market": "войти в trx.market (еще 10 пунктов для заполнения)",
  "input_abcc": "войти в abcc (еще 10 пунктов для заполнения)",
  "input_cmc": "войти в CMC (еще 10 пунктов для заполнения)",
  "holder_amount": "количество владельцев токенов",
  "day_trade": "ежедневный объем транзакций",
  "total_value": "общая рыночная стоимость",
  "black_reason": "причина попадания в черный список",
  "appeal_reason": "причина для подачи запроса",
  "handle_time": "среднее время обработки: 48 часов",
  "i_know_black": "Я понял причину попадания в черный список, и я хотел бы быть удален из черного списка",
  "appeal_format": "требуется причина вашего запроса",
  "token_input": "запись токена",
  "input": "запись",
  "select_type": "пожалуйста, выберите тип токена",
  "select_trx_tip1": "Рекомендуется выпуск токена TRC20",
  "select_trx_tip2": "кликните сюда",
  "select_trx_tip3": "узнать больше о различиях между токенами TRC10 и TRC20",
  "select_tip1": "Токены TRC10 не требуют смарт-контракта и потребляют 1024 TRX",
  "select_tip2": "Токены TRC20 выдаются по смарт-контракту и потребляют 0 TRX",
  "name_v_required": "требуется имя токена",
  "name_v_format": "имя токена должно содержать буквы, цифры и пробел",
  "name_v_length": "максимум 30 символов для имени токена",
  "abbr_v_required": "требуется аббревиатура токена",
  "abbr_v_format": "аббревиатура токена должна содержать буквы и цифры",
  "abbr_v_length": "максимум 10 символов для аббревиатуры токена",
  "token_description": "описание токена",
  "description_v_required": "требуется описание токена",
  "description_v_length": "максимум 500 символов для описание токена",
  "supply_v_required": "требуется общая циркуляция",
  "logo_v_required": "требуется лого",
  "logo_v_format": "неправильный формат лого",
  "contract_info": "информация контракта",
  "contract_address_placeholder": "адрес контракта на создание токена",
  "contract_address_required": "обязателен адрес контракта",
  "contract_address_format": "состоит из букв и цифр; начинается с T",
  "contract_created_date": "дата создания контракта",
  "contract_code": "коды контракта",
  "contract_code_placeholder": "коды контрактов для создания токена",
  "social_info": "информация социальных сетей",
  "email": "электронная почта",
  "email_v_required": "электронная почта является обязательной информацией",
  "email_v_format": "неверный формат адреса электронной почты",
  "email_placeholder": "Почта для связи",
  "whitepaper_address": "адрес для белой книги",
  "price_info": "информация о цене",
  "select_socoal_link": "нажмите, чтобы добавить ссылку(и) в социальных сетях",
  "so_add": "продолжать добавлять",
  "socoal_v_format": "максимум 20 ссылок",
  "trc20_token_return": "вернуть",
  "token_input_success": "токен успешно записан",
  "token_input_failure": "не удается записать токен",
  "token_update_success": "Token updated successfully",
  "token_update_failure": "fail to update Token",
  "token_input_failure_reason": "причина неудачи",
  "token_input_failure_no_submit": "не готовность подачи",
  "token_input_failure_submit": "отправить снова",
  "leave_tip": "ваша информация не завершена; Вы хотели бы закончить процесс заполнения формы?",
  "already_add_social_link_": "добавлены ссылка(и) в социальных сетях",
  "token_input_success_you_can": "Вы можете найти это в",
  "token_input_success_wallet": "КОШЕЛЕК",
  "token_input_success_myaccount": "Токены, выданные мной",
  "token_input_success_find_it": " ",
  "token_input_success_trx_market": "токены, которые были успешно записаны, можно найти в списке; будет автоматически записываться в кошельке и tronlink; могут быть найдены",
  "token_input_success_tip": "заполните еще 10 пунктов для записи в trx.market",
  "token_logo_input_placeholder": "Пожалуйста, отправьте ссылку на изображение, jpg / jpeg / png поддерживаются, соотношение размеров 1: 1",
  "project_website": "Официальный сайт проекта",
  "token_input_trc10_tip": "Пожалуйста, заполните логотип, GitHub, ссылки в социальных сетях при обновлении токена",
  "token_input_trc20_tip": "При обновлении токена заполните логотип в социальных сетях",
  "token_spend_confirm_new": "Я уведомлен, что выдача токена требует единовременного потребления 1024TRX.",
  "token_create_auther_different": "Учетная запись не соответствует издателю и не может быть обновлена",
  "contract_created_address": "Адрес создателя договора",
  "ico_infomation": "ICO информация",
  "black_1": "Подозреваемый в присвоении других имен токенов",
  "black_2": "Совершил мошенничество и сбежал с фондом",
  "black_3": "Подозреваемый в нарушении закона и может столкнуться с серьезными нарушениями закона",
  "black_4": "Прогресс проекта сильно не соответствует плану",
  "black_5": "Злонамеренное увеличение выпуска",
  "black_6": "Проект закрыт; Сообщество, социальные сети и официальный веб-сайт не обслуживались более 30 дней",
  "black_7": "Команда добровольно снимает проект из-за его текущего прогресса и корректировки стратегии",
  "black_8": "Белая книга предоставляет ложную информацию и подозревается в плагиате",
  "black_9": "Проект вносит несанкционированные изменения в белой книги или другую ключевой информации и приводит к серьезным последствиям",
  "black_10": "Смарт-контракт ограничивает риски безопасности и может или уже привел к финансовым потерям пользователей",
  "black_11": "Имена токенов или аббревиатура содержат чувствительные слова xxxxx. В ожидании рассмотрения.",
  "str_1": "Имена токенов или аббревиатура содержат чувствительные слова.",
  "str_2": "Названия токенов или аббревиатуры отличаются от названий в контракте.",
  "str_3": "Объем общего выпуска отличается от общего объема в контракту.",
  "str_4": "Ошибка. Код контракта содержит assert.",
  "str_5": "Точность токена не совпадает с той, что указана в контракте.",
  "str_6": "Невозможно проверить подпись",
  "str_7": "Срок действия данных истек, пожалуйста, убедитесь, что часы вашего компьютера установлены правильно",
  "str_8": "Контракт был заключен.",
  "str_9": "Невозможно проверить параметры",
  "type": "Тип",
  "token_login_no_updated": "Учетная запись не соответствует издателю и не может быть обновлена",
  "information_is_being_confirmed": "Information is being confirmed, this process may take 10 minutes, please try again later",
  "my_account": "Мой аккаунт",
  "delegate_other": "Заморозка другими",
  "freeze_self": "Заморозить сам",
  "total_amount": "Итого",
  "receive_address":"Получите адрес (адрес по умолчанию ваш собственный)",
  "unfreeze_time": "Время разморозки",
  "interTrx_tip": "Внутренние транзакции - это операция, которая по общему адресу называется смарт-контрактом, а смарт-контракт передает токен на другой адрес.",
  "event_tip": "События позволяют программисту или провайдеру внешнего интерфейса использовать его, чтобы обратить внимание на контрактные операции и аудиты.",
  "Expected_acquisition": "Расчетная",
  "energy_more": "Полученная пропускная способность = замороженные TRX для получения пропускной способности/ общее количество замороженных TRX в сети для получения пропускной способности.",
  "bandwidth_more": "Полученная энергия = замороженные TRX для получения энергии / общее количество замороженных TRX для получения энергии во всей сети * предел общей энергии",
  "table_info_big": "Отображать только первые 10000",
  "Download": "Скачать",
 /* 2019-07-06*/
 "trc20_free_orders":"0 trading fee for all orders",
  /*
 ##################################################################################
 #                                                                                #
 # contract Compiler                                      #
 #                                                                                #
 ##################################################################################
*/
  "please_enter_address": 'Пожалуйста, введите адрес договора',
  "please_enter_name": 'Пожалуйста, введите название контракта',
  "please_enter_code": 'Пожалуйста, введите код договора',
  /*
  ##################################################################################
  #                                                                                #
  # read contract info   2019-07-02                                    #
  #                                                                                #
  ##################################################################################
  */
  "contract_title": "Контракт",
  "contract_code_choice": "Код",
  "contract_read": "Читать контракт",
  "contract_write": "Написать контракт",
  "contract_tip": "Подсказка",
  "contract_version": "Версия compiler",
  "contract_optimize": "Оптимизация",
  "contract_optimizer": "не",
  "contract_optimizered": "да",
  "contract_verify_status": "Контракт еще не подтвержден, нажмите здесь",
  "contract_verify_btn": "Проверить",
  "write_payable": "Запустите эти функции с помощью TRX или Token",
  "write_nonePayable": "Запуск этих функций будет потреблять TRX или энергию",
  "verify_code1": "Подтверждение контракта - это соответствие кода смарт-контракта, который вы пишете, с кодом смарт-контракта, размещенным в блокчейн сети, для проверки подлинности и прозрачности смарт-контракта.",
  "verify_code2": "Вы можете проверить свой смарт-контракт на TRONSCAN, загрузив файл смарт-контракта и просмотреть его.",
  /*
   ##################################################################################
   #                                                                                #
   # deploy contract   2019-07-10                                    #
   #                                                                                #
   ##################################################################################
  */
  "select_contract_file":"Загрузить файл(ы) контракта",
  "selected_contract_file_left":" ",
  "selected_contract_file_right":" файл(ы) был загружен",
  "selected_file_max_size": "Single file size must not exceed 5MB",
  "selected_file_max_num": "The number of selected files must not exceed 10",
  "contract_deployment":"Выпуск контракта",
  "contract_verification":"Проверка контракта",
  "contract_deploy_info1":"Выпуск контракта означает публикацию кода смарт-контракта в блокчейн сеть. Вы можете компилировать и выпускать смарт-контракты в TRONSCAN, загружая файлы смарт-контрактов.",
  "contract_deploy_info2":"Обратите внимание, что для выпуска контракта требуется определенное количество TRX, убедитесь, что на вашем счете достаточно средств.",
  "contract_deployment_btn_compile":"Компилировать",
  "contract_deployment_btn_deploy":"Выпускать",
  "contract_compile_params":"Компиляция параметров",
  "compile_params_version":"Версия Solidity",
  "compile_params_optimization":"Оптимизация",
  "compile_params_runs":"Runs",
  "compile_first":"Пожалуйста, сначала составьте свой контракт",
  "contract_deploy_params":"Выпуск параметров",
  "contract_deploy_modal_info":"Выпуск контракта будет стоить определенное количество TRX или энергии",
  "deploy_params_fee_limit":"Лимит комиссии",
  "deploy_params_user_fee_percentage":"Процент комиссии пользователя",
  "deploy_params_energy_limit":"Предел энергии происхождения",
  "deploy_params_send_token":"Выберите TRX или токен для отправки",
  "deploy_params_constructor":"Params для конструктора",
  "compile_close":"близко",

  "token_logo_upload_tip":"Поддерживаются только три формата - png, jpg, jpeg, размер не превышает 200 Кб, 100*100 пикселей",

  // Backbone - account - mapping
  "main_account_mapping_title":"Маппинг DAppChain",
  "main_account_mapping_text":"DAppChain - это сайдчейн сеть, разработанная на основе цепи TRON, масштабируемое решения для сети TRON. При сопоставлении с DAppChain вы получите более высокий TPS с меньшим энергопотреблением.",
  "main_account_mapping_text_1":"1.Более высокий TPS с меньшим энергопотреблением",
  "main_account_mapping_text_2":"2.Mapping operation consumes 1000TRX",
  "main_account_mapping_btn":"Маппинг",
  "main_account_mapping_success_btn":"Маппиравано",
  "main_account_mapping_desc1": "Когда токен маппирован с сайдчейн, токен с тем же именем будет создан на сайдчейн",
  "main_account_mapping_desc2": "После завершения маппирования, пользователи могут вкладывать токен в сайдчейн.",

  // sidechain - contract - mapping
  "sidechain_contract_left":"Отображение из контракта Главной Сети",
  "sidechain_contract_right":" ",

  // Sidechain - account - pledge
  "sidechain_account_pledge_btn":"Вкладывать",
  "sidechain_account_sign_btn":"Снимать",
  "pledge_currency":"Токен",
  "pledge_sidechain":"Сайдчейн",
  "pledge_num":"Количество",
  'pledge_num_error':"Количество не может превышать максимально доступный баланс",
  'pledge_num_min_error':"The quantity cannot be less than",
  "pledge_text":"Вклад будет потреблять определенное количество энергии",
  "sign_text":"Withdraw operation will consume",
  "pledge_mapping_text":"Ваши активы не были маппированы с DAppChain и поэтому вклад не может быть совершен.",
  "lack_of_balance":"TRX has insufficient balance",
  "mapping_text":"Mapping operations consume:",
  // success
  "pledge_success": "Deposit Success",
  "sign_success": "Withdraw Success",
  "mapping_success": "Mapping Success",
  // error
  "pledge_error": "Deposit Error",
  "sign_error": "Withdraw Error",
  "mapping_error": "Mapping Error",
  "price_per_1000_WIN": "PRICE PER 1000 WIN",
  "WIN_distribution_overview": "WIN DISTRIBUTION OVERVIEW",
  "total_WIN_supply": "Total WIN Supply",
  "WIN_supply": "WIN Supply",
  "WIN_Token_Release_Schedule": "WIN Token Release Schedule",
  "source_WIN_team": "Source: WIN Management Team",
  "Side_Chain":"DAppChain",
  "Main_Chain":"MainChain",

  "7day": "one week",
  "14day": "two weeks",
  "30day": "one month",
  "select_tip": "To view data other than 2000 You can manually adjust the time window",
  "date_number_tip": "{total} records in the current time range",
  "date_list_tip": "Only the first 2000 data are displayed",

  "sun_propose_1": "Переключатель комиссии за транзакцию: комиссия за транзакцию будет взиматься, как правило, если для предложения установлено значение 1.",
  "sun_propose_2": "Установите адрес контракта для gateway на боковой цепи",
  "sun_propose_3": "Установите срок действия предложения",
  "sun_propose_4": "Начните голосовать за Witness",
  "sun_propose_5": "Адрес для побудительного пула сайдчейн - это адрес (0) по умолчанию. ",
  "sun_propose_6": "Управлять включением/выключением стимула для witness на сайдчейн",
  "sun_propose_7": "Метрики распределения стимулирующего пула сайдчейн",
  "sun_propose_8": "Коэффициент прибыли witness на сайдчейн",
  "day":"день",


  "developers_username": "username",
  "developers_current_year":"year's points",
  "developers_current_quarter": "quarter's points",
  "developers_current_month":"month's points",
  "developers_view_points":"View Points Details",
  "developers_points_details": "Points details",
  "developers_contribution_link":"Contribution content corresponding link",
  "developers_earn_points":"Earn points",
  "developers_search":"Search username",
  "developers_scored_users":"Scored Users",
  "DAppChain_holders":"DAppChain Holders",
  "notrx_noenergy":"Please make sure your TRX is not less than 10 and a certain amount of energy",
  "inactive_MainChain_account":"Submission Failed.This address has not been activated on TRON.Please activate first and try again",
  "mapping_warning":"This operation must be done by the token contract creator",
  "freeze_balance_limit":"Недостаточный баланс, пожалуйста, введите заново",
};