export const messages = {
    /*
    ##################################################################################
    #                                                                                #
    #  $$$$$$$$\                                                                     #
    #  \__$$  __|                                                                    #
    #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
    #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
    #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
    #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
    #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
    #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
    #                                                                                #
    ##################################################################################
    #                                                                                #
    #         Template for translating the tronscan.org website                      #
    #         Version: 1.6-13082018                                                  #
    #         Update Date: 13.08.2018                                                #
    #         Language: Russian                                                      #
    #         Status: first Version                                                  #
    #         Number of checks: 3                                                    #
    #         Participants: Alex1984                                                 #
    #                                                                                #
    ##################################################################################
    #                                                                                #
    # description and structure of the template                                      #
    #                                                                                #
    # "<name of the variable>": "<corresponding translation>"                        #
    #                                                                                #
    # Note: please concentrate only on the value <corresponding translation>         #
    #                                                                                #
    ##################################################################################
    #                                                                                #
    # global section                                                                 #
    #                                                                                #
    ##################################################################################
    */
    "ok": "ОК",
    "app_title": "Протокол Трон",
    "password": "Пароль",
    "money_price": "Денежная Цена",
    "price": "цена",
    "blocks": "Блоки",
    "block": "Блок",
    "name": "Имя/Название",
    "website": "Вебсайт",
    "address": "Адресс",
    "sign_out": "выйти",
    "sign_in": "войти",
    "register_login": "Регистрация/Вход",
    "register": "зарегистрироваться",
    "login": "войти",
    "height": "Величина",
    "age": "дата создания",
    "bytes": "Bytes",
    "MByte": "MByte",
    "produced_by": "кем Создано",
    "block_reward": "Block Reward",
    "contract": "контракт",
    "from": "кем",
    "to": "кому",
    "value": "Объём",
    "total_accounts": "Всего Аккаунтов (реальное время)",
    "submit": "подтвердить",
    "send": "отправить",
    "receive": "получить",
    "supply": "Количество TRX",
    "view": "Вид",
    "view_all": "посмотреть все",
    "create": "добавить",
    "country": "Страна/Регион",
    "amount": "Сумма",
    "my_vote": "мой голос",
    "submit_votes": "проголосовать",
    "accounts": "Аккаунты",
    "created": "добавлено",
    "exchange": "Обмен",
    "next": "следующий",
    "copied_to_clipboard": "скопировано в буфер",
    "cancel": "Отменить",
    "reset": " Сброс",
    "error": "ошибка",
    "unlock_keyFile": "разблокировать KeyFile",
    "enter_password_message": "пожалуйста введите пароль!",
    "password_incorrect": "неверный пароль",
    "try_again": "Попробуйте еще раз",
    "wallet_unlocked": "Кошелек Разблокирован",
    "weak": " слабый",
    "okay": "средний",
    "good": "хороший",
    "strong": "сильный",
    "secure": "надёжный",
    "too_short": "слишком короткий",
    "status": "статус",
    "no_notifications": "Нет Уведомлений",
    "enable_desktop_notifications": "Активировать Уведомления Рабочего Стола",
    "desktop_notification_enabled": "Уведомления Рабочего Стола активированы!",
    "notifications_enabled": "Уведомления активированы",
    "contract_type": "Тип контракта",
    "filters": "Фильтр",
    "send_tokens": "Отправить токены",
    "desktop_explorer": "Desktop Explorer",
    "message": "Message",
    "wallet_address": "Wallet Address",
    "confirm": "Confirm",
    "_percentage": "Percentage",
    "language_support": "Only support English input currently",
    "note": "Note",
    /*
    ##################################################################################
    #                                                                                #
    # navigation section                                                             #
    #                                                                                #
    ##################################################################################
    */
    "blockchain": "Blockchain",
    "wallet": "Кошелек",
    "home": "На главную",
    "transfers": "Транзакция",
    "live": "Информация в Настоящее Время",
    "statistics": "Статистика",
    "markets": "Торговая Площадка",
    "tools": "Инструменты",
    "transaction_viewer": "Отследить Транзакции",
    "node_tester": "Тестер Узлов",
    "system": "Система",
    "news": "Новости",
    "help": "Помощь",
    "nodes": "Узлы",
    "votes": "Голосование",
    "account": "Аккаунт",
    "tokens": "Токены",
    "overview": "Обзор",
    "participate": "Приобрести Токены",
    /*
    ##################################################################################
    #                                                                                #
    # home dashboard                                                                 #
    #                                                                                #
    ##################################################################################
    */
    "tron_main_message": "Децентрализация Web",
    "transactions_last_hour": "Транзакции за последний час",
    "block_height": "Размер Блока",
    "online_nodes": "Узлы Online",
    "pice_per_1000trx": "Цена за 1000 TRX",
    "vote_for_super_representatives": "Голосовать за Супер Представителя",
    "view_super_representatives": "Обзор Супер Представителя",
    "create_new_wallet": "Создать новый кошелек",
    "view_tokens": "Обзор Токенов",
    "transactions_last_day": "Транзакции за последний день",
    /*
    ##################################################################################
    #                                                                                #
    # tableinformations and statistics                                               #
    #                                                                                #
    ##################################################################################
    */
    "first_page": "Первая Страница",
    "previous_page": "предыдущая старница",
    "next_page": "следующая страница",
    "last_page": "последняя страница",
    "page": "страница",
    "of": "от кого",
    "page_size": "Записей на странице",
    "most_nodes": "Наибольшее Количество Узлов",
    "loading_nodes": "Загрузка Узлов",
    "Hostname": " Hostname ",
    "Last Update": "Последнее Обновление",
    "first_node_sync_message": "Ожидание Синхронизации первых Узлов,пожалуйста повторите попытку через несколько минут.",
    "last_block": "последний блок",
    "blocks_produced": "созданные Блоки",
    "blocks_missed": "Пропавшие Блоки",
    "productivity": "Продуктивность",
    "rewards": "Вознаграждение",
    "token_created": "созданные Токены",
    "witness": "Свидетель/Проверяющий",
    "asset_participation": "Участие в активах",
    "loading_transaction": "Загрузка Транзакции",
    "nodes_ranking": "Рейтинг Узлов (по странам и регионам)",
    "total_accounts_last_day": "Колличество Узлов ( за прошлый день)",
    "chart_tip": "Перетащите область масштабирования данных, чтобы увеличить и уменьшить масштаб",
    "link_test_server": "Testnet",
    "highest": "Наибольший ",
    "lowest": "низший ",
    "increase": "увеличение ",
    "number": "номер ",
    "_of": "из",
    "was_recorded_on": "было записано в",
    "rank_real_time": "Rank (Real time)",
    "volume_24": "24 Hour Trading Volume",
    "billion_usd": "Billion USD",
    "loading_transfers": "Loading Transfers",
    "loading_transactions": "Loading Transactions",
    "loading_block": "Loading Block",
    "current_power": "Current Power",
    "produce_distribution": "Block Producer Chart",
    "confirm_token_issue": "Confirm Token Issue",
    "_to": "to",
    /*
    ##################################################################################
    #                                                                                #
    # blockchain - statistics                                                        #
    #                                                                                #
    ##################################################################################
    */
    "addresses": "Адресса",
    "trx_transferred_past_hour": "TRX переведено за последний час ",
    "transactions_past_hour": "Транзакции за последний час",
    "average_blocksize": "Средний размер Блока",
    "rich_list": "Распределение TRX Владелец/Количество",
    "tron_transaction_chart": "Диаграмма Транзакций Tron",
    "transactions_per_day": "Транзакции за день",
    "foundation": "Foundation Addresses",
    "foundation_address": "Foundation Freeze TRX Total Number",
    "unfreeze_time": "Unfreeze Time",
    "addresses_number": "Addresses Number",
    /*
    ##################################################################################
    #                                                                                #
    # account section                                                                #
    #                                                                                #
    ##################################################################################
    */
    "set_name": "ввести Имя",
    "unique_account_message": "Вы можете ввести Имя Аккаунта только один раз!",
    "name_to_short": "введенное имя слишком короткое",
    "name_to_long": "введенное Имя слишком длинное",
    "permitted_characters_message": "Имя содержит запрещенные символы, разрешено a-z A-Z 0-9",
    "change_name": "изменить Имя",
    "account_name": "Имя Аккаунта",
    "show_qr_code": "показать QR Code",
    "do_not_send_2": "Пожалуйста не отправляйте TRX с вашего ERC20 Wallet или Обменника на вышеуказанный адрес Tron Testnet.!",
    "bandwidth": "Пропускная Способность",
    "balance": "Баланс",
    "tron_power": "Tron Power",
    "transactions": "Транзакции",
    "no_transfers": "транзакций нет",
    "no_tokens": "токенов нет",
    "free_bandwidth": "свободная Пропускная Способность",
    "expires": "срок действия истекает",
    "have_been_added_to_your_account": "вашему Аккаунту было добавлено!",
    "information_message_1": "Если вы запросите тестовые Токены TRX, то вы получите 10000 TRX предназначенные для теста в Testnet",
    "information_message_2": "Вы можете запросить TRX только 10 раз на один Аккаунт",
    "request_trx_for_testing": "запросить для теста TRX",
    "token_balances": "Баланс Токена",
    "produced_blocks": "созданные Блоки",
    "voters": "Выбиратели",
    "progress": "Достижения",
    "transactions_count": "{transactions, plural, оne {transaction} other {transactions}}",
    "issuer": "Издатель",
    "network": "Сеть",
    "current": "актуально",
    "trx_received": "принять TRX",
    "test_trx_temporarily_unavailable_message": "TRX для Testnet на данный момент не доступны. Пожалуйста повторить попытку позже еще раз.",
    "not_enough_trx": "не достаточно TRX",
    "information_message_3": "TRX были успешно запрошены. Если вы их ещё не получили, значит на данный момент TRX не доступны в Testnet.Пожалуйста попробуйте позже еще раз.",
    "send_to_following_address": "отправить по следующему Адресу",
    "change_website": "изменить Адресс Website",
    "you_must_enter_url": "Задайте действующий URL",
    "specify_the_url": "Пожалуйста задайте URL Адрес Website",
    /*
    ##################################################################################
    #                                                                                #
    # account freeze                                                                 #
    #                                                                                #
    ##################################################################################
    */
    "freeze": "заморозить",
    "unfreeze": "разморозить",
    "freeze_trx_least": "Вы должны заморозить как минимум один TRX",
    "unable_unfreeze_trx_message": "TRX не может быть разморожен. Причиной могло послужить то, что срок минимальной заморозки не истек.",
    "freeze_trx_premessage_0": `TRX можно заморозить/заблокировать для получения Tron Power и активации дополнительных функий. помощью Tron Power вы сможете например`,
    "freeze_trx_premessage_link": "проголосовать за Супер представителя",
    "freeze_trx_premessage_1": `замороженные TRX будут заблокированы минимум на 3 дня.На протяжении этого времени замороженными TRX нельзя торговать.После окончания минимального срока заморозки вы можете разморозить ваши TRX и снова их использовать.`,
    "trx_amount": "Сумма TRX",
    "token_freeze_confirm_message_0": "я подтверждаю заморозку Токена",
    "token_freeze_confirm_message_1": "минимум на 3 дня",
    "frozen_supply": "Замороженный Баланс",
    "tokens_unfrozen": "разморозить/разблокировать Токен",
    "success_tokens_unfrozen_message": "Токены успешно разморожены",
    "unable_to_unfreeze": "Разморозка не возможна",
    "Unable_tokens_unfrozen_message": "не возможно разморозить Токены",
    "tokens_frozen": "Токены заморожены",
    "successfully_frozen": "ваши TRX успешно заморожены",
    "name_changed": "Имя изменено",
    "successfully_changed_name_to_message": "Имя Вашего Аккаунта успешно изменено на",
    "unable_to_rename_title": "невозможно изменить Имя",
    "unable_to_rename_message": "при обновлении Имени Вашего Аккаунта произошла ошибка, пожалуйста повторите попытку позже.",
    "unfreeze_trx_confirm_message": "Вы уверены, что хотите разморозить TRX ?",
    "unfreeze_assets": "высвободить Активы",
    "sure_to_unfreeze_unlocked_tokens_message": "Вы уверены, что хотите разморозить Токены?",
    /*
    ##################################################################################
    #                                                                                #
    # account superdelegates                                                          #
    #                                                                                #
    ##################################################################################
    */
    "apply_for_delegate": "Выдвижение себя в Делегаты",
    "apply_super_representative_candidate": "Выдвинуть свою кандидатура на Супер представителя",
    "your_personal_website_address": "Ваш персональный Website",
    "apply_for_delegate_predescription": "Каждый обладатель TRX может стать Супер Представителем. Для беспрепятственной и эффективной работы Сети и сообщества, были приняты Стандарты и Условия для становления Супер Представителем. Мы будем поощрять и содействовать притендентов в Супер Представители. Один раз в неделю будут выявлены и опубликованы новые претеденты не Супер Представилей.",
    "apply_for_delegate_description": `Обладатели TRX могут баллотироваться в Супер Представителей, прилагаемую информацию Вы найдете на странице своего Аккаунта. Проголосуйте и выберите одного Кандидата.Каждая Учетная запись Tron может опубликовать информацию о выборах, один Пользователь может проголосовать за нескольких Кандидатов. Максимальное число голосов равно сумме Ваших TRX. Результаты голосования подводятся подсчетом всех отданных голосов. Цикл Голосования повторяется ежедневно с 00:00   до 24:00 часов.Обладатели TRX получившие большинство голосов, будут избраны Супер Представителями. Все транзакции в Сети должны быть подтверждены Супер Представителями,за это они получат вознаграждение в виде TRX. TRX, использованные вами в процессе голосования, не обесцениваются. Они будуи вам возращены на Ваш Аккаунт по завершению Голосования и срока их Блокировки. `,
    "unknown_error": "произошла не известная ошибка",
    "representative_understand": "Я понимаю,как стать Представителем",
    "generate_account": "нажмите сюда,чтобы сгенерировать адрес Вашего Аккаунта и Пароль.",
    "create_account_confirm_1": "Я понимаю,что если я забуду/потеряю мой Пароль,то навсегда утеряю свой Капитал.",
    "create_account_confirm_2": "Я понимаю, что если я забуду/потеряю свой Пароль, никто не сможет мне его восстановить.",
    "create_account_confirm_3": "Я записал свой Пароль на Бумаге",
    "vote_thanks": "Спасибо за Ваше Голосование",
    "recent_transactions": "последняя Транзакция",
    "newest_account": "последний Аккаунт",
    "representatives": "Представитель",
    "most_votes": "большинство Голосов",
    "start_end_time": "Начальное/Конечное Время",
    "scan_qr_code": "сканировать QR код",
    "receive_trx": "получить TRX",
    "require_account_to_send": "Ввойдите на свой Аккаунт, чтобы осуществить Транзакцию",
    "require_account_to_receive": "Войдите на свой Аккаунт, для получения Токена",
    "successful_send": "Успешно отправлено",
    "confirm_transaction": "Подтверждение Транзакции",
    "last_confirmed": "последнее Подтверждение",
    "trx_produced": "Произведенные Транзакции",
    "do_not_send_1": "Не отсылайте с Вашего TRX ERC20 Wallet или Exchange(Обменник/Биржа) на адрес Tron Testnet",
    "go_to_votelist": "назад к списку Голосов",
    "understand_tron_sr_message_0": "Я понимаю Функции и Обязанности Супер Представителя и подтверждаю взятия с меня  комиссии в размере",
    "understand_tron_sr_message_1": "Комиссия",
    "invalid_url": "неверный URL",
    "apply_representative_error_message_0": "при подаче Вашей Кандидатуры в Представители произошла ошибка",
    "apply_representative_error_message_1": "Убедитесь, что у Вас достаточно Средств для Комиссии за полачу Кандидатуры, или повторите еще раз.  ",
    "open_external_link": "вы открываете внешнюю ссылку",
    "private_key_untrusted_website_message_0": "Никогда не задавайте Ваш Личный Ключ на не оказывающем доверия  Website",
    "no_official_tron_website": "не официальная страница Tron",
    "continue_to_external_website": "дальше на внешний Website",
    "url_changed": "URL адрес успешно изменен",
    "successfully_changed_website_message": "Адресс Website успешно изменен",
    "unable_to_change_website_title": "невозможно изменить Адресс URL",
    "unable_to_change_website_message": "при обновлении Website произошла ошибка, повторите позже еще раз.",
    "successfully_linked_github": "успешно соеденено с Github",
    "github_linked": "Github добавлен",
    "unable_to_link_github_message": "невозможно соединиться с Github, повторите позже еще раз.",
    "could_not_link_github": "не удалось соединться с Github",
    "enter_your_github_username": "Введите имя пользователя Github",
    "link_to_github": "войдите на Github",
    "link_github": "ссылка на Github",
    "you_must_enter_a_url": "пожалуйста введите Адрес URL",
    "success": "Успешно",
    "successfully_appied_sr_canidate_message_0": "вы успешно выдвинули свою кандидатуру в Супер Представители",
    "successfully_appied_sr_canidate_message_1": "Ваш Аккаунт будет скоро обнавлен",
    "landing_page": "Главная Страница",
    "show_more_information_publish_sr_page": "следующую информацию по созданию Вашей Главной Странице вы найдете здесь",
    "create_sr_landing_page_message_0": "Супер Представители могу создать Личную страницу, чтобы опубликовать больше информации о своей команде и планах.",
    "set_github_url_message_0": "Если Вы уже создали и настроили Github-Template, то Вы можете её добавить введя в этом окне Ваш Github-Template URL.",
    "set_github_link": "указать ссылку Github",
    "could_not_claim_rewards": "не удалось определить Вознаграждение",
    "claim_rewards_error_message": "При запросе Вознаграждения возникла ошибка, пожалуйста повторите позже еще раз.",
    "rewards_claimed": "Запрос Вознаграждения!",
    "successfully_claimed_rewards": "Вознаграждение успешно получено",
    "claim_rewards": "запросить Вознаграждение",
    "sr_receive_reward_message_0": "Как Представитель вы получаете Вознаграждение за создание Блоков(Blockchain). Эти Вознаграждения начисляются каждые 24 часа.",
    "intro": " Введение",
    "budget_expenses": "Бюджет/Расходы",
    "server_configuration": "Конфигурация Сети",
    "community_plan": "Планы Сообщества",
    "team": "Команда",
    /*
    ##################################################################################
    #                                                                                #
    # token creation formular                                                        #
    #                                                                                #
    ##################################################################################
    */
    "name_of_the_token": "Название Токена",
    "token_message": "Название для Токена",
    "token_abbr": "Аббривиатура Токена",
    "abbr_message": "Аббривиатура для Токена",
    "total_supply": "Общее Колличество",
    "issued_token": "выпущенные Токены",
    "create_token": "Создать Токен",
    "description": "Описание",
    "description_url": "Описание URL",
    "quote_token_amount": "Сумма Токена",
    "base_token_amount": "Базовая Сумма Токена",
    "creating_a_token": "создать Токен",
    "available": "доступно",
    "testnet": "Testnet",
    "days_to_freeze": "Длительность Заморозки/Блокировки",
    "trx_token_fee_message": "Для создания нового Токена вам понадобится 1024 TRX",
    "trx_token_account_limit": " На один Аккаунт можно создать только один Токен",
    "trx_token_wallet_requirement": "Для того, чтобы создать Токен, Вам необходимо Завести/Открыть Wallet",
    "invalid_address": "неверный Адрес",
    "insufficient_tokens": "не достаточно Токенов",
    "fill_a_valid_number": "Пожалуйста звведите правильное число",
    "fill_a_valid_address": "Пожалуйста введите верный Адрес",
    "make_another_transaction": "выполнить следующую транзакцию",
    "token_exchange_confirm": "Я подтверждаю,что на расходуя(Сумма TRX), я получаю за это (Сумма Токенов) Токен.",
    "An_unknown_error_occurred,_please_try_again_in_a_few_minutes": "Произошла неизвестная ошибка,пожалуйста повторите попытку через несколько минут",
    "An_error_occurred": "Произошла Ошибка",
    "create_a_token": "Создание Токена",
    "not_started_yet": "еще не началось",
    "participated": "Вы успешно приняли участие!",
    "participated_error": "произошла Ошибка",
    /*
    ##################################################################################
    #                                                                                #
    # token participate                                                              #
    #                                                                                #
    ##################################################################################
    */
    "buy_confirm_message_0": " Вы уверены?",
    "how_much_buy_message": "сколько Токенов вы хотите купить",
    "buy_confirm_message_1": "Вы уверены, что хотите купить",
    "for": "для",
    "insufficient_trx": "недостаточно TRX",
    "not_enough_trx_message": "не достаточно TRX, для покупки такого количества Токенов",
    "ends": "заканчивается через",
    "starts": "начинается через",
    "can_be_unlocked": "будет разблокировано через",
    /*
    ##################################################################################
    #                                                                                #
    # global messages                                                                #
    #                                                                                #
    ##################################################################################
    */
    "address_warning": "Пожалуйста убедитесь в верности Адресса Walletю Ввод неверного Адреса может привести к потере TRX.",
    "search_address_or_url": "Поиск по Адрессу или URL",
    "the_lunch_test": "Цель Testnet проверить работоспособность вашего Blockchain Explorer и Wallet.",
    "please_keep_in_mind": "Пожалуйста обратите внимание на то, что Адресс вашего зарегистрированного Аккаунта предназначено только для Testnet",
    "tron_foundation": "TRON Foundation",
    "trx_for_testing": "Как только вы войдете в вашу Учетную запись, вы сможете использовать Токены TRX в Testnet",
    "dear_users": "Уважаемый Пользователь,",
    "finished": "закончено",
    "token": "Токены",
    "url": "URL",
    "need_to_login": "Для использования вашего Аккаунта, вам необходимо авторизоваться",
    "thanks_for_applying": "Спасибо за Балотирование!",
    "to_much_votes": "Вы привысили максимальное число Голосований",
    "no_trx_remaining": "нет больше TRX",
    "show_more": "показать следующие",
    "vote_guide_message": `Используйте Ваши TRX для выбора Супер Представителей  За каждый Токен на вашем счету вы получите Голос который Вы можете отдать. При этом ваши TRX не будут утеряны.Вы можете выбирать наиболее понравившихся вам Кандидатов. Конечный Результат будут известен в 24 часа и список Кандидатов будет обновлен.`,
    "search_address": "Искать по Адресу",
    "token_transactions": "Транзакции Токена",
    "token_holders": "Владелец Токена",
    "nr_of_Transfers": "количество Транзакций",
    "not_signed_in": "Вы должны авторизоваться для того, чтобы использовать возможности",
    "loading_map": "Карта загружается",
    "loading_accounts": "Аккаунт загружается",
    "quantity": "Колличество",
    "percentage": "Процентное соотношение",
    "loading_token": "Загрузка Токена",
    "voter_percentage": "доля голосов в процентах",
    /*
    ##################################################################################
    #                                                                                #
    # transaction information                                                        #
    #                                                                                #
    ##################################################################################
    */
    "no_transactions_found": "транзакции не найдены",
    "no_tokens_found": "Токены не найдены",
    "no_blocks_found": "Блоки не найдены",
    "no_votes_found": "Голоса не найдены",
    "no_voters_found": "Избератели не найдены",
    "waiting_for_transactions": "Ожидание Тразакции",
    "loading_address": "Загрузка Адреса",
    /*
    ##################################################################################
    #                                                                                #
    # token creation - default messages                                              #
    #                                                                                #
    ##################################################################################
    */
    "details": "Детали",
    "issue_a_token": "Создание Токена",
    "issue_token": "Выпуск Токена",
    "token_name": "название Токена",
    "total_issued": "уже создано",
    "registered": "зарегистрирован",
    "abbreviation": "Аббривиатура",
    "exchange_rate": "Обменный курс",
    "token_price": "Стоимость Токена",
    "supply_message": "Общее количество Токенов находящиеся в обороте",
    "description_message": "короткое описание Применения/Назначения Токена",
    "url_message": "Укажите URL Адрес для получения дополнительной информации о Токене",
    "exchange_rate_message_0": "Задайте стоимость одного Токена, указывающую Участнику количество покупаемых Токенов за 1 TRX",
    "exchange_rate_message_1": "Партнеры получают",
    "exchange_rate_message_2": "для каждого",
    "exchange_rate_message_3": "TRX",
    "participation_message_0": "Укажите временной период выпуска Токена. Втечение этого времени участники могут обменять TRX на",
    "participation_message_1": "обменять Токен",
    "frozen_supply_message_0": `Определенная часть при создании может быть заморожена. Минимальный срок составляет 1 день.Замороженная часть может по достяжению даты старта и периоду заморозки (дней как долго они были заморожены) в ручную быть разморожена и разблокирована. Заморозка Токена не обязательна.`,
    "token_issued_successfully": "Токены были успешно выпущены",
    "participation": "Учавствовать",
    "start_date": "Дата начала",
    "end_date": "Дата окончания",
    "token_spend_confirm": "Я соглашаюсь с тем, что создание Токена будет мне стоить разово 1024 TRX",
    "token_issue_guide_message_1": `создание и выпуск Токена на TRON-Protokolls может быть осуществлено каждым пользователем, имеющим на счету минимум 1024 TRX.`,
    "token_issue_guide_message_2": `Пользователи в течение определенного времени могут принимать участие и обменивать свои TRX на Токены`,
    "token_issue_guide_message_3": `После создания Токенов они будут начислены на Ваш счет. Если пользователи TRX обмениваются на созданные вами Токены,вам на счет будет зачислена их стоимость. В тоже время списаны вами созданные Токены. `,
    /*
    ##################################################################################
    #                                                                                #
    # token creation - error messages                                                #
    #                                                                                #
    ##################################################################################
    */
    "date_error": "Дата окончания стоит до Даты начала или неверна. ",
    "no_name_error": "Нужно указать название Токена",
    "no_supply_error": "Колличество выпускаемых Токенов должно быть больше одного",
    "coin_value_error": ",Колличество Токена должно быть более одного",
    "tron_value_error": "Колличество TRX за Токен должно быть больше одного.",
    "invalid_starttime_error": "Начальная Дата не верна",
    "invalid_endtime_error": "Конечная Дата не верна",
    "no_description_error": "Описание обязательно",
    "no_url_error": "Web URL адрес обязателен",
    "past_starttime_error": "Дата начала находится в прошлом",
    "no_transactions": "нет транзакций",
    "errors_in_form": "Поле для заполнения содержит ошибку",
    "token_link_message_0": "Токен поступит на",
    "token_link_message_1": "Страница Токена",
    "token_link_message_2": "будет доступно через пару минут",
    "description_error_message_0": "Описание Токена не может привышать 200 Символов",
    "token_creation_error": "При создании Токена произошла ошибка",
    "tokenname_error_message_0": "Название Токена не может привышать 32 Символа",
    "tokenname_error_message_1": "Название Токена может состоять только из Символов a-Z",
    "abbreviation_required": "Укажите Аббривиатуру",
    "abbreviation_error_message_0": "Аббривиатура не может быть длиннее 5 Символов",
    "abbreviation_error_message_1": "Аббривиатура может состоять только из Символов a-Z",
    /*
    ##################################################################################
    #                                                                                #
    # representatives section                                                        #
    #                                                                                #
    ##################################################################################
    */
    "highest_productivity": "наибольная Продуктивность",
    "lowest_productivity": "наименьшая Продуктивность",
    "Super Representatives": "Супер Представители",
    "Super Representative Candidates": "Кандидаты в Супер Представители",
    "loading_representatives": "посмотреть Представителя",
    "address_not_super_representative": "Это Адрес данного Супер Представителя",
    "unable_load_representatives_page_message": "не удается загрузить Сайт, или Ссылка не верна, или данная Страница еще не работает",
    "loading_representative": "посмотреть Кандидата",
    /*
    ##################################################################################
    #                                                                                #
    # markets section                                                                #
    #                                                                                #
    ##################################################################################
    */
    "average_price_usd": "средняя цена в USD",
    "average_volume_usd": "средний объем в USD",
    "Trade Volume": "Объем Транзакций в USD",
    "rank": "Рейтинг",
    "pair": "торгующаяся пара",
    "volume": "Объем",
    "usd": "USD",
    "average_price": "средняя цена",
    "click_the_chart_title_to_find_more": "нажмите на Заголовок Диаграммы, для просмотра полной иформации",
    /*
    ##################################################################################
    #                                                                                #
    # votes section                                                                  #
    #                                                                                #
    ##################################################################################
    */
    "next_round": "следующее Голосование",
    "total_votes": "всего Голосов",
    "most_ranks": "наивыйший Рейтинг в этом цикле",
    "view_ live _ranking": "Просмотр Рейтинга(live)",
    "open_team_page": "открыть страницу Команды",
    "warning_votes": "Для участия в Голосовании Вам нужен минимум 1 TRON Power",
    "account_page": "Страница Аккаунта",
    "loading_votes": "Голоса будут загружены",
    "3_day_ranking": "Рейтинг за 3 дня (Топ 10)",
    "live_ranking": "Live Рейтинг  ",
    "live_ranking_msg": "Список обновляется каждые 15 Секунд. Время учета Голования составляет 1-2 минуты.",
    "candidate": "Кандидат",
    "current_votes": "Голосование в реальном времени",
    "click_to_start_voting": "нажмите сюда, чтобы проголосовать",
    "votes_remaining_message": "Оставшиеся Голоса",
    "open_wallet_start_voting_message": "Чтобы принять участие в Голосовании необходим Wallet",
    "thanks_submitting_vote_message": "Большое спасибо за ваше голосование",
    "need_min_trx_to_vote_message": "для участия в голосовании необходимо иметь как минимум 1 TRX",
    "to_much_votes_massage": "Вы отдали слишком много голосов",
    "all_votes_are_used_message": "Все голоса отданы",
    "submissing_vote_message_title": "Большое Спасибо за Ваше участие",
    "submissing_vote_message_0": "Ваше личное голосование принято и будет учтено в следующем цикле",
    "submissing_vote_message_1": "Вы имеете возможность постоянно использовать уже отданные голоса",
    "submitting_vote_error_message": "Во время голосования произошла ошибка. Пожалуйста повторите попытку позже.",
    "loading_super_representatives": "Загрузка Супер Представителя",
    /*
    ##################################################################################
    #                                                                                #
    # transaction Viewer                                                             #
    #                                                                                #
    ##################################################################################
    */
    "info_tx_viewer": "Введите желаемый hex транзакции и проверьте информацию о ней. После чего тразакция может быть осуществлена",
    "load_tx": "Загрузка Транзакции",
    "tx_qrcode": "QR Code Транзакции",
    "load_tx_qrcode": "Загрузка Транзакции через QR Code",
    "transaction_load_error": "Ошибка Загрузки Транзакции",
    "transaction_load_error_message": "При загрузки Транзакции произошла ошибка. Убедитесь в правильности формата HEX ",
    "transaction_success_message": "Транзакция успешно осуществлена",
    "transaction_success": "Транзакция выполнена",
    "transaction_error_message": "При выполнении Транзакции произошла ошибка",
    "transaction_error": "Ошибка Транзакции",
    "confirm_transaction_message": "Вы уверены, что хотите осуществить транзакцию?",
    "broadcast_transaction_to_network": "Осуществление Транзакции в Сеть",
    /*
    ##################################################################################
    #                                                                                #
    # tools node tester                                                              #
    #                                                                                #
    ##################################################################################
    */
    "node_tester_msg": "задайте действующий IP testingАдресс для тестовой проверки GRPC",
    "node_tester_stop": "Остановить Тест",
    "node_tester_test": "Начать Тест GRPC",
    "node_tester_rt": "Время Ответа",
    "confirmed_block": "подвержденный Блок",
    "loading": "Загрузка",
    "connection_node": "Connecting to Node",
    /*
    ##################################################################################
    #                                                                                #
    # tools scanner                                                                  #
    #                                                                                #
    ##################################################################################
    */
    "no_webcam_found": "Web Камера не найдена",
    "trying_enable_webcam_message_0": "Ошибка при подключении Web Камеры",
    "trying_enable_webcam_message_1": "Убедитесь, что прибор имеет разрешение на использование Камеры.",
    /*
    ##################################################################################
    #                                                                                #
    # help section                                                                   #
    #                                                                                #
    ##################################################################################
    */
    "what_is_tron": "TRON whitepaper V2.0",
    "tron_explorer_api": "Tron Explorer API",
    "tron_architechure": "TRON Architecture",
    "tron_protobuf_doc": "TRON Protobuf Doc",
    "report_an_error": "сообщить об   Ошибке/Предложении",
    "frequently_asked_questions": "часто задаваемые Вопросы",
    "telegram_updates": "информация на Telegram",
    /*
    ##################################################################################
    #                                                                                #
    # wallet section                                                                 #
    #                                                                                #
    ##################################################################################
    */
   "open_wallet": "Sign in",
    "private_key": "Private Key",
    "keystore_file": "Keystore File",
    "select_file": "выбрать File",
    "login_mobile": "авторизоваться с мобильным устройством",
    "create_wallet": "создать Wallet",
    "no_open_wallet": "Wallet не доступен",
    "new_wallet": " создать новый Wallet",
    "password_encr_key_message_0": "этот пароль защищает Ваш Private Key. Он не будет использоваться в генерации вашего Ключа",
    "password_encr_key_message_1": ",для авторизации Вам необходим этот пароль и и Ваш Private Key",
    "strong_password_info": "необходим защитный пароль",
    "save_keystore_file": "сохраните Ваш Keystore File",
    "download_keystore_file": ",Скачайте зашифрованный Keystore File",
    "do_not_lose_it": "не теряйте его",
    "do_not_lose_it_message_0": "TRON Foundation не сможет восстановить ваш утерянный пароль",
    "do_not_share_it": "не делитесь им",
    "do_not_share_it_message_0": "не показывайте и не передовайте не кому этот файл и используйте его для авторизации только на официальной странице TRON. Иначе это может привести к потере Вашего имущества.",
    "make_a_backup": "создайте backup",
    "make_a_backup_message_0": "На тот случай, если Ваш компьютер выйдет из строя и Вы не сможете воспользоваться вашими данными.",
    "save_private_key": "сохраните пароль",
    "print_paper_wallet": "распечатайте пароль на бумаге",
    "new_wallet_ready_message": "Ваш новый Wallet создан",
    "go_to_account_page": "назад на страницу Аккаунта",
    "login_first": "Login to the Wallet first",
    "contract_name": "Contract Name",
    "compiler": "Compiler",
    "tx_count": "Tx Count",
    "setting": "Setting",
    "date_verified": "Date Verified",
    "compiler_version": "Compiler Version",
    "creator": "Creator",
    "verify_contract_code": "Verify Contract Code",
    "buy_tokens": "Buy Tokens",
    "fill_a_valid_private_key": "Please fill a valid private key",
    "confirm_private_key": "Confirm Private Key",
    "transfer_confirm_info": "Are you sure you want to transfer",
    /*
    ##################################################################################
    #                                                                                #
    # blockchain block                                                                #
    #                                                                                #
    ##################################################################################
    */
    "hash": "hash",
    "time": "Время",
    "parenthash": " Parenthash",
    "size": "последний Блок",
    "blockchain_size": "размер Blockchain",
    /*
    ##################################################################################
    #                                                                                #
    # ledger help page                                                               #
    #                                                                                #
    ##################################################################################
    */
    "ledger_guide": "Руководство Ledger",
    "requirements": "Требования",
    "using_ledger_steps_message_0": "Вы должны выполнить следующии требования, для применения Ledger на Tronscan",
    "a": "в первыую очередь Вам нужно",
    "install_the": "Установите",
    "app": ",Преложение",
    "install_latest_version_message_0": "установите последнюю версию",
    "opening_your_wallet": "откройте Ваш wallet",
    "open_the_tronscan_desktop_client": "откройте Tronscan Desktop",
    "click_open_wallet_top_right": "нажмите на кнопку Открыть Wallet в верху справа",
    "choose_ledger": "выберите раздел меню Ledger",
    "connect_unlock_ledger_with_pin": "соединитесь и разблокируйте Ваше устройство с помощью пин кода",
    "open_tron_app_on_ledger": "откройте приложение Tron на Вашем Ledger",
    "ledger_connected_tronscan_message_0": "если Ваш ledger соединился с приложением TronЮ то вы увидите сообщение: соединение выполнено",
    "click_on_open_wallet": "нажмите на кнопку «Открыть Wallet»",
    "redirect_to_your_wallet_message": "Вы будуту перенаправлены на Ваш Wallet и сможете увидеть ваш Tron Адрес",
    "using_ledger_to_sign_transactions": "Использование Ledger для подписи транзакций",
    "using_ledger_to_sign_transactions_message_0": "Убидитесь, что Ledger подключен и приложение Tron открыто, во время использования Tronscan Desktop и для подписывания транзакций",
    "using_ledger_to_sign_transactions_message_1": "Tronscan подскажет Вам о необходимости подписания транзакции через всплывающее окно с информацией о транзакции. Подписи требуются при голосовании,отправки TRX, изменения имени аккаунта и т.д.",
    /*
    ##################################################################################
    #                                                                                #
    # userinfo - popup notification                                                  #
    #                                                                                #
    ##################################################################################
    */
    "record_not_found": "запись не найдена!",
    "warning": "Предупреждение",
    "login_success": "Успех в Интернете",
    "logout_success": "Выход из системы",
    /*
    ##################################################################################
    #                                                                                #
    # blockchain - Live                                                              #
    #                                                                                #
    ##################################################################################
    */
    "applied_for_super_representative": "applied for Super Representative",
    "sr_candidature": "Super Representative Candidature",
    "created_token": "created token",
    "token_creation": "Token Creation",
    "bought": "bought",
    "voter": "voter",
    "voting": "voting",
    "asset": "asset",
    "token_transfer": "Token Transfer",
    /*
    ##################################################################################
    #                                                                                #
    # buy Tron                                                                       #
    #                                                                                #
    ##################################################################################
    */
    "buy_tron": "Buy TRON",
    "buy_tron_message_0": "TRX can be purchased directly with Fiat or other Crypto-Currencies without a stock exchange. It uses a service from Changelly.com and is the easiest and fastest way to purchase trx. A list of supported currencies and a FAQ can be found at ",
    "buy_tron_using_changelly": "Buy TRON using Changelly",
    "cant_load_widget": "Can't load widget",
    /*
    ##################################################################################
    #                                                                                #
    # new variables                                                                  #
    #                                                                                #
    ##################################################################################
    */
    "date": "Дата",
    "total_transactions": "Общее количество транзакций",
    "avg_blockTime": "средняя продолжительность блоков",
    "avg_blockSize": "средний размер блока",
    "total_BlockCount": ", Общее количество блоков",
    "new_address_seen": "последние созданные адреса",
    "transfer_contract": "Договор транзакции",
    "TRX_transfer_between_addresses": "Перевод TRX между следующими адресами",
    "transfer_asset_contract": "Договор транзакции Asset",
    "token_transfer_between_addresses": "Перевод Токена  между следующими адресами",
    "participate_asset_issue_contract": "Participate-Asset-Issue-Договор",
    "participate_token_between_addresses": "обменять Токен между следующими адресами",
    "witness_update_contract": "Свидетели обновленя договора",
    "updates_a_witness": ",обновление свидетелей",
    "witness_create_contract": "Свидетели заключения Договора",
    "create_a_witness": "создать свидетеля",
    "account_update_contract": "Договор обновления аккаунта",
    "update_account_name": "обновить аккаунт",
    "withdraw_balance_contract": "договор снятия Баланса",
    "withdraw_balance": "снять Баланс",
    "freeze_balance_contract": "Договор замоозки Баланса",
    "freeze_TRX": "заморозить TRX",
    "unfreeze_balance_contract": "Договор разморозки Баланса",
    "unfreeze_TRX": "разморозить TRX",
    "vote_witness_contract": "Договор о голосовании",
    "vote_for_a_witness": "Голосование за Свидетеля",
    "asset_issue_contract": "Договор о выпуске Токена",
    "issue_a_new_asset": "выпустить новый Токен",
    "owner_address": "Адресс Владельца",
    "frozen_balance": "замороженный Баланс ",
    "frozen_days": "Деи Заморозки",
    "counts": "общее колличество",
    "TRX_exchange_rate": "TRX Обменный курс",
    "start_time": "время начала",
    "end_time": "время окончания",
    "contracts": "Договоры",
    "search_description": "поиск по Адресу,Блоку,Транзакции Hash, названию Токена",
    "search_description1": "Поиск Адреса, Блока, Транзакции, Токена",
    "transaction": "транзакция",
    "total_addresses": "всего адресов",
    "daily_increment": "прирост за День",
    "address_growth_chart": "статистика адресов",
    "addresses_amount": "Колличество адресов",
    "past_14_days_of_transactions": "Трнзакции за последние 14 дней",
    "address_growth": "всего Адресов TRX",
    "power": "Power",
    "token_transfers": "трансфер Токена",
    "website_url": "Website URL",
    "search": "Поиск",
    /*
      ##################################################################################
      #                                                                                #
      # new variables    20180822 17:11:52                                                              #
      #                                                                                #
      ##################################################################################
    */
    "tron_convert_tool": "Encode Convert Tool",
    "breakdown_supply_types": "Breakdown By Supply Types",
    "genesis": "Genesis",
    "TRX_distribution_overview": "TRX DISTRIBUTION OVERVIEW",
    "block_produce_rewards": "Block Produce Rewards",
    "node_rewards": "Node Rewards",
    "independence_day_burned": "Independence Day Burned",
    "fee_burned": "Fee Burned",
    "current_total_supply": "Current Total Supply",
    "foundation_freeze": "Foundation Freeze",
    "price_per_1000_trx": "PRICE PER 1000 TRX",
    "in_USD": "In USD",
    "in_BTC": "In BTC",
    "total_TRX_supply": "Total TRX Supply",
    "market_capitalization": "Market Capitalization",
    "circulating_supply": "Circulating Supply",
    "list_trx": "List TRX",
    "burned_trx": "TRX Burned",
    "supply_notes": "Crowdsale and pre-sale available globally, except in the US, China, and Japan",
    "14_day_transaction_history": "14 day Transaction History",
    "14_day_address_growth": "14 day Address Growth",
    /*
      ##################################################################################
      #                                                                                #
      # ICO--rating page                                                              #
      #                                                                                #
      ##################################################################################
    */
    "TRONRating": "TRON Token Rating",
    "rating_title": "Tronscan Token Reputation System",
    "modify_on": "Modified on",
    "rating_description": "The Tronscan Reputation System aims at helping users to understand, differentiate and assess different tokens. When you visit the token page, the Reputation is classified into 5 categories:",
    "rating_status_1": "Review Pending",
    "rating_status_1_desc_a": "Not yet reviewed",
    "rating_status_2": "OK",
    "rating_status_2_desc": "An “OK” Reputation is not an endorsement or recommendation, but meets the following criteria:",
    "rating_status_2_desc_a": "Provide sufficient and accurate information",
    "rating_status_2_desc_b": "Has precise project goals and communication channels",
    "rating_status_2_desc_c": "Accessible information of the project founders/ investors/ consultants",
    "rating_status_2_desc_d": "The token is traded/listed on a cryptocurrency exchange with AML/KYC inspection",
    "rating_status_2_desc_e": "ICO has been completed or active for no less than 3 months",
    "rating_status_2_desc_f": "A major milestone has been achieved",
    "rating_status_3": "Neutral",
    "rating_status_3_desc": "A 'neutral' Reputation means that the information about the project and the team is relatively transparent.",
    "rating_status_3_desc_a": "Provide necessary and sufficient information (official website, logo, official contact email, white paper)",
    "rating_status_3_desc_b": "A professional public profile of team members and consultants is posted online (Indicate the project in LinkedIn Personal Profile)",
    "rating_status_3_desc_c": "Provide social media materials",
    "rating_status_4": "Insufficient Information",
    "rating_status_4_desc_a": "Has not provided necessary and sufficient information (official website, logo, official contact email, white paper)",
    "rating_status_4_desc_b": "There is no information showing that the project has ongoing operational progress",
    "rating_status_5": "False Information",
    "rating_status_5_desc_a": "Use false identity to issue token",
    "rating_status_5_desc_b": "There is information indicating that the fraud/phishing/fraud/spamming or misrepresentation behavior related to this token has not been properly handled, or the token has other 'dangerous' signs.",
    "rating_disclaimer": "DISCLAIMER",
    "disclaimer_desc_1": "Tronscan does not endorse, approve or condemn any services or projects related to the token contracts displayed on the Tronscan. Users should always conduct research with due diligence before taking any action related to the token, especially when it comes to value investing.",
    "disclaimer_desc_2": "Reputation associated with this service may or may not be accurate as they are based on subjective evaluations and/or reports from the community. We take no sides, nor do we guarantee or conduct any level of responsibility/accuracy/reliability evaluation; our reputation evaluation cannot be deemed as any behavioral advice, especially investment advice.",
    "disclaimer_desc_3": "We reserve the right to interpret the symbolic reputation of the token on this page, and we are not obligated to provide any feedback for the refusal. We reserve the right to delete or update information (including reputation) once there is falseness or discrepancies of the information.",

    /*
    ##################################################################################
    #                                                                                #
    # ICO--myToken page                                                              #
    #                                                                                #
    ##################################################################################
  */
    "my_token": "My Token",
    "my_token_desc_1": "The information related to the token will be displayed on the token page. Each token based on the comprehensiveness and authenticity of the information will get a",
    "tron_rating": "Token Reputation",
    "my_token_desc_2": "If you need to update your information, please send the updates using the following Excel template to token@tronscan.org via your company email or certified email with necessary credentials.",
    "brief_info": "Brief Introduction",
    "website_official": "Official website",
    "white_paper": "White Paper",
    "GitHub": "GitHub",
    "country": "Country/Region",
    "social_link": "Social Media Link",
    "download_excel": "Download the template",
    "no_message": "N/A (Please send an email to complete this information)",
    "insufficient_message": "Insufficient information",
    "token_detail": "Token Detail",
    "contact_us": "Contact us",
    "my_token": "My Token",
    "try_later": "Please try it later",
    "contract_address": "Contract Address",

    /*
  ##################################################################################
  #                                                                                #
  # ICO--create token page                                                         #
  #                                                                                #
  ##################################################################################
  */
    "basic_info": "Basic Information",
    "basic_info_desc": "Token basic information ",
    "exchange_setting": "Issuance Setting",
    "exchange_setting_desc": "Set the issuing price and time frame for tokens",
    "freeze_setting": "Frozen Setting",
    "freeze_setting_desc": "Freeze part of the tokens for a period of time",
    "confirm_setting": "Confirm Setting",
    "confirm_setting_desc": "Confirm all your information",
    "token_logo": "Token LOGO",
    "image_restraint_desc": "resolution 1:1, suggested format jpg/png",
    "prev_step": "Previous",
    "freeze_on": "ON",
    "freeze_off": "OFF",
    "freeze_not_valid": "Freeze function off",
    "no_logo_error": "no logo found",
    "confirm_issue_info": "Please make sure that the following information is correct, as the smart contract cannot be modified once it is written into the block chain.",
    "tick_checkbox": "Need to tick the Checkbox",
    "change_info": "If the information is not correct, please",
    "total": "total",
    "a_totle": "A Total of",
    "transaction_info": "transactions found",
    "hold_addr": "Token Holders",
    "transactions_unit": "Transactions",
    "transfers_unit": "Transfers",
    "block_unit": "Blocks",
    "record_unit": "Transactions",
    "token_unit": "Tokens",
    "vote_unit": "candidates",
    "voter_unit": "Voters",
    "account_unit": "accounts",
    "address_unit": "addresses",
    "contract_unit": "verified contract source codes found",
    "inter_contract_unit": "Internal Transactions found",

    /*
  ##################################################################################
  #                                                                                #
  # ICO--participate page                                                         #
  #                                                                                #
  ##################################################################################
  */

    "issue_progress": "Progress",
    "fund_raised": "Fund Raised",
    "issuing_price": "Issuing Price",
    "buy_token_info": "How much tokens do you want to buy?",
    "reputation": "Reputation",
    "issue_time": "Issuing Time ",
    "success_receive": "Successfully received",
    "circulating_supply": "Circulating Supply",
    "issue_info": "Issuance Info",
    "transferring": "In progress",
    "in_progress": "In progress",
    "fail_transaction": "Transaction failed",
    "records": "Records",
    "part_total": "A total of ",
    "part_pass": "tokens found",
    "view_total": "A Total of",
    "view_pass": "Tokens to participate",
    "token_overview_tron": "Overview of TRON token market",
    "token_participate_tron": "Participate in TRON token issuance",
    "not_started": "Not started",
    "no_token_to_buy": "Sorry, all the circulating supply has been issued, please wait the tokens to be unfrozen to participate.",

    /*
    ##################################################################################
    #                                                                                #
    # contract page                                                                  #
    #                                                                                #
    ##################################################################################
    */

    "Code": "Code",
    "contract_overview": "Contract Overview",
    "trx_value": "TRX Value",
    "token_tracker": "Token Tracker",
    "contract_creator": "Contract Creator",
    "at_txn": "at txn",
    "token_txns": "Token Txns",
    "Events": "Events",
    "TxHash": "TxHash",
    "Internal_Txns": "Internal Txns",
    "ParentTxHash": "ParentTxHash",
    "TxFee": "[TxFee]",
    "contract_code_verified": "Contract Source Code Verified (Exact Match)",
    "Contract_ABI": "Contract ABI",
    "Byte_code": "Byte code",
    "Constructor_Arguments": "Constructor Arguments (ABI-Encoded and is the last bytes of the Contract Creation Code above) ",
    "Copy": "Copy",
    "TxHash_Block_Age": "TxHash | Block | Age",
    "Method": "Method",
    "Event_Logs": "Event Logs",
    "With_Verified_Source_Codes_Only": "With Verified Source Codes Only",
    "verified_contract_source_codes_found": " verified contract source codes found",
    "contract_source_codes_found": " contracts found",
    "ContractName": "ContractName",
    "TxCount": "TxCount",
    "Settings": "Settings",
    "DateVerified": "DateVerified",
    "Compiler": "Compiler",
    "Compiler_Text": "Compiler Text",
    "Contract_Internal_Transactions": "Contract Internal Transactions",
    "Internal_Transactions_found": "Internal Transactions found",
    "Misc": "Misc",
    "Optimization_Enabled": "Optimization Enabled",
    "Normal_Transactions": "Normal Transactions",
    "Verified_contracts": "verified contracts",
    "Constructor_Arguments_tip": "Constructor Arguments",

    /*
    ##################################################################################
    #                                                                                #
    # new variables    2018-09-11 12:51:31                                           #
    #                                                                                #
    ##################################################################################
    */
    "pice_per_1trx": "Price",
    "tron_power_freezing": "TRON power can be gained through freezing TRX, 1 TRX for 1 TRON power.",
    "HighChart_tip": "Click and drag in the plot area to zoom in",
    "general_information": "General Information",
    "blockchain_information": "Blockchain Information",
    "sr_information": "SR Information",
    "currency_information": "Currency Information",
    "your_vote": "Your vote",
    "total_number_frozenTRX": "Total number of frozen TRX",
    "tronics_support_planTRX": "TRX frozen by the Tronics Support Plan",
    "frozen_by_the_foundationTRX": "TRX frozen by the Foundation",
    "tronics_support_plan": "Tronics Support Plan",
    "tronics_support_plan_recipient_address": "Tronics Support Plan recipient address",
    "update_token": "Update Token",
    "total_frozen": "Foundation Reserve",
    "account_create_contract": "Account Create Contract",
    "account_create": "Create account",
    "create_from_address": "Initiate Contract Address",
    "create_to_address": "Created Account Address",
    "proposal_create_contract": "Proposal Create Contract",
    "proposal_create": "Create proposal",
    "block_not_found": "Sorry, the block could not be found.",
    "transaction_not_found": "Sorry, the transaction could not be found.",
    "search_not_found": "Sorry, the search string you entered could not be found.",
    "available_balance": "Available Balance",
    /*
      ##################################################################################
      #                                                                                #
      # verify-contract-code                                          #
      #                                                                                #
      ##################################################################################
      */
    "contract_source_code": "Contract Source Code",
    "bytecode_and_ABI": "ByteCode And ABI",
    "verify_and_publish_your_solidity_source_code": "Verify and Publish your Solidity Source Code",
    "step": "Step",
    "step_1": "Enter your Contract Source Code below.",
    "step_2": "If the Bytecode generated matches the existingCreation Address Bytecode, the contract is then Verified.",
    "step_3": "Contract Source Code is published online and publicably verifiable by anyone.",
    "contract_notes": "NOTES",
    "contract_notes_1": "To verify Contracts that accept Constructor arguments,please enter the ABI-encoded Arguments in the box below.",
    "contract_notes_2_1": "For debugging purposes if it compiles correctly at",
    "contract_notes_2_2": " TRON studio",
    "contract_notes_2_3": ", it should also compile correctly here.",
    "contract_notes_3": 'We do not support contract verification that use "imports" up to now.',
    "contract_notes_4": "We do not support contract verification for contracts created by another contract.",
    "contract_notes_5": "There is a timeout of up to 45 seconds for each contract compiled. If your contract takes longer than this we will not be able to verify it.",
    "contract_notes_6": "More functions are coming in the next version.",
    "contract_address": "Contract Address",
    "contract_optimization": "Optimization",
    "enter_contract_code": "Enter the Solidity Contract Code below",
    "following_optional_parameters": "The following are optional Parameters",
    "constructor_arguments_ABIencoded": "Constructor Arguments ABI-encoded (For contracts that accept constructor parameters)",
    "contract_library_address": "Contract Library Address (For contracts that use libraries, supports up to 5 libraries):",
    "library_1_name": "Library_1 Name",
    "library_2_name": "Library_2 Name",
    "library_3_name": "Library_3 Name",
    "library_4_name": "Library_4 Name",
    "library_5_name": "Library_5 Name",
    "library_contract_address": "Library Contract Address",
    "verify_and_publish": "Verify And Publish",
    "txn": "txn",
    "contract_name_tip": "Must match the ContractName in the Source Code or in a MultiPart Contract it should match the ContractName you deployed.",
    "constructor_arguments_ABIencoded_tip": "This option ONLY applies to contracts that accept constructor arguments, if you are unsure you most likely do not need this.The constructor arguments should be in ABI-ENCODED values and will be appended to the contract bytecode.",
    "library_1_name_tip": "This option ONLY applies to contracts that use libraries.",
    "library_contract_address_tip": "Corresponding Contract Library Address.",
    "contract_source_code_for": "The Contract Source code for",
    "has_already_been_verified": "has already been verified.",
    "click_here_to_view": "Click here to view the",
    "contract_was_creating_during": "contract was creating during",
    "constructor_arguements": "Constructor Arguements Used (ABI-encoded)",
    "ContractBytecode": "ContractBytecode",
    "ContractABI": "ContractABI",
    "start_over": "Start Over",
    "sorry_unable_contract_address": "Sorry！Unable to locate Contract code at ",
    "this_a_valid_contract_address": "this a valid contract address?",
    "successfully_generated_byteCode": "Successfully generated ByteCode and ABI for Contract Address ",
    "error_construct_ABI_encoded": "Missing Constructor Arguments/Library used for function ",
    "error_construct_bytecode_for": "Sorry! The Compiled Contract ByteCode for ",
    "the_contract_creation_code_for": " does NOT match the Contract Creation Code for ",
    "error_contract_ABI_for": "Sorry! The Compiled Contract ABI for",
    "unableto_verify_contract_source_code": "Unableto Verify Contract source code.",
    "contractname_found": "Contractname(s) found",
    /*
    ##################################################################################
    #                                                                                #
    # contract-type                                          #
    #                                                                                #
    ##################################################################################
    */
    "trigger_smart_contract": "Trigger Smart Contract",
    "normal_address_trigger_smart_contract": "Normal address trigger smart contract",
    "trigger": "Contract Triggers",
    "contract_triggers_total": "Contract Triggers",
    "contract_triggers_owner": "Owner",
    "contract_triggers_owner_address": "Owner Address",
    "no_tnx": "No Transaction",
    "no_event": "No Event",
    "link_test_fauct": "test faucet",
    "gain_bandwith": "Freeze TRX to gain bandwith",
    "gain_energy": "Freeze TRX to gain energy",
    "energy": "energy",
    "freeze_trx_gain_bandwith_energy": "You can gain bandwith or energy as well.",
    "freeze_type": "Freeze Type",
    "success_unfrozen_trx": "Successfully Unfrozen TRX",
    "please_select_the_type_of_unfreeze": "Please select the type of unfreeze",
    "unfreeze_bandwidth": "Unfreeze the bandwidth account to get TRX",
    "unfreeze_energy": "Unfreeze the energy account to get TRX",
    "hide_small_currency": "Hide small balances",
    "tokens_less_than_10": "Tokens with a quantity less than 10",
    "only_TRX_transfers": "Only TRX transfers",
    "no_transfers_found": "No transfers found",
    "current_MaxTPS": "Current/Max TPS",

    /*
    ##################################################################################
    #                                                                                #
    # exchange                                         #
    #                                                                                #
    ##################################################################################
   */

    "apply_for_the_currency": "Apply for the currency",
    "apply_for_process": "Apply for the currency process",
    "apply_content": "If you want to add coins, please fill out the application form to provide information about the currency. After submitting the information, we will review the data as soon as possible. Please wait patiently before replying to the audit results.",
    "operate_txn_pair_message": "Please enter an integer",
    "withdraw_all": "Not fully divested",
    "creat_valid": "Cannot exceed account balance",
    "my_trading_pairs": "My Trading Pairs",
    "create_trading_pairs": "Create Trading Pairs",
    "pairs": "Pairs",
    "no_pairs": "No Pairs",
    "capital_injection": "Capital Injection",
    "capital_withdrawal": "Capital Withdrawal",
    "pair_has_been_created": "Pair has been created",
    "successfully_created_pair": "Successfully created a deal pair",
    "pair_creation_failed": "pair creation failed",
    "successful_injection": "Successful Injection",
    "sorry_injection_failed": "Sorry, injection failed",
    "successful_withdrawal": "Successful Withdrawal",
    "sorry_withdrawal_failed": "Sorry, withdrawal failed",
    "select_the_name_of_the_Token": "Please select the name of the Token",
    "enter_the_amount": "Enter the Amount",
    "choose_a_Token_for_capital_injection": "Choose a Token for Capital Injection:",
    "choose_a_Token_for_capital_withdrawal": "Choose a Token for Capital Withdrawal:",
    "injection_amount": "Injection Amount:",
    "withdrawal_amount": "Withdrawal Amount:",
    "marks": "MARKET",
    "last_price": "Last price",
    "pairs_change": "Change",
    "H": "H",
    "L": "L",
    "O": "O",
    "C": "C",
    "24H_VOL": "24H VOL",
    "token_application_instructions_title": "Apply Token Listing",
    "token_application_instructions_1": "Tokens that have passed the review will be displayed on the DEX list. Unreviewed tokens can be traded by search function.",
    "click_here_to_apply": "Click here to apply",
    "TxTime": "Transaction Time",
    "TxAmount": "Transaction Amount",
    "TxRecord": "Transaction Record",
    "TxAvailable": "Available",
    "TxBuy": "Expected to buy",
    "TxSell": "Amount want to sell",
    "my_transaction": "My Transaction",
    "enter_the_trading_amount": "Enter the Trading Amount",
    "BUY": "BUY",
    "SELL": "SELL",
    "estimated_cost": "Estimated Cost",
    "estimated_revenue": "Estimated Revenue",
    "slightly_cost": "Slightly increase the estimated cost, and the turnover rate will be higher.",
    "slightly_revenue": "Slightly lower the estimated revenue, and the turnover rate will be higher.",
    "participation_message_2": "The issue time is not enabled, which means users cannot participate in the token on tronscan.",
    "created_token_time": "Created",
    "overview_TRC20": "TRC20 Overview",
    "overview_TRC10": "TRC10 Overview",
    "pice_per_onetrx": "Price (TRX)",
    "total_tokens": "Total tokens",
    "application_entry": "Application Entry",
    /*
    ##################################################################################
    #                                                                                #
    # commottee                                         #
    #                                                                                #
    ##################################################################################
   */
    "committee": "TRON Committee",
    "committee_dec_1": "TRON Committee is for modifying the dynamic parameters on the TRON network, e.g. block generation rewards, transaction fees, etc.",
    "committee_dec_2": "The Committee consists of the current 27 Super Representatives (SRs).",
    "committee_dec_3": "Each SR has the right to propose and vote on proposals.",
    "committee_dec_4": "When a proposal receives 19 votes or more from the SRs within the valid time frame, the proposal will be approved and its network parameters will be modified in the next maintenance period.",
    "get_committee_proposal": "Check committee proposals",
    "TRON_network_parameters": "TRON network parameters",
    "commission_proposed": "Committee proposals",
    "TRONSR": "TRON SR",
    "learn_more": "Learn More",
    "propose_number": "Number",
    "propose_parameters": "Parameter",
    "propose_current_value": "Current Value",
    "propose_hour": "Hour",
    "propose_1": "Propose to modify the maintenance interval of SR ",
    "propose_2": "Propose to modify the cost of applying for SR account",
    "propose_3": "Propose to modify the account creation fee",
    "propose_4": "Propose to modify the amount of TRX used to gain extra bandwidth",
    "propose_5": "Propose to modify asset issuance fee",
    "propose_6": "Propose to modify SR block generation reward",
    "propose_7": "Propose to modify the rewards given to the top 27 SRs and the following 100 candidates",
    "propose_8": "Propose to modify the cost of account creation",
    "propose_9": "Propose to modify the consumption of bandwith",
    "propose_10": "Propose to activate the Virtual Machine (VM)",
    "propose_11": "Propose to remove the GR Genesis votes",
    "propose_12": "Propose to modify the fee of 1 energy",
    "propose_13": "Propose to modify the cost of trading pair creation",
    "propose_14": "Propose to modify the maximum execution time of one transaction",
    "propose_15": "Propose to allow to change the account name",
    "propose_16": "Propose to allow the same token name",
    "propose_17": "Propose to allow resource delegation",
    "propose_18": "Propose to modify the total energy limit",
    "propose_19": "Propose to allow the TRC-10 token transfer in smart contracts",
    "propose_not_allowed": "Not allowed",
    "propose_allowed": "Allowed",
    "propose_activate": "Activate",
    "propose_finished": "Finished",
    "proposal_content_info": "Proposal Content",
    "proposer": "Proposer",
    "proposal_time_of_creation": "Time of Creation (UTC)",
    "proposal_time_of_expire": "Time of Expire (UTC)",
    "proposal_status": "Proposal Status",
    "proposal_to": " to ",
    "no_commission_proposed_found": "No Commission Proposed Found",
    "proposal_effective": "Effective",
    "proposal_voting": "Voting",
    "proposal_ineffective": "Ineffective",
    "proposal_cancelled": "Cancelled",
    "proposal": "Proposal",
    "approvers_of_the_proposal": "Approvers of the Proposal",
    "total_approving_votes": "Total Approving Votes",
    "to_provide_a_better_experience": "To provide a better experience, this statistic is updated every minute.",
    "TRC10_token": "TRC10 Token",
    "TRC20_token": "TRC20 Token",
    "TRC20_decimals": "Precision",
    "nav_more": "more",
    "no_holders_found": "No Token Holders Found",
    "search_TRC20": "Search Address",
    "beginners_guide": "Beginner's guide",
    "TRONdice":"Hold dice coin and get TRX dividend!",
    "Join_TRONdice": "-Join TRONdice!",
    "search_TRC20_error": " Please enter the correct address",
    "dex_announcement": "notice:",
    "regulations_on_trading_pairs": "Regulations on Trading Pairs",
    "How_to_trade_on_DEX": "How to trade on DEX",
    /*
      ##################################################################################
      #                                                                                #
      # about 关于我们                                         #
      #                                                                                #
      ##################################################################################
     */
    "about_us": "About Us",
    "what_we_do": "What are we doing?",
    "Transcan_desc": "Tronscan is the first block explorer based on TRON. It not only includes some basic functions of the block explorer, such as search query transactions, accounts, blocks, nodes, smart contracts; data statistics and queries on the chain, but also directly supports token creation. At the same time, Tronscan also has a built-in web wallet and Bancor-based DEX, which enriches the Tronscan application matrix.",
    "Our_team": "Community Contributor",
    "Team_desc": "Our team is the Blockchain Welfare Foundation in Malta and has been actively involved in the ecological construction of TRON. The team consists of more than 30 people all over the world, mostly developers and operators. In the future, we will be bound to the TRON ecological development in the long run. To perfect the Tronscan, we will also develop DApps based on TRON.",
    "User_many": "Tronscan users all over the world",
    "User_many_desc": "Every day, TRON supporters from around the world use the Tronscan block explorer, where they can query the details of the transaction and experience the latest features of TRON.",
    "HarryXu": "Provide front-end technical support ",
    "Skye": "Collect community comments and help solve them",
    "Ariml": "Provide more inspiration for the design of the page",
    "Lee": "Do a lot work of translation for the Japanese version",
    "YanZheng": "Provide back-end technical support",
    "Zach": "Provide back-end technical&test support",
    "Adolph": "Investigating the latest developments in the blockchain industry, making a lot of contributions to tronscan's product design and positioning",
    "Vincent Lau": "Provide a lot blockchain technical support",

    /*
    ##################################################################################
    #                                                                                #
    # new variables    2018-12-06                                    #
    #                                                                                #
    ##################################################################################
    */
    "newly_issued_token_by_tronscan": "The newly issued token can only be online after being audited by tronscan. If it fails to pass the audit, it will not be displayed",
    "Favorites":"Favorites",
    "dex_search_dec":"Enter the Abbreviation of the token",
    "freeze_trx_premessage_2":`Either one of bandwidth or energy can be acquired by each freeze. You cannot acquire both resources at the same time. When a user unfreeze a certain resource, his previous votes will be completely voided. If a user would like to vote using the remaining TRON Power, he will have to perform his voting operations all over again.`,
    "TRC20_exchange_online":"TRC20 exchange is online now",
    "Trade_on_TRXMarket":"Trade on TRXMarket",

    /*
   ##################################################################################
   #                                                                                #
   # notice  2018-12-10                                     #
   #                                                                                #
   ##################################################################################
  */
    "OthersArticle":"Articles in this group",
    "donateAddress":"DONATE",
    /*
     ##################################################################################
     #                                                                                #
     # trc20  2018-12-18                                     #
     #                                                                                #
     ##################################################################################
    */
   "trc20_nav_state":"logged on",
   "trc20_nav_dex":"DEX",
   "trc20_nav_trc10":"TRC10 Exchange",
   "trc20_nav_trc20": "TRC20 Exchange",
   "trc20_nav_tokenList":"Token Listing",
   "trc20_nav_aboutUs":"About",
   "trc20_footer_explain":"Rate standard",
   "trc20_footer_qa":"Q&A",
   "trc20_footer_standard_1":"The TRXMarket service charges are as follow:",
   "trc20_footer_standard_2": "•	Recharge: no need to recharge",
   "trc20_footer_standard_3": "•	Withdrawal: no withdrawal",
   "trc20_footer_standard_4": "•	Transaction: handling fee 0.1%",
   "trc20_footer_standard_5": "Note: The right to interpret the fee standard is owned by TRXMarket, and TRXMarket reserves the right to adjust the rate.",
   'trc20_apply_for_the_currency':"Apply for the currency",
   "trc20_apply_for_process":"Apply for the currency process",
   "trc20_apply_content":"If you want to add coins, please fill out the application form to provide information about the currency. After submitting the information, we will review the data as soon as possible. Please wait patiently before replying to the audit results.",
   "trc20_operate_txn_pair_message":"Please enter an integer",
   "trc20_withdraw_all":"Not fully divested",
   "trc20_creat_valid":"Cannot exceed account balance",
   "trc20_my_trading_pairs":"My Trading Pairs",
   "trc20_create_trading_pairs":"Create Trading Pairs",
   "trc20_pairs":"Pairs",
   "trc20_no_pairs":"No Pairs",
   "trc20_capital_injection":"Capital Injection",
   "trc20_capital_withdrawal":"Capital Withdrawal",
   "trc20_pair_has_been_created":"Pair has been created",
   "trc20_successfully_created_pair":"Successfully created a deal pair",
   "trc20_pair_creation_failed":"pair creation failed",
   "trc20_successful_injection":"Successful Injection",
   "trc20_sorry_injection_failed":"Sorry, injection failed",
   "trc20_successful_withdrawal":"Successful Withdrawal",
   "trc20_sorry_withdrawal_failed":"Sorry, withdrawal failed",
   "trc20_select_the_name_of_the_Token":"Please select the name of the Token",
   "trc20_enter_the_amount":"Enter the Amount",
   "trc20_choose_a_Token_for_capital_injection":"Choose a Token for Capital Injection:",
   "trc20_choose_a_Token_for_capital_withdrawal":"Choose a Token for Capital Withdrawal:",
   "trc20_injection_amount":"Injection Amount:",
   "trc20_withdrawal_amount":"Withdrawal Amount:",
   "trc20_marks":"market",
   "trc20_guide":"user guide",
   "trc20_last_price":"Last price",
   "trc20_pairs_change":"Change",
   "trc20_H":"H",
   "trc20_L":"L",
   "trc20_O":"O",
   "trc20_C":"C",
   "trc20_24H_VOL":"24H VOL",
   "trc20_price":"Price",
   "trc20_amount":"Amount",
   "trc20_enter_the_trading_amount":"Enter the Trading Amount",
   "trc20_enter_10":"Total ≥ 10 TRX",
   "trc20_enter_the_trading_price":"Enter the Trading Price",
   "trc20_TxAvailable":"Available",
   "trc20_BUY":"BUY",
   "trc20_SELL":"SELL",
   "trc20_token_application_instructions_title":"Token Application Instructions",
   "trc20_token_application_instructions_1":"For better user experience, please fill in the application with detailed information about the token that you would like to issue. After receiving your application, we will conclude the review of the information that you have submitted in 3 - 5 business days. Tokens without review will be hidden.",
   "trc20_click_here_to_apply":"Click here to apply",
   "trc20_TxTime":"Transaction Time",
   "trc20_TxAmount":"Transaction Amount",
   "trc20_TxRecord":"Trading Record",
   "trc20_CurOrder":"Current Order",
   "trc20_TxBuy":"Expected to buy",
   "trc20_TxSell":"Amount want to sell",
   "trc20_my_transaction":"My Tradings",
   "trc20_estimated_cost":"Estimated Cost",
   "trc20_estimated_revenue":"Estimated Revenue",
   "trc20_slightly_cost":"Slightly increase the estimated cost, and the turnover rate will be higher.",
   "trc20_slightly_revenue":"Slightly lower the estimated revenue, and the turnover rate will be higher.",
   "trc20_accumulative":"Total",
   "trc20_buy":"buy",
   "trc20_sell":"sell",
   "trc20_balance_tip":"Balance is not enough",
   "trc20_available_balance":"Balance",
   "trc20_volume":"Trading Amount",
   "trc20_cancel_order_confirm":"Are you sure you want to cancel this order?",
   "trc20_cancel":"No",
   "trc20_confirm":"Yes",
   "trc20_prompt":"Warning",
   "trc20_order_success":"Submitted successfully",
   "trc20_cancel_order_fail":"Cancel order fail",
   "trc20_order_fail":"Failure to submit",
   "trc20_downLoad_wallet1":"Please download wallet",
   "trc20_downLoad_wallet2":" to start your trade",
   "trc20_login_wallet":"Please login to your account for next step",
   "trc20_cur_order_header_order_time":"Time",
   "trc20_cur_order_header_order_type": "Type",
   "trc20_cur_order_header_price": "Price",
   "trc20_cur_order_header_amount": "Amount",
   "trc20_cur_order_header_volume": "Volume",
   "trc20_cur_order_header_progress": "Progress",
   "trc20_cur_order_header_action": "Operation",
   "trc20_cur_order_cancel": "Cancel",
   "trc20_trans_record_header_block":"Block Height",
   "trc20_trans_record_header_buyAdr":"Buyer",
   "trc20_trans_record_header_sellAdr": "Seller",
   "trc20_trans_record_header_amount": "Amount",
   "trc20_trans_record_header_time": "Time",
   "trc20_trans_record_header_price": "Price",
   "trc20_my_trans_header_time":"Time",
   "trc20_my_trans_header_type": "Type",
   "trc20_my_trans_header_price": "Price",
   "trc20_my_trans_header_amount": "Amount",
   "trc20_my_trans_header_volume": "Volume",
   "trc20_my_trans_header_status": "Status",
   "trc20_my_trans_header_detail": "Details",
   "trc20_my_trans_finish":"All dealt",
   "trc20_my_trans_part": "Partially dealt",
   "trc20_my_trans_cancle": "Cancel",
   "trc20_my_trans_check": "Check",
   "trc20_no_data":"No Data",
   "trc20_token_info_Token_Info":"Introduction",
   "trc20_token_info_Total_Name":"Name",
   "trc20_token_info_Token_Symbol":"Token Symbol",
   "trc20_token_info_Total_Supply":"Supply",
   "trc20_token_info_Circulating_Supply":"Circulating Supply",
   "trc20_token_info_Contract_Address":"Contract Address",
   "trc20_token_info_Website":"Website",
   "trc20_token_info_ths_1":"Pair",
   "trc20_token_info_ths_2": "Last Price",
   "trc20_token_info_ths_3": "24h Change",
   "trc20_token_info_ths_4": "24h High",
   "trc20_token_info_ths_5": "24h Low",
   "trc20_token_info_ths_6": "24h Volume",
   "trc20_token_info_ths_7": "24h Volume",
   "trc20_new_price":"Latest price",
   "trc20_exchange_status": "Trading Pair Status",
  "trc20_examine": "Reviewed",
  "trc20_unexamine": "Unreviewed",
  "trc20_id": "ID",
  "trc20_first_token": "First Token",
  "trc20_balance": "balance",
  "trc20_second_token": "Second Token",

    /*
      *  2018-12-18
    * */
    "create_deal_pair":"Create Trading Pairs",
    "add_deal_pair_desc":"Trading pair creation is available.",
    "click_create":"click here to create",
    "deal_pair_tip":"At least 100,000 TRX in your balance",
    "create_deal_pair_input_tip":"No less than 100,000 TRX in the pool",
    "create_deal_pair_input_tip2":"The offering price cannot be altered after successful creation, one creation burns 1024 TRX",
    "publish_price":"Your offering price is",
    "pool_revert":"The balance of TRX in pool should be no less than 100,000",
    "sign_in_with_TRONlink":"Sign in with TRONlink",
    "import_a_wallet":"Import a wallet",
    "sign_in_TRONlink_warning":"Please install TRONlink and refresh the page",
    "sign_in_TRONlink":"Sign in with TRONlink",
    "uninstall_TRONlink":"Haven't installed TRONlink yet? Click here",
    "change_login_method":"TRONlink login does not support this function at present, please use private key or keystore file to login .",
    "Create_token_link_message_0": "The token will be listed only if it has passed the token review of tronscan.",
    "sign_in_TRONlink_warning_0":"Please log in to the TRONlink wallet!",
    "account_ad":"Win dice tokens by playing TRONDice. Pledge dice tokens to win TRX dividends every day",
    "bandwidth_tip":"On TRON, bandwidths will be consumed with any transaction but query 5,000 bandwidths will be given to each activated account every day by the system. Users can earn bandwidths by freezing TRX.",
    "energy_tip":"On TRON, the creation and triggering of smart contracts consume Energy. Users can gain Energy through freezing TRX.",
    "power_tip":"TRON Power (TP) is used for voting for TRON SRs. Users can gain TP through freezing TRX.",
    "token_precision":"Token Precision",
    "token_precision_message_0":"Set the precision of the token as required, the range is 0-6",

};
