/*
    ##################################################################################
    #                                                                                #
    #  $$$$$$$$\                                                                     #
    #  \__$$  __|                                                                    #
    #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
    #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
    #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
    #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
    #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
    #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
    #                                                                                #
    ##################################################################################
    #                                                                                #
    #         Template for translating the tronscan.org website                      #
    #         Version: 2020 Q2                                                      #
    #         Update Date: 04.2020                                                #
    #         Language: Farsi 波斯语                                                  #
    #         Status: Approved Version                                               #
    #         Number of checks: 5                                                    #
    #                                                                                #
    ##################################################################################
*/

export const lang20Q2 = {
   //well 20200414
   index_page_nav_more_support:'کمک پشتیبانی کنید',
   index_page_nav_more_guide:'راهنمای تازه کار',
   index_page_nav_more_service:'خدمات',
   index_page_price_loading:'Loading',
   index_page_price_time_out:'Time out',

   open_tron_app_on_verify_address: "Please confirm login account on TRON APP",
}