/*
    ##################################################################################
    #                                                                                #
    #  $$$$$$$$\                                                                     #
    #  \__$$  __|                                                                    #
    #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
    #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
    #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
    #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
    #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
    #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
    #                                                                                #
    ##################################################################################
    #                                                                                #
    #         Template for translating the tronscan.org website                      #
    #         Version: 2020 Q2                                                       #
    #         Update Date: 04.2020                                                  #
    #         Language:  zh                                                            #
    #         Status: Approved Version                                               #
    #         Number of checks: 5                                                    #
    #                                                                                #
    ##################################################################################
*/

export const lang20Q2 = {
    //well 20200414
    index_page_nav_more_support:'支持与帮助',
    index_page_nav_more_guide:'新手引导',
    index_page_nav_more_service:'周边服务',
    index_page_price_loading:'加载中',
    index_page_price_time_out:'请求超时',
    
    //2020-04-24  transfer optimization
    transfer_address_not_activated:'地址未激活，将额外消耗 0.1 TRX 用于激活该地址（0.1 TRX 不包含在转账数量内）',
    

}