/*
    ##################################################################################
    #                                                                                #
    #  $$$$$$$$\                                                                     #
    #  \__$$  __|                                                                    #
    #     $$ | $$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$$\  $$$$$$$\$$$$$$\  $$$$$$$\     #
    #     $$ |$$  __$$\ $$  __$$\ $$  __$$\ $$  _____|$$  _____\____$$\ $$  __$$\    #
    #     $$ |$$ |  \__|$$ /  $$ |$$ |  $$ |\$$$$$$\  $$ /     $$$$$$$ |$$ |  $$ |   #
    #     $$ |$$ |      $$ |  $$ |$$ |  $$ | \____$$\ $$ |    $$  __$$ |$$ |  $$ |   #
    #     $$ |$$ |      \$$$$$$  |$$ |  $$ |$$$$$$$  |\$$$$$$$\$$$$$$$ |$$ |  $$ |   #
    #     \__|\__|       \______/ \__|  \__|\_______/  \_______\_______|\__|  \__    #
    #                                                                                #
    ##################################################################################
    #                                                                                #
    #         Template for translating the tronscan.org website                      #
    #         Version: 2020 Q1                                                       #
    #         Update Date: 01-03.2020                                                #
    #         Language:  Russian 俄语                                                 #
    #         Status: Approved Version                                               #
    #         Number of checks: 5                                                    #
    #                                                                                #
    ##################################################################################
*/

export const lang20Q1 = {
    data_resource_table_title: "Пиковое Потребление Энергии",
    data_resource_table_rank: "Рейтинг",
    data_resource_table_account: "Аккаунт",
    data_resource_table_freezingTRX_energy: "Энергия от Замораживания TRX",
    data_resource_table_burningTRX_energy: "Энергия от Сжигания TRX",
    data_resource_table_energy_consumed: "Общее Количество Потребляемой Энергии",
    data_resource_table_percentage: "Процент",
    data_resource_table_percentage_tips: "Энергия, потребляемая пользователем / Энергия, потребляемая всеми пользователями",
    data_resource_table_bandwidth_title: "Пиковое Потребление Пропускной Способности",
    data_resource_table_total: "Общее количество",
}